{"/big-data-conference-uk-2015/public/schedule/speaker/205398": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/205398", "bio": "Gareth has been working at HP on innovative solutions in the Analytics and Data Management space for four years and took over the ownership of the Big Data Analytics portfolio for EMEA in 2013.  Gareth’s team works on a variety of solutions for our customers in spaces such as; machine and sensor data analysis, social media analysis, eDiscovery, event and streaming data analytics, and image, voice & video analytics to name a few.  Prior to joining HP, Gareth worked in the Business Intelligence consulting space for 7 years with particular focus on Utilities, FSI, Retail and Life Sciences.  He also has a BSc in Microbiology & Microbial Genetics.", "info": "Big Data Services Lead – EMEA, HP Enterprise Services", "name": "Gareth Martin", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_205398.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/204628": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/204628", "bio": "Website\n\nGilles Noisette is a Master Solution Architect at the HP EMEA Solution Innovation center. He is the technical lead of the HP EMEA Big Data Center of Excellence, promoting HP Big Data solutions, and doing the link between HP Division, HP labs and the field, helping to explore and develop innovative solutions. Since twenty years that he is with HP, Gilles is working on emerging technologies.", "info": "MAster Solution Architect, HP", "name": "Gilles Noisette"}, "/big-data-conference-uk-2015/public/schedule/speaker/192901": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/192901", "bio": "Dimitris is responsible for the Big Data Analytics ISV go to market in EMEA and provides the company thought leadership and direction to the set of software partnerships, industry practices and horizontal capabilities within the regional organization.\nHe has extensive expertise in the telecommunications, Media & Entertainment and IT industry and over 25 years of experience in sales leadership and business development roles in various companies. Previously he was Head of Media & Entrainment in Cisco EMEA where he defined and created the Media business with new solutions and partnerships.\nDimitris earned his diploma in Computer Engineering & Science from the University of Patras (Greece) and an International MBA from the Athens University of Business & Economics.", "info": "Big Data and Analytics ISV go to market Manager, EMEA, Cisco", "name": "Dimitris Papavassiliou"}, "/big-data-conference-uk-2015/public/schedule/speaker/189209": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/189209", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nOlivier Girardot is a software engineer and co-founder of Lateral Thoughts. He works on machine learning, big data, and DevOps solutions with clients to help them tackle problems that require both expertise and experience, in order to become more efficient both as a company and as a team.", "info": "Associé, Lateral Thoughts", "name": "Olivier Girardot", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_189209.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/126882": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/126882", "bio": "Website | @gwenshap\r\n\r\n\r\n | Attendee Directory Profile\n\nGwen Shapira is a solutions architect at Cloudera and leader of the IOUG Big Data SIG. Gwen studied computer science, statistics, and operations research at the University of Tel Aviv, and then went on to spend the next 15 years in various technical positions in the IT industry. She specializes in scalable and resilient solutions, and helps her customers build high-performance large-scale data architectures using Hadoop. Gwen is a frequent presenter at conferences and regularly publishes articles in technical magazines and her blog.", "info": "Solutions Architect, Cloudera", "name": "Gwen Shapira", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_126882.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/183010": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/183010", "bio": "Ryan Blue is a Software Engineer at Cloudera, currently working on the Kite SDK team.", "info": "Software Engineer, Cloudera", "name": "Ryan Blue", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_183010.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193658": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193658", "bio": "| Attendee Directory Profile\n\nZbigniew Baranowski is a database systems specialist and a member of a group which provides and supports central database services at CERN.", "info": "CERN", "name": "Zbigniew Baranowski"}, "/big-data-conference-uk-2015/public/schedule/speaker/137780": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/137780", "bio": "Website | @vintfalken\r\n\r\n\r\n | Attendee Directory Profile\n\nAnn has extensive experience as a UX and UI designer for serious games and virtual worlds, as well as mobile apps. She has served as community and editorial manager for history brand Heritage Key. She enjoys nothing more than to think, talk, and work around customer-focused design, privacy and value for personal data, the future of technology, and the effect our minds’ “wiring” has on our behaviour, expectations, and reasoning.\nAt Argus Labs, as head of creative and UX she’s involved in marketing, product design, and behaviour research.", "info": "Head of Creative & UX, Sentiance", "name": "Ann Wuyts", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_137780.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193653": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193653", "bio": "| Attendee Directory Profile\n\nTyler Akidau is a staff software engineer at Google. The current tech lead for internal streaming data processing systems (e.g. MillWheel), he’s spent five years working on massive-scale streaming data processing systems. He passionately believes in streaming data processing as the more general model of large-scale computation. His preferred mode of transportation is by cargo bike, with his two young daughters in tow.", "info": "Staff Software Engineer, Google", "name": "Tyler Akidau", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193653.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/190129": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/190129", "bio": "| Attendee Directory Profile\n\nAnkit Tharwani is proposition manager, Information Business, Personal and Corporate Banking at Barclays Bank PLC.", "info": "Barclays Bank", "name": "Ankit Tharwani"}, "/big-data-conference-uk-2015/public/schedule/speaker/190455": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/190455", "bio": "Richard Shaw is a software architect for MapR, introducing companies to the wonders of Hadoop and helping them understand how it can help their business. With a background in DevOps and NoSQL, Richard has held positions with General Motors, Guardian Media Group, Betfair, and most recently Basho Technologies.", "info": "Director of Systems Engineering, EMEA, MapR", "name": "Richard Shaw", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_190455.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193655": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193655", "bio": "| Attendee Directory Profile\n\nShashank is a software engineer at Microsoft. Wearing several caps over the past decade, he has been building production pipelines for large scale data processing. Previously, he served as a project lead at HCL America.", "info": "Software Engineer, Microsoft", "name": "Shashank Singh"}, "/big-data-conference-uk-2015/public/schedule/speaker/172046": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/172046", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nScott Kurth is VP, Advisory Services, at Silicon Valley Data Science. Building on 20 years of experience making emerging technologies relevant to enterprises, Scott crafts vision and strategy for organizations. With a background in architecture and engineering, he combines deep technical knowledge with a broad perspective, to focus on business value.", "info": "VP Advisory Services, Silicon Valley Data Science", "name": "Scott Kurth", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_172046.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/189922": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/189922", "bio": "| Attendee Directory Profile\n\nNeil Martin is a senior project manager at comparethemarket.com, part of the BGL Group in Peterborough, England. He has a 17-year career in project management across the financial services and utilities industries, having spent time at Pearl Assurance and EON. Neil has been part of the BGL Group for seven years, delivering new insurance schemes for several well known global banks, leading the change programme in legal services and most recently delivering the data roadmap in comparethemarket. He resides in Peterborough and is a keen runner.", "info": "Senior Project Manager, comparethemarket.com", "name": "Neil Martin"}, "/big-data-conference-uk-2015/public/schedule/speaker/193426": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193426", "bio": "Website | @anirudhkoul\r\n\r\n\r\n | Attendee Directory Profile\n\nAnirudh Koul is a data scientist at Microsoft. He brings eight years of applied research experience on petabyte-scale social media datasets including Facebook, Twitter, Yahoo Answers, Quora, Foursquare, and Bing. He has worked on a variety of machine learning, natural language processing, and information retrieval-related projects at Yahoo, Microsoft, and Carnegie Mellon University. Rapidly prototyping ideas, he has won over two dozen innovation, programming, and 24 hour-hackathon contests organized by companies including Facebook, Google, Microsoft, IBM, and Yahoo. Koul was also the keynote speaker at the SMX conference in Munich (March 2014), where he spoke about trends in applying machine learning on big data. You can read more about him here: http://linkedin.com/in/anirudhkoul", "info": "Data Scientist, Microsoft", "name": "Anirudh Koul", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193426.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/134675": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/134675", "bio": "Website | @jseidman\r\n\r\n\r\n | Attendee Directory Profile\n\nJonathan is a solutions architect on the Partner Engineering team at Cloudera. Before joining Cloudera, he was a lead engineer on the Big Data team at Orbitz Worldwide, helping to build out the Hadoop clusters supporting the data storage and analysis needs of one of the most heavily trafficked sites on the Internet.  Jonathan is also a co-founder of the Chicago Hadoop User Group and the Chicago Big Data meetup, and a frequent speaker on Hadoop and big data at industry conferences such as Hadoop World, Strata, and OSCON. Jonathan is co-authoring a book on architecting applications with Apache Hadoop for O’Reilly Media.", "info": "Solutions Architect, Cloudera", "name": "Jonathan Seidman", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_134675.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/205523": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/205523", "bio": "Website\n\nPaul Davies is responsible for leading Cisco’s Big Data Solutions portfolio across EMEAR, engaging with Customers, Partners and ISVs on Big Data and Analytics opportunities. Paul joined Cisco’s Data Center team in 2009, after previously working as an Enterprise Architect in Oracle, and a Consultant at Hitachi.", "info": "Enterprise Architect - Big Data Solutions Sales Leader, EMEAR Data Centre & Virtualisation, Cisco", "name": "Paul  Davies"}, "/big-data-conference-uk-2015/public/schedule/speaker/141417": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/141417", "bio": "Website | @fhr\r\n\r\n\r\n | Attendee Directory Profile\n\nFrancine Bennett is a data scientist, and the CEO and cofounder of Mastodon C. Mastodon C are agile big data specialists who offer open source Hadoop-powered technology and the technical and analytical skills which help organisations realise the potential of their data. Before founding Mastodon C, Bennett spent a number of years working on big data analysis for search engines, helping them turn lots of data into even more money. She enjoys good coffee, running, sleeping as much as possible, and exploring large datasets.", "info": "CEO and cofounder, Mastodon C", "name": "Francine Bennett", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_141417.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/202824": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/202824", "bio": "Website | @tomgeva\r\n\r\n\r\n | Attendee Directory Profile\n\nAn IT workload automation expert, Tom has served as a Control-M product manager for more than 10 years. He was responsible for translating the workload automation market requirements gathered from customers and analysts into product and business strategies, roadmap, and specifications. Tom was deeply involved in the development process of all the Control-M releases. He frequently speaks in Control-M seminars, user groups, and customer briefings. Tom has 17 years of experience in the IT industry. Prior to joining BMC Software in 2001, he spent four years as a production control manager in the Israeli Defense Force and was responsible for workload automation and MF education services.", "info": "Sr. Solution Marketing Manager, BMC Software", "name": "Tom Geva", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_202824.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/202557": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/202557", "bio": "Julie Meyer is a leading investor and entrepreneur in digital, high-growth, early stage businesses around the world. She has driven many continent-wide initiatives for creating wealth and growth in the European economy. Julie believes that ‘Individual Capitalism’ is the force of the 21st century. She trusts people’s ingenuity to solve the world’s problems at both the macro and micro levels – and to expand prosperity.", "info": "Chairman, CEO & Founder, Ariadne Capital", "name": "Julie Meyer", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_202557.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/17816": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/17816", "bio": "Website | @acroll\r\n\r\n\r\n | Attendee Directory Profile\n\nAlistair has been an entrepreneur, author, and public speaker for nearly 20 years. He’s worked on a variety of topics from web performance, to big data, to cloud computing, to startups. In 2001 he co-founded web performance startup Coradiant (acquired by BMC in 2011), and since then has also launched Rednod, CloudOps, Bitcurrent, Year One Labs, the Bitnorth conference, the International Startup Festival, and several other early-stage companies.\nAlistair is a chair for Strata + Hadoop World conferences; Techweb’s Cloud Connect; and the International Startup Festival. He’s written four books on analytics, technology, and entrepreneurship including the best-selling Lean Analytics, which is being translated into eight languages. He lives in Montreal, Canada and tries to mitigate chronic ADD by writing about far too many things at Solve For Interesting.", "info": "Founder, Solve For Interesting", "name": "Alistair Croll", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_17816.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193728": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193728", "bio": "| Attendee Directory Profile\n\nYang Li is the tech lead for Apache Kylin. He joined eBay-Shanghai in January 2014 as a member of the technical staff, and has been a key developer and architect of the Kylin OLAP engine. Yang also leads the Kylin team of engineers in Shanghai, where they develop the Kylin product and deploy it for eBay as an analytics platform. Prior to eBay, Yang spent eight years with IBM and two years with Morgan Stanley. At IBM, Yang was focused on the core Java library (Apache Harmony), J2EE, and big data engineering development. He was the technical lead at IBM User Technologies and won the Outstanding Technical Achievement Award in 2008. During his time with Morgan Stanley, Yang was the vice president of the Asia Markets team responsible for global regulatory reporting architecture, engine development, and end-to-end production support infrastructure. Yang received his Master’s degree from the School of Computer Science at Shanghai Jiaotong University, a highly-ranked school for computer science in China.", "info": "eBay", "name": "Yang Li"}, "/big-data-conference-uk-2015/public/schedule/speaker/164706": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/164706", "bio": "David is CEO, president and co-founder of WANdisco, and has quickly established WANdisco as one of the world’s most promising technology companies.\nSince co-founding the company in Silicon Valley in 2005, David has led WANdisco on a course for rapid international expansion, opening offices in the UK, Japan, and China. David spearheaded the acquisition of AltoStor, which accelerated the development of WANdisco’s first products for the big data market. The majority of WANdisco’s core technology is now produced out of the company’s flourishing software development base in David’s hometown of Sheffield, England and in Belfast, Northern Ireland.\nDavid has become recognized as a champion of British technology and entrepreneurship. In 2012, he led WANdisco to a hugely successful listing on the London Stock Exchange (WAND:LSE), raising over £24m to drive business growth.\nWith over 15 years’ executive experience in the software industry, David sits on a number of advisory and executive boards of Silicon Valley start-up ventures. A passionate advocate of entrepreneurship, he has established many successful start-up companies in enterprise software and is recognized as an industry leader in enterprise application integration and its standards.\nDavid is a frequent commentator on a range of business and technology issues, appearing regularly on Bloomberg and CNBC. Profiles of David have appeared in a range of leading publications including the Financial Times, The Daily Telegraph, and the Daily Mail.\nDavid holds a BSc degree in computer science from the University of Huddersfield, England.", "info": "CEO, WANdisco", "name": "David Richards"}, "/big-data-conference-uk-2015/public/schedule/speaker/126525": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/126525", "bio": "Website | @frabcus\r\n\r\n\r\n | Attendee Directory Profile\n\nA technology leader, Francis created the original TortoiseCVS, which has improved version control for tens of millions of people. He was a founder of TheyWorkForYou and WhatDoTheyKnow, which show the world how to use scraping and good user experience to improve democracy. Irving has a BA in mathematics from Oxford.", "info": "CEO, ScraperWiki Ltd.", "name": "Francis Irving", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_126525.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/144901": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/144901", "bio": "| Attendee Directory Profile\n\nJai is the director of product strategy at Cloudera where he is responsible for planning the future roadmap of Cloudera products. Before Cloudera he spent a decade at VMware, where among other things he was one of the developers of vMotion, storage vMotion, and the distributed management framework for vSphere.", "info": "Product Manager, Cloudera", "name": "Jairam Ranganathan", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_144901.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/192158": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/192158", "bio": "| Attendee Directory Profile\n\nAs senior director of the Analytical Platform Centre of Excellence, Mark Torr leads a distributed team of domain experts in the fields of data management, analytics, reporting, and enterprise architecture.\nMark supports customers in multiple industries, frequently meeting with C-level, enterprise architects, and SAS users at customer sites, with a special emphasis over the past four years on the effects and opportunities of big data. He speaks on a wide variety of topics at SAS and external conferences, and hosts keynote technology sessions at regional and global user forums to unveil SAS’s latest innovations.\nMark is a TOGAF-certified enterprise architect with nearly 20 years IT experience. He graduated with first class honors from Hull University, England with a degree in special software engineering. Mark is an avid half-marathon runner and an aspiring long distance mountain biker.", "info": "Senior Director - EMEA and AP Analytical Center of Excellence, SAS", "name": "Mark Torr", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_192158.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/177668": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/177668", "bio": "| Attendee Directory Profile\n\nXuefu Zhang has over 10 years experience in software development. Working for Cloudera since May 2013, he spends a lot of his efforts on Apache Hive and Pig. Prior to joining Cloudera, Xuefu Zhang served for Inadco, an online ads serving company, as the chief architect. In that role, Apache projects were widely introduced and adopted on the company’s technology stack. He also worked in the Hadoop team at Yahoo when the majority of the development on Hadoop was still there. In addition, he spent his early career at Informatica, gaining important experience on enterprise software development, especially in ETL. Xuefu Zhang is a PMC member for Hive and Sentry, and a committer for the Pig project.", "info": "Software Engineer, Cloudera", "name": "Xuefu Zhang", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_177668.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/157263": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/157263", "bio": "Website | @CodeBeard\r\n\r\n\r\n | Attendee Directory Profile\n\nCTO and founding member of DataShaka.\nBig beardy geek.", "info": "CTO, DataShaka", "name": "Phil Harvey", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_157263.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/152591": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/152591", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nPatrick Wendell is a cofounder of Databricks and committer and PMC member of Apache Spark. He is the release manager of Spark’s 1.0, 1.1, and 1.2 releases. Before helping start Databricks, Patrick was a Ph.D student working in the U.C. Berkeley AMPLab, focusing on large scale data-intensive computing and advised by Ion Stoica.", "info": "UC Berkeley Graduate Student, Databricks", "name": "Patrick Wendell", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_152591.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/139926": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/139926", "bio": "Website | @noelwelsh\r\n\r\n\r\n | Attendee Directory Profile\n\nNoel has over 15 years experience in software architecture and development, and over a decade in machine learning and data mining. His current project is Myna, which makes bandit algorithms accessible to all. Previous projects he’s been involved with include one of the first commercial products to apply machine learning to the internet (eventually acquired by Omniture), a BAFTA-award winning website, and a custom CMS used daily by thousands of students.\nNoel is an active writer, presenter, and open source contributor. Noel has a PhD in machine learning from the University of Birmingham.", "info": "Partner, Underscore Consulting", "name": "Noel Welsh", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_139926.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/171326": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/171326", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nShawn is the director of product at GraphLab where he helps make it easy to build cool experiences with data. He is data geeky and loves inspired technologies, businesses, and gadgets. His technical background spans recommendation systems and business analytics, physics simulations, and energy. He holds a PhD in materials science from Stanford University and a BA in physics from Cornell University.", "info": "Director of Product, Dato", "name": "Shawn Scully", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_171326.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/148403": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/148403", "bio": "Website | @nateshetterley\r\n\r\n\r\n | Attendee Directory Profile\n\nNathan Shetterley is a senior manager for Accenture’s research into emerging data architectures, analytics, and visualizations. He leads multiple teams of researchers and developers who are building data-driven analytical solutions based on the next generation of distributed, horizontally-scaling data storage and analysis technologies, using cutting-edge data acquisition, integration, quality, processing, and end-to-end enterprise data management, analytic, and visualization technologies.\nShetterley is an experienced data architect with a background in smart grid/AMI operations strategy, serving either in SI&T, ESCO, or utility client roles for most of his career. He has extensive experience with home area network technologies, measurement and verification, and AMI/smart grid process design. Nathan also has deep expertise in RFP evaluation and vendor management.", "info": "Senior Data Insights R&D Manager, Accenture", "name": "Nathan Shetterley", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_148403.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/199825": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/199825", "bio": "@coryoreo\r\n\r\n\r\n | Attendee Directory Profile\n\nCory is a product manager on Google Cloud Platform’s storage team in Mountain View, focused on releasing Google’s techno-wizardry on an unsuspecting world. Before Google, Cory worked in cybersecurity, designing the machine learning systems supporting real-time fraud detection for the social web at Impermium (acquired by Google). Prior to rejoining the world of high-technology, Cory lived his life as a rocket/satellite scientist, building probabilistic and event-based simulations of complex aerospace systems.\nHe finds himself to be enthusiastic, in one way or another, about nearly everything.", "info": "Product Manager, Google", "name": "Cory O'Connor", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_199825.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/152293": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/152293", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nJacques Nadeau is VP of Apache Drill with the Apache Software Foundation and drives MapR’s development of Apache Drill. He is an industry veteran with over 15 years of big data and analytics experience. Most recently, he was cofounder and CTO of search engine startup YapMap. Before that, he was director of new product engineering with Quigo (contextual advertising, acquired by AOL in 2007). He also built the Avenue A | Razorfish analytics data warehousing system and associated services practice (acquired by Microsoft).", "info": "PMC Chair, Apache Drill, Apache Foundation/MapR", "name": "Jacques Nadeau", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_152293.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/187700": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/187700", "bio": "| Attendee Directory Profile\n\nAs the strategy lead for the Data Insights group at Accenture’s Technology Labs, Hallie helps her team take industry-leading research and innovation to market, focusing on deriving insights and delivering action for both internal and client partners.\nShe also runs our global data science workshop program, which delivers an interactive, engaging full-day workshop to analytics clients around the world.", "info": "R&D Associate Principal, Accenture", "name": "Hallie Benjamin", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_187700.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/203397": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/203397", "bio": "@matt_speaks\n\nMatt is a Senior Interaction Designer and Project Lead at IDEO in London. IDEO is an award-winning global design firm that takes a human-centred, design-based approach to helping organisations in the public and private sectors innovate and grow.\nMatt is also, researcher, hacker and maker. He is an exponent of data as a design tool and is currently exploring how it finds a home in a human centred design process.\nIn the last twelve months Matt has leadteams developing a broad range of products, services and experiences – from digital strategy and design for a national media institution to new mobility platforms for a global car company.", "info": "Interaction Designer and Project Lead, IDEO", "name": "Matt Cooper-Wright", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_203397.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/5107": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/5107", "bio": "Website | @rogerm\r\n\r\n\r\n | Attendee Directory Profile\n\nRoger Magoulas is the research director at O’Reilly Media and chair of Strata + Hadoop World conferences. Roger and his team build the analysis infrastructure, and provide analytic services and insights on technology adoption trends to business decision-makers at O’Reilly and beyond. We find what excites key innovators and use those insights to gather and analyze faint signals from various sources to make sense of what others may adopt and why.​", "info": "Research Director, O'Reilly Media", "name": "Roger Magoulas", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_5107.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/43459": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/43459", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nTom White has been an Apache Hadoop committer since February 2007, and is a member of the Apache Software Foundation. He is the author of “Hadoop: The Definitive Guide” for O’Reilly. Previously he worked as an independent consultant specializing in Hadoop, and before that was co-founder and lead developer at Kizoom, a UK mobile applications startup. Tom has a Bachelor’s degree in Mathematics from the University of Cambridge, and a Master’s degree in History and Philosophy of Science from the Universities of Leeds, UK, and Florence, Italy.", "info": "Software Engineer, Cloudera", "name": "Tom White", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_43459.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/191040": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/191040", "bio": "Website | @mcintold\r\n\r\n\r\n | Attendee Directory Profile\n\nAs a professor and health data scientist at Washington University School of Medicine, Leslie is in a unique position – she has access to vast amounts of health data, connections, and interest in working with startups, and is active in moving data science forward in the health community. Within the university, she oversees the collection, management, analysis, sharing, and visualization of electronic health records and clinical research data. Leslie is also an organizer of the St. Louis Machine Learning and Data Science and Health Data Geeks Meetups – providing presentations, trainings, and connections in the St. Louis metropolitan area to those interested in a data-driven world.", "info": "Director, Center for Biomedical Informatics, Washington University School of Medicine", "name": "Leslie McIntosh", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_191040.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193675": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193675", "bio": "Website | @lukehq\r\n\r\n\r\n | Attendee Directory Profile\n\nCo-creator and PMC member of Apache Kylin, Sr. Product Manager of eBay.\nLuke Han joined eBay in late 2011 as staff BI architect of Business Intelligence Platform Team. He is Sr. Product Manager of Kylin managing the evolution of the Kylin as the Interactive Analytics solution on top of Hadoop, driving  Kylin’ vision, roadmap, features, plan, Engaging customers and coordinating various teams from different geographies, developing partners internal and external to grow up Apache Kylin community.\nPrior to eBay, Luke was a Sr. Consultant at Actuate.", "info": "Sr. Product Manager, eBay", "name": "Luke Han", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193675.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/204542": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/204542", "bio": "Tim is an economist, journalist, and broadcaster. He is author of the million-selling “The Undercover Economist”, a senior columnist at the Financial Times, and the presenter of Radio 4’s “More or Less”. Tim has spoken at TED, PopTech, and the Sydney Opera House and is a visiting fellow of Nuffield College, Oxford. He is  Economics Commentator of the Year, 2014.", "info": "Senior columnist, The Financial Times", "name": "Tim Harford", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_204542.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/146540": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/146540", "bio": "Website | @pacoid\r\n\r\n\r\n | Attendee Directory Profile\n\nO’Reilly author (Just Enough Math and Enterprise Data Workflows with Cascading) and a “player/coach” who’s led innovative data teams building large-scale apps. Director of community evangelism for Apache Spark with Databricks, advisor to Amplify Partners. Expert in machine learning, cluster computing, and enterprise use cases for big data.", "info": "Director of Community Evangelism, Databricks", "name": "Paco Nathan", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_146540.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/192647": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/192647", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nAlex Sicoe is a software engineer at Big Data Partnership working with clients on projects involving scalable storage and compute systems like Apache Spark, Apache Cassandra, Apache Storm, and Apache Hadoop. He has extensive experience building data pipelines involving such systems as well as giving training courses on them. Alex is the first ever certified Databricks trainer. Previously he worked at CERN on building a large scale monitoring system for the ATLAS experiment on top of Apache Cassandra.", "info": "Big Data Engineer , Big Data Partnership", "name": "Alexandru Sicoe", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_192647.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/77526": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/77526", "bio": "Website | @deanwampler\r\n\r\n\r\n | Attendee Directory Profile\n\nDean Wampler, Ph.D. is the architect for Big Data Products and Services for Typesafe. He builds scalable, distributed applications using Spark, Hadoop, Mesos, Scala, and the Typesafe Reactive Platform. He is the author of several books for O’Reilly on Scala, Hive, and Functional Programming. Dean is a contributor to several open source projects, and co-organizes several technology conferences and Chicago-based user groups.", "info": "Consultant, Typesafe", "name": "Dean Wampler", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_77526.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/163199": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/163199", "bio": "Website | @sireb\r\n\r\n\r\n | Attendee Directory Profile\n\nSimon is a solutions engineer at Hortonworks, where he helps clients do Hadoop. He is a certified Spark and Hadoop developer. Previously he has worked in the data intensive worlds of hedge funds and financial trading, ERP and e-Commerce, as well as designing and running nationwide networks and websites.\nIn the course of those roles, he’s designed and built several organisation-wide data and networking infrastructures, headed up research and development teams, and designed (and implemented) numerous digital products and high-traffic transactional websites.\nFor a change of technical pace, he messes around with electronics, writes on front-end web technologies, performance, and data science.", "info": "Solutions Engineer, Hortonworks", "name": "Simon Elliston Ball", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_163199.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/196005": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/196005", "bio": "Cait joined Shazam in November 2013 as VP of product, music, and platforms. She is responsible for their hugely successful mobile and web products as well as the music roadmap. Cait joined Shazam from the BBC where she held a number of roles including head of product for sport. Cait was responsible for the digital development for the BBC’s coverage of the 2012 Olympic Games across web, mobile, and connected TV.", "info": "VP of Product, Music and Platforms, Shazam", "name": "Cait O'Riordan", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_196005.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/6649": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/6649", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nLars Trieloff is director of product management at Blue Yonder, one of the leading European companies providing platforms for predictive applications. He is responsible for product roadmap, strategy, and marketing. Prior to Blue Yonder, Lars was responsible for product management for Adobe Marketing Cloud and Day Software’s content management platform.\nPassionate about creating products that make work easier and help companies run better, Lars combines technological and business thinking into an outcome-oriented approach toward product and innovation management.\nAfter a stint in San Francisco, Lars lives with his family in Potsdam, Germany.", "info": "Director Product Management, Blue Yonder", "name": "Lars Trieloff", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_6649.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/153598": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/153598", "bio": "Website | @jbenno\r\n\r\n\r\n | Attendee Directory Profile\n\nJoerg Blumtritt is founder and CEO of Datarella, a computational social science startup that delivers mobile analytics, self-tracking solutions, and data science consulting.\nAfter graduating from university with a thesis on machine learning, Joerg started working as a researcher in behavioural sciences, focusing on nonverbal communication. His projects were funded by an EU commission, the German federal government, and the Max Planck Society. He subsequently ran marketing and research teams for TV networks ProSiebenSat.1 and RTL II, and magazine publisher Hubert Burda Media. As European operations officer for Tremor Media, a New York-based video ad network, Joerg was in charge of building its European enterprises. Recently he worked as managing director for MediaCom Germany.\nJoerg is founder and chairman of the German Social Media Association (AG Social Media), and is co-author of the Slow Media Manifesto. Joerg blogs about Big Data and the future of social research at beautifuldata.net, and about The Quantified Self at datarella.com.", "info": "CEO, Datarella™", "name": "Joerg Blumtritt", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_153598.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/147273": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/147273", "bio": "Website | @mark_grover \r\n\r\n\r\n | Attendee Directory Profile\n\nMark Grover is a committer on Apache Bigtop, a committer and PMC member on Apache Sentry (incubating), and a contributor to Apache Hadoop, Apache Hive, Apache Sqoop, and Apache Flume. He is currently co-authoring O’Reilly’s “Hadoop Application Architectures” title and is a section author of O’Reilly’s book on Apache Hive – Programming Hive. He has written a few guest blog posts and presented at many conferences about technologies in the Hadoop ecosystem.", "info": "Software Engineer, Cloudera", "name": "Mark Grover", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_147273.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/157232": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/157232", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nCarlos is the CEO of GraphLab, and the Amazon Professor of Machine Learning in Computer Science and Engineering at the University of Washington. A world-recognized leader in the field of machine learning, Carlos was named one of the 2008 “Brilliant 10″ by Popular Science Magazine. He received the 2009 IJCAI Computers and Thought Award for his contributions to Artificial Intelligence, and a Presidential Early Career Award for Scientists and Engineers (PECASE).", "info": "CEO of GraphLab, and the Amazon Professor of Machine Learning, University of Washington, Dato", "name": "Carlos Guestrin", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_157232.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/4213": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/4213", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nMike leads the Emerging Products & Technology team at Autodesk where they identify, evaluate, and develop disruptive technologies that improve the practice of imagining, designing, and creating a better world. His team combines research, development, and user experience in coupled iterative cycles to develop new products and foundational technology. For the last several years Mike’s team has been focused on bringing geometric shape analysis and large scale machine learning techniques to 3D design information with the intent to make software a true partner in the design process.\nFormerly, Mike led the move of Autodesk products from the desktop to the cloud by driving the adoption of scalable distributed compute and data technology. Prior to joining Autodesk, Mike performed research and product development in the fields of volumetric graphics, distributed multimedia, computer vision, and embedded systems. He is drawn to areas where he can combine his 25 years of experience in computer graphics, distributed systems, and mathematical analysis. Mike holds an MS in computer science from the University of Cape Town, South Africa.", "info": "Senior Director, Emerging Products & Technology, Autodesk, Inc.", "name": "Mike Haley", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_4213.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/122916": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/122916", "bio": "Website | @jbgeorge\n\nJoseph George is the executive director of Server Big Data Strategy and Density Optimized Servers at HP, and is responsible for driving a broad range big data solutions across the HP Server portfolio.  He also leads efforts in driving hyperscale server infrastructure as part of HP’s density optimized server business. \nPrior to coming to HP, Joseph held key strategy, product management, evangelism, and technical leadership roles at companies like Dell, BMC Software, and Halliburton, and has served on the OpenStack Foundation board of directors.  Resultantly, Joseph has spent almost 20 years in driving emerging technology solutions in the areas of virtualization, cloud, big data, commercial and open source software, and scale out computing.\nJoseph holds a bachelor’s degree in electrical and computer engineering, as well as a master’s in business administration (MBA), both from the University of Houston. He’s a tried and true Texan, and currently resides in Houston with his wife and two children.\nYou can catch Joseph’s thoughts and opinions regularly at the JBGeorge Tech Blog (www.jbgeorge.net) and he can often be found talking tech on Twitter (@jbgeorge).", "info": "Exec Director, Big Data Solutions and Hyperscale Servers, Hewlett-Packard (HP)", "name": "Joseph  George", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_122916.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/148939": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/148939", "bio": "| Attendee Directory Profile\n\nGarrett is the editor-in-chief of shiny.rstudio.com, the development center for the Shiny R package, and is the author of Hands-On Programming with R as well as Data Science with R, a forthcoming book by O’Reilly Media. Garrett works as a data scientist and chief instructor for RStudio, Inc.", "info": "Curriculum Developer, RStudio", "name": "Garrett Grolemund", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_148939.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/171147": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/171147", "bio": "Website | @michaelminella\r\n\r\n\r\n | Attendee Directory Profile\n\nMichael Minella is a software engineer, teacher, and author with over a decade of enterprise development experience. Michael was a member of the expert group for JSR-352 (java batch processing). He currently works for Pivotal as the project lead for the Spring Batch project, and is an instructor at DePaul University. Michael is the author of Pro Spring Batch from Apress and the popular Refcard JUnit and EasyMock.\nOutside of the daily grind, Michael enjoys spending time with his family and woodworking, photography, and InfoSec hobbies.", "info": "Project Lead - Spring Batch, Pivotal", "name": "Michael Minella", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_171147.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/145657": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/145657", "bio": "Website | @kaivoigt\r\n\r\n\r\n | Attendee Directory Profile\n\nKai is a senior instructor for Hadoop classes at Cloudera, delivering training classes for developers and administrators worldwide. Before joining Cloudera, Kai had the same role at MySQL/Sun/Oracle, and spoke at various O’Reilly conferences.", "info": "Senior Instructor, Cloudera", "name": "Kai Voigt", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_145657.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193273": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193273", "bio": "@bmlever\r\n\r\n\r\n | Attendee Directory Profile\n\nBen is a co-founder and the CTO of Ambiata, a startup focused on creating products that allow organisations to take a more scientific and automated approach to business. At Ambiata he has lead the deployment of large scale machine learning systems into enterprises in industries such as finance, telecommunications, retail, and insurance. Before Ambiata, Ben previously led an engineering and research team at NICTA, as well as started the open source Scoobi project.", "info": "CTO, Ambiata", "name": "Ben Lever"}, "/big-data-conference-uk-2015/public/schedule/speaker/103766": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/103766", "bio": "@cutting\r\n\r\n\r\n | Attendee Directory Profile\n\nDoug (@cutting) is the founder of numerous successful open source projects, including Lucene, Nutch, Avro, and Hadoop. Doug joined Cloudera in 2009 from Yahoo!, where he was a key member of the team that built and deployed a production Hadoop storage and analysis cluster for mission-critical business analytics. Doug holds a Bachelor’s degree from Stanford University and sits on the Board of the Apache Software Foundation.", "info": "Chief Architect, Cloudera", "name": "Doug Cutting", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_103766.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/144388": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/144388", "bio": "Website | @kingmesal\r\n\r\n\r\n | Attendee Directory Profile\n\nJim has held positions running operations, engineering, architecture, and QA teams. Jim is the cofounder of the Chicago Hadoop Users Group (CHUG), where he has coordinated the Chicago Hadoop community for the past four years. Jim has worked in the consumer packaged goods, digital advertising, digital mapping, chemical, and pharmaceutical industries. Jim has built systems that handle more than 50 billion transactions per day. Jim’s work with high-throughput computing at Dow Chemical was a precursor to more standardized big data concepts like Hadoop.", "info": "Director, Enterprise Strategy & Architecture, MapR Technologies, Inc.", "name": "Jim Scott", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_144388.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/191200": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/191200", "bio": "@MarkySamson\r\n\r\n\r\n | Attendee Directory Profile\n\nMark Samson is a systems engineer at Cloudera.", "info": "Systems Engineer, Cloudera", "name": "Mark Samson"}, "/big-data-conference-uk-2015/public/schedule/speaker/193576": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193576", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nGerhard Kreß is part of Siemens Mobility Customer Service, responsible for data driven services. His aim is to strengthen the use of data analytics to enable new customer offerings.\nBefore that he was in Siemens Corporate Technology, responsible for implementing the corporate big data initiative “Smart Data to Business.” He worked for three years in Siemens Corporate Strategy to refine IT strategy for Siemens businesses. He was also responsible for setting up the Siemens big data initiative there.\nPrior to his work in corporate strategy, Kreß spent eight years working in Siemens IT Solutions and Services (SIS), managing systems and technologies for global service desks and in the project management of major IT outsourcing projects.\nGerhard Kreß started his professional career at McKinsey & Company, where he focused on growth initiatives and high tech industries.\nHe holds a German diploma in theoretical physics and a Master of Arts in International Relations and European Studies.", "info": "Director Mobility Data Services, Siemens AG", "name": "Gerhard Kress"}, "/big-data-conference-uk-2015/public/schedule/speaker/145780": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/145780", "bio": "Website\n\nJeongMin is a data analyst at SK Planet, a data-driven commerce and digital content platform company. JeongMin has an M.S. in industrial engineering and has worked as a data scientist and database engineer. Her current interests focus on anything to do with data analysis and measurement – finding insights from data and playing with data.", "info": "Data Analyst, SK Planet", "name": "JeongMin Kwon", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_145780.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/164036": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/164036", "bio": "Website | @felipehoffa\r\n\r\n\r\n | Attendee Directory Profile\n\nFelipe Hoffa joined Google in 2011 as a software engineer. As a member of the Google Cloud Platform team, he works with external developers to build applications on Google’s big data platforms.", "info": "Developer Advocate, Google", "name": "Felipe Hoffa", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_164036.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/158042": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/158042", "bio": "Website | @yoditstanton\r\n\r\n\r\n | Attendee Directory Profile\n\nYodit Stanton is CEO and founder of OpenSensors.io, an Internet of Things startup, that makes data from devices easily accessible and reusable.\nYodit is a software developer with a special interest in machine learning, and spends most of her time thinking about how to create IoT systems that put people first.", "info": "Founder, opensensors.io", "name": "yodit stanton", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_158042.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/169835": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/169835", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nTed has worked on close to 60 clusters for over 2- to 3-dozen clients with over hundreds of use cases. He has 18 years of professional experience working for startups, the US government, a number of the world’s largest banks, commercial firms, bio firms, retail firms, hardware appliance firms, and the largest non-profit financial regulator in the US. He has architecture experience across topics such as Hadoop, Web 2.0, Mobile, SOA (ESB, BPM), and big data. Ted is a regular committer to Flume, Avro, Pig, and YARN.", "info": "Sr Solution Architect, Cloudera", "name": "Ted Malaska", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_169835.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/180950": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/180950", "bio": "Website | @mikiobraun\r\n\r\n\r\n | Attendee Directory Profile\n\nMikio Braun is co-founder of streamdrill, a startup focused on approximative approaches for real-time big data, and post-doc researcher at TU Berlin, Germany. He holds a Ph.D. in Machine Learning and has worked in research for a number of years, before becoming interested in putting research results into good use in the industry. His current interests focus on anything to do with real-time data analysis, in particular using approximative approaches beyond scaling.", "info": "PostDoc, TU Berlin", "name": "Mikio Braun", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_180950.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/146171": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/146171", "bio": "Dr. Frank Säuberlich is director advanced analytics in the Teradata International Data Science team. His focus is on demand creation across the EMEA and APJ regions. He previously worked at Urban Science International where he was responsible for customer analytics. In this role he has worked with client teams to implement analytical solutions, and he pioneered new types of analysis to improve the efficiency of automotive clients’ marketing efforts. Prior to that, as European customer solutions practice manager he was responsible for the Urban Science Customer Solutions practice in Europe.\nWhile working on his doctoral thesis, he was a scientific assistant at the Institute of Decision Theory and Management Science, University of Karlsruhe, Germany.", "info": "Teradata", "name": "Frank Saeuberlich", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_146171.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/205692": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/205692", "bio": "", "info": ", Paradigma", "name": "Rubén Martínez"}, "/big-data-conference-uk-2015/public/schedule/speaker/150353": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/150353", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nStephen Purpura is the founder and CEO of Context Relevant. He has spent 20 years as a data scientist, inventor, academic, and software developer, working on Wall Street, in politics, and at Microsoft. Stephen holds degrees from the University of Washington and Harvard, and is on a leave of absence from Cornell’s PhD program in Machine Learning.", "info": "CEO, Context Relevant", "name": "Stephen Purpura", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_150353.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/168490": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/168490", "bio": "| Attendee Directory Profile\n\nPhill Radley is a physics graduate with an MBA who has worked in IT and the communications industry for 30 years, mostly with British Telecommunications plc. He is Chief Data Architect for BT at their Adastral Park campus in the UK.\nPhill works in BT’s core Enterprise Architecture team with responsibility for data architecture across BT Group plc. He currently leads BT’s MDM and big data initiatives driving associated strategic architecture and investment roadmaps for the business.\nHis previous roles in BT include nine years as Chief Architect for infrastructure performance management solutions, from UK consumer broadband to outsourced Fortune 500 networks and high-performance trading networks. He has broad global experience including BT’s Concert global venture in the US and five years as Asia Pacific BSS/OSS architect based in Sydney.", "info": "Chief Data Architect, BT", "name": "Phillip Radley", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_168490.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193589": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193589", "bio": "Website | @neunhoef\r\n\r\n\r\n | Attendee Directory Profile\n\nMax Neunhöffer is a mathematician turned database developer. In his academic career he has worked for 16 years on the development and implementation of new algorithms in computer algebra, mainly for the open source system GAP. During this time he has juggled a lot with mathematical big data like group orbits containing trillions of points. Recently he has returned from St Andrews in Scotland to Germany, has shifted his focus to NoSQL databases, and now helps to develop ArangoDB.", "info": "Senior software developer and architect, ArangoDB GmbH", "name": "Max Neunhöffer", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193589.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/107765": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/107765", "bio": "@teradata\r\n\r\n\r\n | Attendee Directory Profile\n\nDuncan has been a data miner since the mid 1990s.  He now leads Teradata’s Data Science team in Europe and Asia.\nAt Teradata he has been responsible for developing analytical solutions across a number of industries, including warranty and root cause analysis in manufacturing, and social network analysis in telecommunications.\nIn his spare time Duncan has been a city councillor, chair of a national charity, founder of an award-winning farmers’ market, and one of the founding directors of the Institute of Data Miners. He is one of the co-founders of DataKind UK, and regularly speaks on data science and social good.", "info": "Data and Analytics Director, TES Global", "name": "Duncan Ross", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_107765.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/181479": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/181479", "bio": "Julia Angwin is an award-winning investigative journalist at the independent news organization ProPublica.\nFrom 2000 to 2013 she was a reporter at The Wall Street Journal, where she led a privacy investigative team that was a Finalist for a Pulitzer Prize in Explanatory Reporting in 2011 and which won a Gerald Loeb Award in 2010. Her book “Dragnet Nation: A Quest for Privacy, Security and Freedom in a World of Relentless Surveillance” was published by Times Books in 2014.\nIn 2003, she was on a team of reporters at The Wall Street Journal that was awarded the Pulitzer Prize in Explanatory Reporting for coverage of corporate corruption. She is also the author of “Stealing MySpace: The Battle to Control the Most Popular Website in America” (Random House, March 2009).\nAngwin earned a B.A. in mathematics from the University of Chicago, and an MBA from the Graduate School of Business at Columbia University.", "info": "Senior Reporter, ProPublica", "name": "Julia Angwin", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_181479.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/168002": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/168002", "bio": "Website | @kevinschmidtbiz\r\n\r\n\r\n | Attendee Directory Profile\n\nKevin built up the data science and engineering team at Mind Candy, and with the team created a scalable architecture for mobile game analytics. Before Mind Candy, Kevin headed the data science and back-end services team at Last.fm, working with ten years of music listening data from millions of users. He also spent four years working on private clouds and service architecture at Goldman Sachs.", "info": "Head of Data Science, Mind Candy Ltd", "name": "Kevin Schmidt", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_168002.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/178255": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/178255", "bio": "Website | @costinl\n\nCostin Leau is an engineer at Elasticsearch, currently working with NoSQL and big data technologies. An open-source veteran, Costin led various Spring projects (Spring OSGi, GemFire, Redis, Hadoop) and authored an OSGi spec. Speaker at various editions of EclipseCon/OSGi DevCon, JavaOne, Devoxx/Javapolis, JavaZone, SpringOne, TSSJS on Java/Hadoop/Spring related topics.", "info": "Engineer, Elasticsearch", "name": "Costin Leau"}, "/big-data-conference-uk-2015/public/schedule/speaker/150987": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/150987", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nJeremy Heffner works with crime data to model patterns and forecast risk; the intersection of geography, data science, and social good.\nThe elements he works with every day can include geographic data, raster processing, predictive analysis, spacetime event modeling, weather, demographics, machine learning, early warning systems, R, Scala, and Python.", "info": "Senior Data Scientist, Azavea", "name": "Jeremy Heffner", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_150987.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/205568": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/205568", "bio": "", "info": "", "name": "Marc Warner"}, "/big-data-conference-uk-2015/public/schedule/speaker/27740": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/27740", "bio": "Website | @jsteeleeditor\r\n\r\n\r\n | Attendee Directory Profile\n\nJulie thinks in metaphors and finds beauty in the clear communication of ideas. She is particularly drawn to visual media as a way to understand and transmit information, and is co-author of Beautiful Visualization (O’Reilly 2010) and Designing Data Visualizations (O’Reilly 2012).", "info": "Director, Communications, Silicon Valley Data Science", "name": "Julie Steele", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_27740.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/164744": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/164744", "bio": "Website | @jeroenhjanssens\r\n\r\n\r\n | Attendee Directory Profile\n\nJeroen is a lead data scientist at Elsevier in Amsterdam. He has an M.Sc. in artificial intelligence and a Ph.D. in machine learning. Jeroen has authored a book titled “Data Science at the Command Line”, published by O’Reilly. Jeroen is passionate about building open source tools for data science.", "info": "Lead Data Scientist, Elsevier", "name": "Jeroen Janssens", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_164744.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/157428": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/157428", "bio": "| Attendee Directory Profile\n\nAndrew is a software engineer on the HDFS team at Cloudera. Previously, he was a graduate student in the AMPLab at the University of California, Berkeley advised by Prof. Ion Stoica, where he worked on research related to in-memory caching and quality-of-service. In his spare time he enjoys going on bike rides, cooking, and playing guitar.", "info": "Software Engineer, Cloudera", "name": "Andrew Wang", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_157428.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/202946": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/202946", "bio": "Rui Li acquired a master’s degree in computing science from Fudan University in 2013. He is now a software engineer at Intel and a committer for Apache Hive. He is also a contributor to Apache Spark.", "info": "Software Engineer, Intel", "name": "Rui Li", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_202946.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/171362": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/171362", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nClaudiu Branzan is a senior engineering lead at Atigeo, leading a team of data scientists and software engineers who tackle complex challenges in machine learning, data mining, information retrieval, and statistics. Claudiu has over 10 years of real-world data science experience across industries including finance, healthcare, legal, mobile, and retail. He has co-authored multiple patents, and holds a master’s degree in industrial intelligent systems from the Polytechnic University of Timișoara.", "info": "Senior Software Team Lead, Atigeo", "name": "Claudiu Branzan", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_171362.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/173073": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/173073", "bio": "Website | @dashingd3js\r\n\r\n\r\n | Attendee Directory Profile\n\nSebastian Gutierrez is a data entrepreneur who has founded three data-related companies: DataYou (data science & data visualization consulting and education), LetsWombat (data-driven product sampling), and Acheevmo (athletic performance statistics). He was formerly an emerging markets risk manager at Scotia Capital and an FX options trader at JP Morgan and Standard Chartered Bank. He is the author of \"Data Scientist at Work,” a collection of 16 interviews with many of the world’s most influential and interesting data scientists from across the spectrum of public companies, private companies, startups, venture investors, and non-profits.\nGutierrez provides extensive training in data visualization and D3.js (a data visualization JavaScript library) to a diverse client base—from corporations such as The New York Stock Exchange, The American Express Company, and General Dynamics to universities and media agencies, as well as many startups. He leads the 2000-plus-member NYC D3.js Meetup Group and is co-editor of Data Science Weekly, a weekly newsletter providing curated articles and videos on the latest developments in data science. He has spoken at multiple conferences (Strata + Hadoop World in NYC and Barcelona) and meetups, and is a cross-disciplinary instructor at General Assembly. He holds a BS in mathematics from MIT and an MA in economics from the University of San Francisco.", "info": "Principal, DashingD3js.com", "name": "Sebastian Gutierrez", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_173073.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193597": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193597", "bio": "Website | @sanand0\r\n\r\n\r\n | Attendee Directory Profile\n\nAnand is the chief data scientist at Gramener.com. He tells visual stories from data, ranging from politics to fraud, education to entertainment, social media to governance. His work is available at Gramener.com\nAnand has an MBA from IIM Bangalore and a B.Tech from IIT Madras. He has worked at IBM, Lehman Brothers, The Boston Consulting Group, and Infosys Consulting. He blogs at s-anand.net.", "info": "Chief data scientist, Gramener", "name": "Anand  Subramanian ", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193597.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193590": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193590", "bio": "Website | @oana_co\r\n\r\n\r\n | Attendee Directory Profile\n\nOana Calugar is the head of Customer Support for AliveShoes, focused on extracting and using customer support insights to create better products. AliveShoes is the world’s first independent shoemaking community that helps people design and sell their own shoes. In this role Oana leads the company’s customer support and designer community efforts, overseeing a team of three junior customer support and community support managers. Oana built AliveShoes’ first world-class customer support team from the ground up. AliveShoes empowers 1200+ shoemakers worldwide from 120+ different countries. Oana always finds it rewarding to connect to and open the doors of Italian shoe design to people from all continents.\nBefore joining AliveShoes, Oana worked with and built customer support teams for startups from the US and Romania – Weebly and Trip Journal – and was lucky enough to support clients from all over the world, from such fascinating fields as mobile applications and online web-hosting services.\nOana has worn many hats in her life – marketer, sales manager, communicator, mentor, advisor, entrepreneur, and mother. As a result, she has the ability to manage multi-disciplinary projects and is passionate about solving complex challenges.\nIn the past year Oana rediscovered her passion for data-driven decisions and curiosity for analytics and data storytelling. Her science mind is often creating experiments to test and validate this data. Oana’s mission is to help people understand how beautiful data is and how people can harness data for social good.\nSpecialties:\nCustomer Support and Community Management\nData Storytelling and Data Analytics\nExperiment Design \nPresenting and Selling Ideas and Pitching\nLean Startup and Customer Development\nMeditation and Mindfulness", "info": "Head of Customer Support, AliveShoes", "name": "Oana Calugar", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193590.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/177983": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/177983", "bio": "Website | @majsander\r\n\r\n\r\n | Attendee Directory Profile\n\nBusiness analyst, business developer with a strong analytical mind. Majken has been working with IT, management information, analytics, BI, and DW for 20+ years. Keen on everything data, math, and ‘data driven’ as a management business principle. Data science. BI. All things data.", "info": "Business Analyst / Data Nerd, BusinessAnalyst.dk", "name": "Majken Sander", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_177983.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/109262": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/109262", "bio": "Website | @ted_dunning\r\n\r\n\r\n | Attendee Directory Profile\n\nTed Dunning is Chief Application Architect at MapR Technologies and committer and PMC member for the Apache Mahout project. He contributing to the Mahout clustering, classification and matrix decomposition algorithms. He was the chief architect behind the MusicMatch, (now Yahoo Music) and Veoh recommendation systems and built fraud detection systems for ID Analytics.", "info": "Chief Application Architect, MapR Technologies", "name": "Ted Dunning", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_109262.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/180777": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/180777", "bio": "@lvicentesanchez\r\n\r\n\r\n | Attendee Directory Profile\n\nLuis is senior data engineer at Mind Candy, was the first to introduce Spark Streaming at the company, and is responsible for the real-time mobile analytics platform. He has more than 10 years of experience in software engineering and architecture.", "info": "Mind Candy Ltd.", "name": "Luis Angel Vicente Sanchez", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_180777.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/202665": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/202665", "bio": "As co-founder of Think Big, Rick brings 20 years experience in scaling global services organizations. He’s responsible for Think Big’s international business. Previously Rick directed a global division within Sun Microsystems. In 2009 he led Sun’s open source software go-to-market strategy with Amazon Web Services. On Sun’s leadership team, Rick helped integrate the acquisitions of SeeBeyond and mySQL. In the 90’s Rick was the first senior hire into C-Bridge, where helped develop their RAPID consulting methodology. His leadership helped scale C-bridge to over 900 consultants in three years and to a successful IPO in 1999.", "info": "Think Big, A Teradata Company", "name": "Rick Farnell", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_202665.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/200638": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/200638", "bio": "Jason heads up big data, analytics, and marketing solutions at Marks & Spencer. He was brought on board to bring step change to the business in how it uses data and innovative technology to drive business decisions and performance. He also has responsibility for leading on the definition and execution of marketing technology strategy. This brings together data, customer analytics, and loyalty along with CRM to help build strong bonds and engagements with customers.", "info": "Head of Big Data and Marketing Technology, Marks and Spencer", "name": "Jason Foster"}, "/big-data-conference-uk-2015/public/schedule/speaker/187615": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/187615", "bio": "Website | @slangevi\r\n\r\n\r\n | Attendee Directory Profile\n\nScott Langevin is a director and research scientist at Oculus and has over 12 years of industry and academic experience. He holds a PhD in computer science with a background in machine learning.  Scott’s research interests are in large scale visual analytics and adaptive user interfaces.", "info": "Director, Research Scientist, Uncharted Software Inc.", "name": "Scott Langevin", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_187615.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/187196": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/187196", "bio": "| Attendee Directory Profile\n\nYousun Jeong is an IT manager at SK Telecom (SKT), South Korea’s largest wireless communications provider. Big data analysis at SKT mainly focuses on customer retention and customer experience improvements, and essentially needs sophisticated real-time data processing.", "info": "Senior Engineer, SK Telecom", "name": "Yousun Jeong", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_187196.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/10028": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/10028", "bio": "Website\n\nRod Smith is an IBM fellow and vice president of the IBM Emerging Internet Technologies organization, where he leads a group of highly technical innovators who are developing solutions to help organizations realize the value of cloud computing. His early advocacy in the industry has played an important role in the adoption of technologies such as J2EE, Linux, Web services, XML, rich Internet applications, and various wireless standards.\nAs an IBM Fellow, Rod is helping lead IBM’s efforts around quick application development using cloud-based services, helping companies realize the benefits of quick-time-to-value appication creation. His early identification of emerging technologies has led to a sustained record of achievement in the global software community. Rod has authored numerous invention patents and disclosures, and is the recipient of several prestigious awards including the TJ Watson Design Excellence Award. He is also a long-time member of the IBM Academy of Technology.\nRod is a computer science graduate of Western Michigan University, and holds an M.A. and B.A. in economics with a concentration in math from Western Michigan University.", "info": "IBM fellow, Vice President, IBM Emerging Internet Technologies", "name": "Rod Smith", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_10028.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193514": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193514", "bio": "Website | @chbatey\r\n\r\n\r\n | Attendee Directory Profile\n\nChristopher Batey recently joined DataStax as a technical evangelist for Apache Cassandra. Previously he worked as a senior software engineer at BSkyB, where he spent his time designing and developing their next generation, Cassandra-backed platform that powers Sky Go and Now TV. He is a keen blogger, tweeter, and open source advocate.", "info": "Engineer & Technical Evangelist, DataStax", "name": "Christopher Batey"}, "/big-data-conference-uk-2015/public/schedule/speaker/188660": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/188660", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nDileep Kumar works in the Performance Engineering team at Cloudera. He holds an M.S. from Santa Clara University and has more than 15 years of experience in performance engineering for SQL systems. He is a regular author and presenter.", "info": "Cloudera Inc", "name": "Dileep Kumar", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_188660.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193517": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193517", "bio": "@emre\n\nEmre is Qubit’s co-founder and CTO. Qubit is a provider of an integrated web personalization, a/b testing, audience segmentation, and digital analytics platform. Prior to starting Qubit, he was a senior product manager at Google working on AdWords and AdSense products – building large scale artificial intelligence and analytics systems to scale and automate operations. Prior to Google, Emre was the co-founder and CTO of Yonja.com, Turkey’s largest social network.\nWhen not thinking big data and personalization, Emre finds himself either kitesurfing or Olympic trap shooting.", "info": "Co-Founder & CTO, Qubit", "name": "Emre Baran", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193517.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/1": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/1", "bio": "Website | @edd\r\n\r\n\r\n | Attendee Directory Profile\n\nEdd Dumbill is a technology analyst, writer, and entrepreneur based in California. He’s helping drive businesses with data as VP strategy for Silicon Valley Data Science.\nEdd was the founding program chair for O’Reilly Strata, and chaired the Open Source Convention for six years. He was the Founding Editor of the journal Big Data.\nA startup veteran, Edd was the founder and creator of the Expectnation conference management system, and a co-founder of the Pharmalicensing.com online intellectual property exchange.\nAn advocate and contributor to open source software, Edd has contributed to various projects such as Debian and GNOME, and created the DOAP Vocabulary for describing software projects.\nEdd has written four books, including O’Reilly’s “Learning Rails”. He writes regularly on Google+ and on his blog at eddology.com.", "info": "VP Strategy, Silicon Valley Data Science", "name": "Edd Dumbill", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_1.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/138654": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/138654", "bio": "| Attendee Directory Profile\n\nYanpei Chen is a software engineer at Cloudera, working on the Performance Engineering team. He regularly participates in competitive performance “bake-offs” that directly drive customer purchasing decisions. His work touches upon Cloudera Search, Impala, Apache Hadoop, Apache HBase, and Apache Hive, because someone has to make sure the entire Hadoop ecosystem performs well together. Yanpei is a frequent speaker at industry and academia conferences, and contributes to various industry standard benchmarks for big data.", "info": "Software engineer, Cloudera", "name": "Yanpei Chen", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_138654.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/154116": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/154116", "bio": "Adi Krishnan is the senior product manager for Amazon Kinesis, a fully managed service for real-time processing of streaming data at massive scale. Adi loves spending time with customers and partners, to define products that delight customers. The rest of his time is spent building a scalable business that delivers value.  But most of all he enjoys talking technology, and what it can do for people in the long term. Prior to Amazon Web Services, Adi held several product management roles at Microsoft where he worked on the Bing search engine, Windows Azure, and the High Performance Computing division.", "info": "Sr. Product Manager, Amazon", "name": "Adi Krishnan", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_154116.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/157554": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/157554", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nSean is director of data science for EMEA at Cloudera. Previously, Sean founded Myrrix Ltd, producing a real-time recommender and clustering product evolved from Mahout. Myrrix is now part of Cloudera. Sean was a primary author of recommender components in Apache Mahout, and has been a committer and PMC member for the project. He is co-author of Advanced Analytics on Spark and Mahout in Action. Sean was previously a senior engineer at Google.", "info": "Director of Data Science, Cloudera", "name": "Sean Owen", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_157554.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/155181": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/155181", "bio": "| Attendee Directory Profile\n\nDavid Jonker is EVP and a founder of Oculus. He is a visual analytics designer and technical architect with 20 years experience. David is interested in the visual elegance of information and the underlying visual and technical design needed to create powerful solutions.", "info": "Senior Partner, Uncharted Software Inc.", "name": "David Jonker", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_155181.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193739": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193739", "bio": "@anjalisamani\n\nAnjali is the co-founder of the consulting arm of ASI, a London-based data science training and consulting company. ASI works with partners across many industries delivering projects in an agile and collaborative way. Anjali is passionate about using data and technology to enable businesses to become more data driven. Prior to joining ASI, Anjali spent eight years working in the financial services industry as a quantitative analyst. She has a background in computer science, economics, and mathematics.", "info": "ASI", "name": "Anjali Samani", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193739.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/143615": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/143615", "bio": "| Attendee Directory Profile\n\nMarcel Kornacker is the architect and tech lead at Cloudera for Impala. Prior to Cloudera, Marcel worked at Google on several ad-serving and storage infrastructure projects. He eventually became the tech lead for the distributed query engine component of Google’s F1 project. He holds a PhD in databases from UC Berkeley.", "info": "Software Engineer, Cloudera, Inc.", "name": "Marcel Kornacker", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_143615.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193046": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193046", "bio": "M. Teresa Serrano Agujetas studied economics at the Madrid Complutense University developing her career in the financial sector and in the area of ​​IT.\nMaite ‘s early professional career was at NatWest Spain, Banesto and Banco Santander in different IT departments -Development of Business Applications, Middleware and Production, being accountable for the Database Management and Software Quality Assurance. Later on, she was given responsibility over Technical, Functional, and Software Architecture, which became her life passion. For the last 7 years she has been responsible for the Santander Group Corporate Technology including IT Architecture, Information Systems Strategy and IT Process Definition, being involved and leading the IT&Ops integration projects of banks that the group has acquired.\nDuring last 5 years she has played the CTO role in the Group as a previous step to her current mission as the IT&Ops Innovation Director.", "info": "CTO, Santander Group", "name": "Maite Agujetas", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193046.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/108081": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/108081", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nSameer is a Client Services Engineer at Databricks, where he works with customers on Apache Spark deployments. He has extensive industry expertise in the Hadoop ecosystem, Cassandra, Couchbase and general NoSQL domain. Prior to Databricks, Sameer worked 2 years as a freelance big data consultant + trainer globally and taught 100+ big data courses. Before that, Sameer was a Systems Architect at Hortonworks, an Emerging Data Platforms Consultant at Accenture R&D and a Enterprise Consultant for Symantec/VERITAS (specializing in VCS, VVR, SF-HA).", "info": "Client Services Engineer, Databricks", "name": "Sameer Farooqui", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_108081.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/187069": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/187069", "bio": "", "info": "Director of Marketing and Strategy, Intel", "name": "Brandon Draeger"}, "/big-data-conference-uk-2015/public/schedule/speaker/197422": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/197422", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nColin Gillespie is a statistician and an associate professor at Newcastle University, UK, where he works on computational statistics, big data problems, and scalable Bayesian inference. He has taught courses on R for over ten years, attracting participants from around the world.", "info": "Dr, Newcastle University", "name": "Colin Gillespie", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_197422.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/122636": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/122636", "bio": "Website | @ogrisel\r\n\r\n\r\n | Attendee Directory Profile\n\nOlivier Grisel is a software engineer in the Parietal team at Inria. He works to improve the speed and scalability of the scikit-learn machine learning library for the Python / NumPy / SciPy ecosystems. He also likes to share interesting machine learning papers and tricks on Twitter.", "info": "R&D Software Engineer, Inria & scikit-learn", "name": "Olivier Grisel", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_122636.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193638": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193638", "bio": "Website | @datamusing\r\n\r\n\r\n | Attendee Directory Profile\n\nSudeep Das is a data scientist with a passion for turning data into meaningful insights and stories. He believes that powerful visualizations provide key entry points into understanding data. Very often, Sudeep finds himself hand-rolling innovative visualizations driven by unique characteristics of the data. Currently he is using an arsenal of data science tools to derive insights from OpenTable’s extensive data trove. Sudeep’s current projects include natural language processing and topic analysis on an extensive review corpus, to reveal salient features of restaurants and reviewers. He is also driving the understanding of restaurant capacity utilization and diner spending trends; and is building a recommendation stack using matrix factorization, content-based and hybrid factorization machine-based approaches. Sudeep loves using Python-based tools like Pandas, Scikit-learn, Gensim, PySpark, Matplotlib, and mpld3.\nFor most of his professional life Sudeep has been an astrophysicist. He has strong experience in solving complex problems using innovative methods, and extensive leadership abilities with a knack for bringing smart people together to solve problems. He has excellent communications skills and is frequently invited to deliver talks, lectures, and colloquia in domestic and international conferences. One of his most exciting achievements has been leading a team that isolated a subtle cosmological effect for the first time from noisy data. Sudeep has authored more than 50 peer reviewed articles in leading journals.", "info": "Data Scientist, OpenTable", "name": "Sudeep Das", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193638.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/178179": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/178179", "bio": "Website | @stratosphere_eu\r\n\r\n\r\n | Attendee Directory Profile\n\nStephan Ewen is one of the originators and committers of the Apache Flink project, and is a CTO at a Berlin-based startup where he leads the effort to create a novel distributed system for reliable large-scale data processing.\nStephan holds a Ph.D. from the Berlin University of Technology, and is a co-author of the Stratosphere system. He has worked on data processing technologies at IBM and Microsoft in the past.", "info": "Data Artisans", "name": "Stephan Ewen"}, "/big-data-conference-uk-2015/public/schedule/speaker/184253": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/184253", "bio": "Website | @ronert_obst\n\nRonert got his MSc in statistics at Ludwig-Maximilians-Universität in Munich and now works as a data scientist at Pivotal in Berlin. His focus is on applying algorithms from machine learning and statistics to large data sets.", "info": "Data Scientist, Pivotal", "name": "Ronert Obst", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_184253.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/190800": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/190800", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nAngie is co-founder and COO of ASI, a London-based startup that offers bespoke data science and engineering training and internships for partner companies. The training combines the best of academic and startup cultures. She is passionate about enabling companies accessing data science skillsets that generate real business value. Prior to joining ASI, she was a researcher in nanotechnology at UCL.", "info": "COO, ASI", "name": "Angie Ma", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_190800.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/134499": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/134499", "bio": "| Attendee Directory Profile\n\nJohn Miller is the managing director of the Data Insights R&D group at Accenture’s Technology Lab. He is responsible for overseeing the group’s most innovative research and innovation, and building relationships with clients and research partners around the globe.", "info": "Partner, Accenture", "name": "John Miller", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_134499.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/185467": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/185467", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nSoftware Engineer with 30+ years of experience developing DBMS software. S.M., S.B. Computer Science, MIT.", "info": "Software Engineer, Cloudera", "name": "Charles Lamb", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_185467.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/138919": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/138919", "bio": "@fwiffo\r\n\r\n\r\n | Attendee Directory Profile\n\nJoey Echeverria is a software engineer at Cloudera, currently working on Kite SDK. Joey joined Cloudera from the NSA where he worked on data mining, network security, and clustered data processing using Hadoop. Prior to working full time for the NSA, Joey attended Carnegie Mellon University where he attained an M.S. and a B.S. in Electrical and Computer Engineering.", "info": "Software Engineer, ScalingData", "name": "Joey Echeverria", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_138919.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/177568": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/177568", "bio": "Website | @martinkl\r\n\r\n\r\n | Attendee Directory Profile\n\nMartin is a software engineer and entrepreneur, specialising in the data infrastructure of Internet companies. His last startup, Rapportive, was acquired by LinkedIn in 2012. He is a committer for Apache Samza and Apache Avro, and author of the O’Reilly book Designing Data-Intensive Applications. His technical blog is at martin.kleppmann.com.", "info": "Software engineer, entrepreneur and author, Independent", "name": "Martin Kleppmann", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_177568.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/146754": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/146754", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nTrained as a scientist, Andrew has worked with data all his career in both business and academia, for organisations including Microsoft Research, Barclays Capital, Cambridge University, and Royal Bank of Scotland.  Import•io is his second successful start-up with co-founders Matthew Painter and David White.", "info": "Founder and CDO, import • io", "name": "Andrew Fogg", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_146754.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/163846": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/163846", "bio": "| Attendee Directory Profile\n\nAlan is a co-founder at Hortonworks and an original member of the engineering team that took Pig from a Yahoo! Labs research project to a successful Apache open source project. Alan also designed HCatalog and guided its adoption as an Apache Incubator project. Alan has a BS in mathematics from Oregon State University and an MA in theology from Fuller Theological Seminary. He is also the author of Programming Pig, a book from O’Reilly Press.", "info": "Founder/Architect, Hortonworks", "name": "Alan Gates", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_163846.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/169590": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/169590", "bio": "Website | @RainyData\r\n\r\n\r\n | Attendee Directory Profile\n\nAlice is the director of data science at GraphLab, a Seattle-based startup that offers powerful large-scale machine learning and graph analytics tools. She loves playing with data and enabling others to play with data.  She is a tool builder and an expert in machine learning algorithms. Her research spans software diagnosis, computer network security, and social network analysis. Prior to joining GraphLab, she was a researcher at Microsoft Research, Redmond. She holds Ph.D. and B.A. degrees in computer science, and a B.A. in mathematics, all from U.C. Berkeley.", "info": "Director of Data Science , Dato", "name": "Alice Zheng", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_169590.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193595": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193595", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nJo is global co-head of the Enterprise Platforms group at Goldman Sachs. Enterprise Platforms is an engineering team responsible for a broad remit—data architecture, JVM engineering, workflow, runtime management, and development practices—and the deployment of these practices to the complete set of Goldman’s activities. She started at Goldman Sachs 18 years ago as a junior programmer, and has been afforded the opportunity to work across many technical roles, geographical locations, and business areas. A strong advocate for diversity, Jo is co-sponsor of the Goldman Sachs Global Women in Technology Network.", "info": "Partner, Goldman Sachs", "name": "Joanne Hannaford"}, "/big-data-conference-uk-2015/public/schedule/speaker/140636": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/140636", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nDavid Talby is Atigeo’s senior vice president of engineering, leading the R&D, product management, and operations teams. David has extensive experience in building and operating web-scale analytics and business platforms, as well as building world-class, agile, distributed teams. Previously he was with Microsoft’s Bing group where he led business operations for Bing Shopping in the US and Europe, and earlier he worked at Amazon both in Seattle and the UK, where he built and ran distributed teams which helped scale Amazon’s financial systems. David holds a PhD in Computer Science along with two masters degrees, in computer science and business administration.", "info": "SVP Engineering, Atigeo, LLC", "name": "David Talby", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_140636.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/153419": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/153419", "bio": "Website\n\nJagane Sundar has extensive big data, cloud, virtualization, and networking experience, and joined WANdisco through its acquisition of AltoStor, a Hadoop-as-a-Service platform company. Before AltoStor, Jagane was founder and CEO of AltoScale, a Hadoop and HBase-as-a-Platform company acquired by VertiCloud. His experience with Hadoop began as director of Hadoop Performance and Operability at Yahoo!. Jagane has such accomplishments to his credit as the creation of Livebackup, an open source project for KVM VM backup, the development of a user mode TCP Stack for Precision I/O, the development of the NFS and PPP clients and parts of the TCP stack for JavaOS for Sun Microsystems, and the creation and sale of a 32bit VxD based TCP stack for Windows 3.1 to NCD Corporation for inclusion in PC-Xware. Jagane is currently a member of the Technical Advisory Board of VertiCloud. Jagane received his B.E. in electronics and communications engineering from Anna University.", "info": "CTO and VP Engineering, Big Data, WANdisco", "name": "Jagane Sundar"}, "/big-data-conference-uk-2015/public/schedule/speaker/146120": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/146120", "bio": "Website | @tamaradull\r\n\r\n\r\n | Attendee Directory Profile\n\nTamara Dull is the director of emerging technologies for SAS Best Practices, a thought leadership organization at SAS Institute. Through engaging publications, rich media, and industry engagements, she delivers a pragmatic perspective on topics including big data, privacy, and the Internet of Things. Tamara has been in the high tech industry for 30 years, and has held positions in enterprise training, consulting, software development, marketing, and IT, product, and executive management. She was recently listed as #13 on the Big Data 2015: Top 100 Influencers and Brands list.", "info": "Director of Emerging Technologies, SAS Best Practices, SAS Institute Inc.", "name": "Tamara Dull", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_146120.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/206097": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/206097", "bio": "Website | @EMCUKI\n\nHead of EMC Consulting Big Data Practice for UKI & TEEAM.  Wearer of wearables.  A major fanboy of Big Data and the benefits that it can bring business and individuals.", "info": "Head of EMC Consulting Big Data Practice for UKI & TEEAM, EMC", "name": "Mark Sear", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_206097.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193626": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193626", "bio": "Website\r\n\r\n\r\n | Attendee Directory Profile\n\nChristine Foster is currently the VP of data science at ShopKeep. She started her career as a generalist strategy consultant with Bain & Company, doing sums and averages and PowerPoint. Christine worked on data mashups at EMI Music, which is where she remembered she knew a lot more about regression models than most MBAs. Most recently, she ran digital targeting analytics for the consumer card business at American Express and benefited from sitting near some very impressive modelers in the Risk & Information Management department.", "info": "VP of Data Science, ShopKeep", "name": "Christine Foster"}, "/big-data-conference-uk-2015/public/schedule/speaker/201891": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/201891", "bio": "| Attendee Directory Profile\n\nChristine Flounders is Regional Manager for London R&D at Bloomberg L.P, responsible for a team of more than 450 technologists working to architect, build and deploy software, digital platforms and mobile applications for Bloomberg customers in financial services. In her almost 14 years at the firm, she has managed teams of developers in London and New York working on a diverse spectrum of solutions, from charting and technical analysis software to real-time alerts and pricing tools. Christine graduated from New York University with a degree in Computer Science.", "info": "London R&D Lead, Bloomberg LP", "name": "Christine Flounders"}, "/big-data-conference-uk-2015/public/schedule/speaker/193625": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193625", "bio": "| Attendee Directory Profile\n\nEllie Dobson works for Pivotal as a data scientist. She spent most of her early life in Northumberland planning to be a musician but did a rather unexpected U-turn at the age of 18, and after a brief foray into teaching ended up reading physics at Oxford University. She was awarded her PhD in 2009 in particle physics, and spent a few subsequent years hunting particles in the ATLAS detector as part of the LHC project. Looking for a new challenge, she then took a job as a field engineer at MathWorks, the company behind MATLAB, specialising in statistics and parallel computing. In her spare time she likes to do anything that involves being outdoors in the sunshine.", "info": "Data Scientist, Pivotal", "name": "Ellie Dobson", "imgsrc": "http://cdn.oreillystatic.com/en/assets/1/eventprovider/1/_@user_193625.jpg"}, "/big-data-conference-uk-2015/public/schedule/speaker/193620": {"url": "http://strataconf.com//big-data-conference-uk-2015/public/schedule/speaker/193620", "bio": "Website | @dmoralesdf\r\n\r\n\r\n | Attendee Directory Profile\n\nWorking as a big data architect at Stratio, David Morales has been involved in the inception and evolution of some modules included in the Stratio platform, especially those related to data visualization, real-time, streaming, and complex event proccesing.", "info": "Big Data Architect, STRATIO", "name": "David Morales"}}