{"Red Hat": {"url": "http://www.redhat.com", "company_name": "Red Hat", "blurb": "Red HatRed Hat is the world's leading provider of open source solutions, taking a community-powered approach to provide reliable\r\nand high-performing cloud, virtualization, storage, Linux, and middleware technologies. Red Hat also offers award-winning\r\nsupport, training, and consulting services. And as the connective hub in a global network of enterprises, partners, and open\r\nsource communities, Red Hat enables the creation of relevant, innovative technologies that liberate resources for growth and\r\nprepare customers for the future of IT. Red Hat is an S&P company with more than 70 offices spanning the globe,\r\nempowering our customers' businesses.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/red_hat.gif"}, "Synergic Partners": {"url": "http://www.synergicpartners.com/en", "company_name": "Synergic Partners", "blurb": "Synergic PartnersSynergic Partners is a strategic and technology consultancy founded in 2007, specialized in the fields of Big Data, Data Science and Data Engineering with the aim to turn companies' information into strategic assets for the business. Synergic Partners, with offices in Madrid, Barcelona and Zurich applies experience and industry specific knowledge to develop high-value solutions. The firm aims to be the trusted partner for it's client companies in the implementation of strategic business initiatives where Big Data is the key factor to success.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/synergic-partners.gif"}, "IBM": {"url": "https://ibm.biz/bluemixWB", "company_name": "IBM", "blurb": "IBMIBM is enabling its clients to use technology to transform industries and professions through its commitment to innovation. From the early contributions to Linux, Java and Eclipse, to our recent support of Apache Hadoop, we are now embarking on the next-generation technologies to enable just-in-time analytics embedded into every business decision.   With a full range of capabilities including Distributed Computing, Machine Learning, Cognitive Computing, Natural Language Processing, Real-Time Streaming, Mobile Identity and ease of integration via our Development/Deployment Environment,  Bluemix;  the possibilities are endless.   Drop by our booth to learn more about these cutting-edge technologies and get started today.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ibm.gif"}, "Elastic": {"url": "https://www.elastic.co/", "company_name": "Elastic", "blurb": "ElasticElastic is a company that believes getting insight from data matters. Built around three open source products — Elasticsearch, Logstash, and Kibana — Elastic is extending what’s possible with data, delivering on the promise that good things come from connecting the dots. Designed to help users take data from any source and search, analyze, and visualize it in real time, Elastic products are changing the way organizations get value from data. To learn more, visit www.elastic.co.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/elastic.png"}, "AnalystOne": {"url": "http://analystone.com/", "company_name": "AnalystOne", "blurb": "AnalystOneAnalystOne.com is focused on providing actionable information to analysts. Our timely updates of news and context covers topics of analytics, technologies and concepts of operation for analytical excellence. Engage with us online at http://AnalystOne.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/analystone.gif"}, "HP": {"url": "http://www8.hp.com/us/en/software/enterprise-software.html", "company_name": "HP", "blurb": "HPHP creates new possibilities for technology to have a meaningful impact on people, businesses, governments and society. With the broadest technology portfolio spanning printing, personal systems, software, services and IT infrastructure, HP delivers solutions for customers' most complex challenges in every region of the world. More information about HP (NYSE: HPQ) is available at http://www.hp.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/hp-4.png"}, "Hortonworks": {"url": "http://www.hortonworks.com", "company_name": "Hortonworks", "blurb": "HortonworksHortonworks is a leading commercial vendor of Apache Hadoop, the preeminent open source platform for storing, managing and analyzing big data. Our distribution, Hortonworks Data Platform powered by Apache Hadoop, provides an open and stable foundation for enterprises and a growing ecosystem to build and deploy big data solutions. Hortonworks is the trusted source for information on Hadoop, and together with the Apache community, Hortonworks is making Hadoop more robust and easier to install, manage and use. Hortonworks provides unmatched technical support, training and certification programs for enterprises, systems integrators, and technology vendors. For more information, visit www.hortonworks.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/hortonworks.gif"}, "WANdisco": {"url": "http://www.wandisco.com/", "company_name": "WANdisco", "blurb": "WANdiscoWANdisco is a provider of enterprise-ready, non-stop software solutions that enable globally distributed organizations to meet today’s data challenges of secure storage, scalability and availability. WANdisco’s products are differentiated by its patented, active-active data replication technology, serving critical requirements for enterprise Hadoop deployments. Fortune Global 1000 companies, including Juniper Networks, Motorola, and Halliburton, rely on WANdisco for performance, reliability, security and availability. For additional information, visit www.wandisco.com. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/wandisco_2.gif"}, "Cray": {"url": "http://www.cray.com/products/analytics", "company_name": "Cray", "blurb": "CrayGlobal supercomputing leader Cray Inc. (Nasdaq: CRAY) provides innovative systems and solutions enabling scientists and engineers in industry, academia and government to meet existing and future simulation and analytics challenges. Leveraging more than 40 years of experience in developing and servicing the world's most advanced supercomputers, Cray offers a comprehensive portfolio of supercomputers and big data storage and analytics solutions delivering unrivaled performance, efficiency and scalability. Cray's Adaptive Supercomputing vision is focused on delivering innovative next-generation products that integrate diverse processing technologies into a unified architecture, allowing customers to meet the market's continued demand for realized performance.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cray.png"}, "Quantopian": {"url": "https://www.quantopian.com", "company_name": "Quantopian", "blurb": "QuantopianQuantopian, is a crowd-sourced hedge fund that offers an algorithmic trading platform for the quantitative trading community to build, test, and execute trading algorithms. Live trading algorithms are eligible become part of our crowd-sourced hedge fund - where top quant talent is matched with outside investor capital. \r\n\r\nQuantopian's mission is to attract the world’s best algorithmic and financial talent, including talent that hasn’t yet had the opportunity to be a quant. We want to bring this talent together, provide them with the tools that they require, and help them build a community.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/quantopian.png"}, "Data Science Central": {"url": "http://www.datasciencecentral.com", "company_name": "Data Science Central", "blurb": "Data Science CentralData Science Central (DSC) is the online resource for Big Data Practitioners / Data Scientists. Featuring news, commentary, and social networking, DSC covers analytics, visualization, integration, BI, tools and trends, and also provides an outlet for career opportunities including talent sourcing.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/data_science_central.gif"}, "DataRobot": {"url": "http://www.datarobot.com/", "company_name": "DataRobot", "blurb": "DataRobotDataRobot is a predictive analytics platform for data scientists to build and deploy accurate predictive models in a fraction of the time it takes today. By harnessing the power of massively parallel computing, DataRobot builds and refines 1000s of possible models using R and Python to find the best ones in just hours. We've incorporated the knowledge and expertise of our world-class data science team into a solution that unleashes the productivity of practitioners, regardless of their level of expertise. From small companies with part-time data scientists to large enterprises with dedicated data science teams - DataRobot helps organizations make better predictions, faster.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datarobot.png"}, "Platfora": {"url": "http://www.platfora.com", "company_name": "Platfora", "blurb": "PlatforaPlatfora is the #1 native Big Data Analytics platform for Hadoop. Platfora puts big data directly into the hands of line-of-business people through self-service analytics that help them uncover new opportunities that were once impossible or impractical across transaction, customer interaction and machine data. An interactive and visual full-stack platform delivered as subscription software in the cloud or on-premises, Platfora Big Data Analytics is creating data-driven competitive advantages in the areas of security, marketing, finance, operations and the Internet of Things. Leading organizations such as Citi, Comcast, DirecTV, Disney, Edmunds.com, Opower, Riot Games, Vivint and The Washington Post use Platfora.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/platfora.png"}, "Intel": {"url": "http://www.intel.com/opensource", "company_name": "Intel", "blurb": "IntelIntel, the world leader in silicon innovation, delivers hardware and software technologies to continually advance how people work and live. For over two decades, Intel's contributions to open-source projects-from one end of the solution stack to the other-have helped ensure that a breadth of solutions run exceptionally well on Intel® architecture. As a result, open-source-based solutions, running on Intel® architecture, help unlock business opportunities, power businesses, connect people, and enhance lives. Open source is bringing amazing experiences to life-and Intel is helping power these experiences as a Sponsor of Tomorrow.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/intel.gif"}, "Teradata": {"url": "http://www.teradata.com/", "company_name": "Teradata", "blurb": "TeradataTeradata helps companies get more value from data than any other company. Our big data analytic solutions, integrated marketing applications, and team of experts can help your company gain a sustainable competitive advantage with data.  Teradata helps organizations leverage all of their data so they can know more about their customers and business and do more of what's really important.  With more than 10,000 professionals in 43 countries, Teradata serves top companies across consumer goods, financial services, healthcare, automotive, communications, travel, hospitality, and more. A future-focused company, Teradata is recognized by media and industry analysts for technological excellence, sustainability, ethics, and business value.  Visit teradata.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/teradata.gif"}, "EMC Corporation": {"url": "http://www.EMC.com", "company_name": "EMC Corporation", "blurb": "EMC CorporationEMC Corporation is a global leader in enabling businesses and service providers to transform their operations and deliver IT as a service. Fundamental to this transformation is cloud computing. Through innovative products and services, EMC accelerates the journey to cloud computing, helping IT departments to store, manage, protect and analyze their most valuable asset -- information -- in a more agile, trusted and cost-efficient way. Additional information about EMC can be found at www.EMC.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/emc-1.gif"}, "Cool Infographics": {"url": "http://www.coolinfographics.com/", "company_name": "Cool Infographics", "blurb": "Cool InfographicsCool Infographics is one of the most influential infographics and data visualization sites, handling up to 45,000 unique visitors a day. Here you will find cool designs, best practices, links to design tools, conference discounts, jobs board and more!", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/coolinfographic.png"}, "Concurrent, Inc.": {"url": "http://www.concurrentinc.com", "company_name": "Concurrent, Inc.", "blurb": "Concurrent, Inc.Concurrent, Inc. is the leader in Big Data application infrastructure, delivering products that help enterprises create, deploy, run and manage data applications at scale. The company's flagship enterprise solution, Driven, was designed to accelerate the development and management of enterprise data applications. Concurrent is the team behind Cascading™, the most widely deployed technology for data applications with more than 150,000 user downloads a month. Used by thousands of businesses including eBay, Etsy, The Climate Corp and Twitter, Cascading is the de facto standard in open source application infrastructure technology. Concurrent is headquartered in San Francisco and online at http://concurrentinc.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/concurrent-1.gif"}, "Informatica": {"url": "http://www.informatica.com", "company_name": "Informatica", "blurb": "InformaticaInformatica is the world's number one independent provider of data integration software. Organizations rely on Informatica to realize their information potential and drive their top business imperatives. Informatica Vibe, the industry's first and only embeddable virtual data machine (VDM), powers the unique \"Map Once. Deploy Anywhere\" capabilities of the Informatica Platform. Vibe harnesses data in every application, every process, for every person and in every device in the world. Organizations around the globe depend on Informatica to fully leverage their information assets from devices to mobile to social to big data residing on-premise, in the Cloud and across social networks.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/informatica-2.gif"}, "Datameer": {"url": "http://www.datameer.com", "company_name": "Datameer", "blurb": "DatameerDatameer is the only proven big data insights platform that quickly transforms businesses into agile, insights-driven organizations. Datameer provides an intuitive platform for fluid data discovery that reveals insights in hours instead of months. More than 200 companies including Citibank, Telefonica, Workday, and VISA use Datameer to integrate, prepare, analyze, and visualize all their data, driving significant competitive advantage and unprecedented ROI.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datameer.gif"}, "Data Science Day": {"url": "http://datascienceday.wordpress.com/", "company_name": "Data Science Day", "blurb": "Data Science DayOne day, many perspectives, millions of new ideas -- this is the mission of Data Science Day in Berlin. DSDay brings together everyone interested in data (from big to small), analytics (from statistics to artificial intelligence), data visualization (from web to city), and creates an open space for sharing ideas. #DSDay", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/data_science_day.gif"}, "Dell": {"url": "http://www.dell.com/PowerEdgeC", "company_name": "Dell", "blurb": "DellDell Inc. listens to customers and delivers innovative technology and services that give them the power to do more. Where others try to force-fit what they have to what you need, Dell Data Center Solutions (DCS) starts with collaborative problem-solving innovation to create exactly what you want/need - right-sized for your environment and your budget. Dell Data Center Solutions custom designs and delivers hyperscale servers including the PowerEdge C series, optimized Cloud and Big Data solutions and some of the most efficient Modular Data Centers. Leverage DCS experience and expertise in your scale-out data center to decrease your TCO. For more information visit: www.Dell.com?PowerEdgeC, www.Dell.com/OpenStack, www.Dell.com/Crowbar, www.Dell.com/Hadoop", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/dell-1.gif"}, "Big Data Partnership": {"url": "http://www.bigdatapartnership.com/", "company_name": "Big Data Partnership", "blurb": "Big Data PartnershipBig Data Partnership is a leading Big Data specialist solution provider. We are based in the UK, with an international client-base. We offer those clients a combination of Consulting, Implementation, Training and Support Services to help them unlock the value in complex data. Our team includes industry-experts and thought leaders in all the major Big Data technologies.\r\n\r\nBig Data Partnership has the knowledge and experience necessary to Discover, Develop & Deliver scalable, reliable Big Data solutions that drive high-impact results for our client.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/big-data-partnership.png"}, "Pentaho": {"url": "http://www.pentahobigdata.com", "company_name": "Pentaho", "blurb": "PentahoPentaho is building the future of business analytics. Pentaho's open source heritage drives our continued innovation in a modern, integrated, embeddable platform built for accessing all data sources. With support for all of the leading Hadoop distributions, NoSQL databases and high performance analytic databases, Pentaho provides the broadest support for big data analytics, as well as integration and orchestration of big data and traditional sources. For more information visit pentahobigdata.com or call +1 866-660-7555.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/pentaho.gif"}, "MarkLogic": {"url": "http://www.marklogic.com", "company_name": "MarkLogic", "blurb": "MarkLogicFor more than a decade, MarkLogic has delivered a powerful, agile and trusted Enterprise NoSQL database platform that enables organizations to turn all data into valuable and actionable information. Organizations around the world rely on MarkLogic’s enterprise-grade technology to power the new generation of information applications. MarkLogic is headquartered in Silicon Valley with offices in Chicago, Frankfurt, London, Munich, New York, Paris, Singapore, Stockholm, Tokyo, Utrecht, and Washington D.C. For more information, please visit www.marklogic.com.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/marklogic.gif"}, "SAS": {"url": "http://www.sas.com/en_gb/software/sas-hadoop.html", "company_name": "SAS", "blurb": "SASThe leader in business analytics software and services, SAS is known for analysing big data. But did you know that SAS provides everything you need to derive insights from data stored in Hadoop? With SAS®, you get simpler data preparation processes, deeper analyses and faster answers. Create seamless access to the Pig and Hive languages and the MapReduce framework. Explore and visualize data stored in Hadoop to discover patterns and publish reports. Model data with domain-specific, high-performance analytics. Automatically deploy and execute models to score data inside Hadoop. From data to decision, we've got you covered. Learn more at sas.com/hadoop.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/sas_2.gif"}, "Syncsort": {"url": "http://www.syncsort.com/", "company_name": "Syncsort", "blurb": "SyncsortSyncsort provides enterprise software to collect, integrate, sort and distribute more data in less time, with fewer resources and lower costs.  Thousands of customers in more than 85 countries, including 87 of the Fortune 100 companies, use our fast and secure software to offload expensive and inefficient legacy data workloads, speed data warehouse and mainframe processing, and optimize cloud data integration. Powering over 50% of the world’s mainframes, Syncsort provides specialized solutions spanning “Big Iron to Big Data,” including Hadoop, Windows, Linux, Unix, Cloud, and Splunk. Experience Syncsort at www.syncsort.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/syncsort_2.gif"}, "HGST": {"url": "http://www.hgst.com", "company_name": "HGST", "blurb": "HGSTHGST, a Western Digital company (NASDAQ: WDC), develops innovative, advanced hard disk drives, enterprise-class solid state drives, external storage solutions and services used to store, preserve and manage the world's most valued data. HGST addresses customers' rapidly changing storage needs by delivering intelligent storage devices that tightly integrate hardware and software to maximize solution performance. Founded by the pioneers of hard drives, HGST provides high-value storage for a broad range of market segments, including Enterprise, Cloud, Data Center, Mobile Computing, Consumer Electronics and Personal Storage. HGST was established in 2003 and maintains its U.S. headquarters in San Jose, California. www.hgst.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/hgst.gif"}, "Ataccama Corporation": {"url": "http://www.ataccama.com/", "company_name": "Ataccama Corporation", "blurb": "Ataccama CorporationAtaccama Corporation combines data quality, master data management, and data governance in a single technology platform, ready for operational, analytical and BigData deployments. Ataccama Data Integration & Processing Platform for Hadoop offers an easy-to-use development interface (GUI), shared metadata, and rich data integration layer - often replacing specialized ETL technologies. It accommodates the key Hadoop features, such as massive parallel processing, scale-out nature, fault tolerance, memory management, etc., and is available to anyone who needs to profile, map, model, process, transform, cleanse, enrich, and integrate data with Hadoop. Kick off your Hadoop initiative and request a complimentary Big Data Test Drive.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ataccama.gif"}, "Apache Software Foundation": {"url": "http://www.apache.org/", "company_name": "Apache Software Foundation", "blurb": "Apache Software FoundationThe Apache Software Foundation provides support for the Apache community of open-source software projects, which provide software products for the public good.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/asf-1.gif"}, "Cloudera": {"url": "http://www.cloudera.com", "company_name": "Cloudera", "blurb": "ClouderaCloudera is revolutionizing enterprise data management with the first unified Platform for Big Data: The Enterprise Data Hub. Cloudera offers enterprises one place to store, process and analyze all their data, empowering them to extend the value of existing investments while enabling fundamental new ways to derive value from their data. Founded in 2008, Cloudera was the first and still is the leading provider and supporter of Hadoop for the enterprise. Cloudera also offers software for business critical data challenges including storage, access, management, analysis, security and search. Cloudera works with over 800 hardware, software and services partners to meet customers' big data goals.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cloudera_10_12_2012.gif"}, "Bigstep ": {"url": "http://bigstep.com/", "company_name": "Bigstep ", "blurb": "Bigstep Bigstep is the only cloud provider dedicated to making professional analytics solutions accessible to companies of all sizes. \r\nWe enable businesses, large and small, to get started with a production-ready big data environment in just a few clicks, all in the Full Metal Cloud, the world’s highest performance cloud, purpose built for big data.\r\nHadoop, NoSQL DBs, search and analytics engines reach up to 500% better performance running on Full Metal compared to virtualised public clouds.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/bigstep_cloud.png"}, "O'Reilly Media": {"url": "http://www.oreilly.com", "company_name": "O'Reilly Media", "blurb": "O'Reilly MediaO'Reilly Media spreads the knowledge of innovators through its books, online services, magazines, research, and conferences. Since 1978, O'Reilly has been a chronicler and catalyst of leading-edge development, homing in on the technology trends that really matter and galvanizing their adoption by amplifying 'faint signals' from the alpha geeks who are creating the future. An active participant in the technology community, the company has a long history of advocacy, meme-making, and evangelism.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/oreilly-logo-red-140x40.png"}, "Bloomberg": {"url": "http://www.bloomberglabs.com/", "company_name": "Bloomberg", "blurb": "BloombergBloomberg technology helps drive the world's financial markets. We provide communications platforms, data, analytics, trading platforms, news and information for the world's leading financial market participants. We deliver through our unrivaled software, digital platforms, mobile applications and state of the art hardware developed by Bloomberg technologists for Bloomberg customers. \r\n\r\n\r\nOur 3,000+ technologists work to define, architect, build and deploy complete systems and solutions that anticipate and fulfill our clients' needs and market demands. We offer critical enterprise computing solutions for the financial services industry to help organizations deliver, decipher and manage data to meet their needs and growing regulatory requirements", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/bloomberg.gif"}, "Dataiku": {"url": "http://www.dataiku.com/", "company_name": "Dataiku", "blurb": "DataikuDataiku develops Data Science Studio (DSS), the most productive development platform for data professionals. DSS is a collaborative tool that integrates all the functionalities required to build end-to-end highly specific services that turn raw data into business impacting predictions quickly. With its visual interface, DSS encourages collaborative work between both business & tech profiles. Because DSS integrates standard data and machine learning tools and technologies that users can transparently appropriate, the platform enables them to efficiently achieve their business goals all the while keeping complete control of their work. Try DSS out for free: http://www.dataiku.com/try\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/dataiku.gif"}, "Basho Technologies": {"url": "http://www.basho.com/", "company_name": "Basho Technologies", "blurb": "Basho TechnologiesBasho Technologies is the developer of Riak and Riak CS,  the most powerful open source distributed database you will ever put into production. \r\n\r\nIt is behind the world’s fastest growing retail, health, media, financial and social applications and used by the NHS, bet365, Best Buy, The Weather Channel, Rovio, and CNN.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/basho.gif"}, "CTOvision.com": {"url": "http://ctovision.com/", "company_name": "CTOvision.com", "blurb": "CTOvision.comCTOvision.com is the resource for enterprise technologists. We feature news, commentary, analysis and social media connections in domains of Big Data, Gov2.0, Cloud Computing, Cyber Security, Business Intelligence, Robotics and other areas of enterprise IT. We are the creators of the popular Twitter list curation tool TwitChimp.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ctovision.gif"}, "Rackspace Hosting": {"url": "http://www.rackspace.co.uk", "company_name": "Rackspace Hosting", "blurb": "Rackspace HostingRackspace® (NYSE: RAX) is the #1 managed cloud company. Its technical expertise and Fanatical Support® allow companies to tap the power of the cloud without the pain of hiring experts in dozens of complex technologies. Rackspace is also the leader in hybrid cloud, giving each customer the best fit for its unique needs--whether on single- or multi-tenant servers, or a combination of those platforms. Rackspace is the founder of OpenStack®, the open-source operating system for the cloud. Based in San Antonio, Rackspace serves more than 200,000 business customers from nine data centers on four continents. www.rackspace.com\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/rackspace_2014.gif"}, "Datafloq": {"url": "https://datafloq.com/", "company_name": "Datafloq", "blurb": "DatafloqDatafloq is the One-Stop Shop for Big Data, creating the Big Data ecosystem by connecting all stakeholders within the global Big Data market. Datafloq is the number one Big Data platform where organizations can find a Big Data technology vendor for their Big Data strategy and where they can find the right Big Data talent. The platform also provides valuable knowledge around Big Data, including trends, best practices, organizational advice, events and trainings. The objective of Datafloq is to spur the global understanding and application of Big Data in order to drive innovation and growth. Visit Datafloq.com today for more information.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datafloq.png"}, "ODBMS.org": {"url": "http://www.odbms.org/", "company_name": "ODBMS.org", "blurb": "ODBMS.orgThe Resource Portal for Big Data and New Data Management Technology: ODBMS.org is a vendor independent, web resource portal with free materials on: Big Data, Cloud platforms, Data Analytics, NewSQL, NoSQL, Graphs and RDF/XML data stores, and Object Databases. It serves software developers at commercial companies and in the open source community, as well as faculty and students at educational and research institutions. It includes the ODBMS Industry Watch Blog.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/odbms2.gif"}, "KDnuggets": {"url": "http://www.kdnuggets.com", "company_name": "KDnuggets", "blurb": "KDnuggetsKDnuggets is an authority on Analytics, Data Mining, and Data Science, with latest News, Jobs, Software, Data, Education, Meetings, and more.  Subscribe to our newsletter or follow @kdnuggets.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/kdnuggets.png"}, "Capgemini": {"url": "http://www.capgemini.com/insights-data", "company_name": "Capgemini", "blurb": "CapgeminiCapgemini Insights & Data\r\nIn a world of connected people and connected things, organizations need a better view of what’s happening on the outside and a faster view of what’s happening on the inside. Data must be the foundation of every decision, but more data simply creates more questions. With over 10,000 professionals across 40 countries Capgemini’s Insights & Data global practice can help you find the answers, by bringing together technology excellence, data science and business expertise. Together we leverage the new data landscape to create deep insights where it matters most - at the point of action. To find out more visit us online at www.capgemini.com/insights-data and https://www.linkedin.com/company/bi-big-data-&-analytics or follow us on Twitter @capgemini.com \r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/capgemini.gif"}, "BMC Software": {"url": "http://www.bmc.com/", "company_name": "BMC Software", "blurb": "BMC SoftwareBMC Software helps leading companies around the world put technology at the forefront of business transformation, improving the delivery and consumption of digital services. From mainframe to cloud to mobile, BMC delivers innovative IT management solutions that have enabled more than 15,000 customers to leverage complex technology into extraordinary business performance-increasing their agility and exceeding anything they previously thought possible.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/bmc.png"}, "Google Cloud Platform": {"url": "https://cloud.google.com/solutions/bigdata/?utm_source=google&utm_medium=event&utm_campaign=2015-q2-cloud-emea-bigdata-preft-csales-Strata&utm_content=ver1-itdm-en", "company_name": "Google Cloud Platform", "blurb": "Google Cloud PlatformToday's applications are generating higher volumes of data at greater speed.  Google Cloud Platform provides the products and services you need to help you collect, ingest, and analyze your data.  With Cloud Platform, you can take advantage of Google's scale and speed to quickly and cost effectively use your data to benefit your business.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/google_2.gif"}, "Exacaster": {"url": "http://www.exacaster.com", "company_name": "Exacaster", "blurb": "ExacasterExacaster is a big data predictive analytics technology company developing advanced machine-learning algorithms and tools that address key sales and marketing challenges including churn or usage prediction, product recommendations, segmentation and real time dynamic pricing. The Exacaster Platform, the company's flagship product, helps telecom and retail marketers visualize data, predict customer behavior with propensity models, execute model-driven or event-triggered multi-channel campaigns and measure their impact.  Exacaster recently unveiled BigMatrix, a new software product which makes data mining on Hadoop considerably more efficient by taking care of definition, extraction and automated updating of feature vectors used for large scale predictive analytics. It easily prepares matrices that have tens of thousands of features for millions of objects. Having deployed its platform for enterprise clients in nine countries on three continents, Exacaster crunches behavioral data on more than 10 million consumers daily. To learn more see www.exacaster.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/exacaster.gif"}, "Attunity": {"url": "http://www.attunity.com", "company_name": "Attunity", "blurb": "AttunityAttunity is a leading provider of information availability software solutions that enable access, management, sharing and distribution of data, including Big Data, across heterogeneous enterprise platforms, organizations, and the cloud. Our software solutions include data replication, data management, test data management, change data capture (CDC), data connectivity, enterprise file replication (EFR), managed-file-transfer (MFT), and cloud data delivery. Using Attunity's software solutions, our customers enjoy significant business benefits by enabling real-time access and availability of data and files where and when needed, across the maze of heterogeneous systems making up today's IT environment. www.attunity.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/attunity.gif"}, "SK telecom": {"url": "http://www.sktelecom.com/en/index_real.html", "company_name": "SK telecom", "blurb": "SK telecomSK Telecom is largest mobile operator of South Korea with over 50% of market share. Throughout its 30-year history, SK Telecom has led the evolution of mobile networks by commercializing CDMA, WCDMA, HSDPA, 150Mbps LTE-A, and 225Mbps LTE-A via Carrier Aggregation (CA) for the first time in the world. SK Telecom continues to innovate in Big Data solutions as well, utilizing Hadoop technologies such as Apache Tajo.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/sk-telecom.png"}, "Cisco": {"url": "http://www.cisco.com", "company_name": "Cisco", "blurb": "CiscoCisco is the worldwide IT leader that enables amazing things to happen when you connect the previously unconnected. Cisco brings together people, process, data and things to transform how organizations meet next-generation demands. Our customers rely on the power of Cisco intelligent servers and networks to be competitive. Our collective strengths enable us to solve our customer's important business challenges. Cisco's true value isn't just in what we make- it's what we make possible. www.cisco.com/go/bigdata", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cisco-blue.png"}, "Gaceta Tecnológica": {"url": "http://www.gacetatecnologica.com/", "company_name": "Gaceta Tecnológica", "blurb": "Gaceta TecnológicaGaceta Tecnológica is a Spanish reference communication portal in the environment of open source and open technologies in a professional and community context.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/gacetatecnologica.gif"}, "MathWorks": {"url": "http://uk.mathworks.com/", "company_name": "MathWorks", "blurb": "MathWorksMathWorks is the leading developer of mathematical computing software. MATLAB, the language of technical computing, is a programming environment for algorithm development, data analysis, visualisation, and numeric computation.  Engineers and scientists worldwide rely on MATLAB for a range of applications, including signal processing and communications, image and video processing, control systems, test and measurement, computational finance, and computational biology.  Visit us to see how MATLAB can help you explore big data, develop analytics, and integrate MATLAB based analytics into Hadoop and other production IT environments.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/mathworks.gif"}, "Swansea University": {"url": "http://www.swansea.ac.uk/mschealthdatascience", "company_name": "Swansea University", "blurb": "Swansea UniversityHealthcare, with an already established strong relationship with Information & Communication Technologies (ICT), is continuously expanding the knowledge forefront as new methods of acquiring data concerning the health of human beings are developed. Processing this data to extract valuable information about a population or the individual is the work of health data scientists. Their work has the potential to improve quality of life on a large scale. In recognition of this trend, Swansea University introduces its brand new MSc in Health Data Science, designed to develop the essential skills and knowledge required of the Health Data Scientist. The delivery of the programme balances the essential theoretical concepts with a strong emphasis on hands-on involvement by students, to ensure a thorough understanding of the key issues involved in each subject.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/swansea_university.png"}, "SoftLayer, an IBM Company": {"url": "http://www.softlayer.com", "company_name": "SoftLayer, an IBM Company", "blurb": "SoftLayer, an IBM CompanySoftLayer, an IBM Company, operates\u2028 a global cloud infrastructure platform built for Internet scale. With more than 180,000 devices under management, and a global footprint of data centers and network points of presence, SoftLayer provides Infrastructure-as-a-Service to leading-edge customers ranging from Web startups to global enterprises. SoftLayer's modular architecture provides unparalleled performance and control, with a full-featured API and sophisticated automation controlling a flexible unified platform that seamlessly spans physical and virtual devices, and a worldwide network for secure, low-latency communications. For more information, please visit softlayer.com.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/softlayer-ibm.png"}, "Cloudwick": {"url": "http://www.cloudwick.com", "company_name": "Cloudwick", "blurb": "CloudwickCloudwick is the leading big data service provider to the Global 1000, delivering expert services, consulting and solutions. Its trained and certified Hadoop, Spark and NoSQL administrators, developers and data scientists have more than 200,000 hours of enterprise production experience with leading enterprises. As a strategic partner to Cloudera, Hortonworks, DataStax, Databricks and AWS, Cloudwick builds, operates, monitors and manages many leading big data systems including 3M, Bank of America, Comcast, Home Depot, Intuit, JP Morgan, NetApp, Target, Visa, Walmart, and more than 50 others. For more information, please visit www.cloudwick.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cloudwick-1.gif"}, "RStudio": {"url": "http://www.rstudio.com/", "company_name": "RStudio", "blurb": "RStudioRStudio offers open source and enterprise ready professional software for R. Our flagship product is an Integrated Development Environment (IDE) which makes it easy for analysts, scientists, data scientists and quants to perform their analyses. We also offer a web application framework called Shiny that allows you to take those analyses and share them with your team/organization by creating interactive web applications. The RStudio team also contributes code to many R packages and projects. R Markdown, ggvis, dplyr, knitr, and packrat are R packages from RStudio that enhance the value, reproducibility, and appearance of the work of data scientists.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/rstudio.gif"}, "TIBCO Analytics": {"url": "www.jaspersoft.com  ", "company_name": "TIBCO Analytics", "blurb": "TIBCO AnalyticsTIBCO Software Inc. is a global leader in infrastructure and business intelligence software. Whether it's optimizing inventory, cross-selling products, or averting crisis before it happens, TIBCO uniquely delivers the Two-Second Advantage® -- the ability to capture the right information at the right time and act on it preemptively for a competitive advantage. With a broad mix of innovative products and services, TIBCO is the strategic technology partner trusted by businesses around the world. Learn more about TIBCO at www.tibco.com.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/tibco_analytics.png"}}