{"Adatao": {"url": "http://adatao.com/", "company_name": "Adatao", "blurb": "AdataoImagine asking plain-English questions and getting beautiful visual answers, interactively from your Hadoop data store. Imagine building powerful machine-learning models to forecast revenues, instantly from your operational RDBMS. Imagine collaborating in real-time with your business analyst, R-loving data scientist and SQL-hacking IT colleagues, all in one beautiful interactive document. Now, imagine no more. Today, Adatao has made this possible for its enterprise customers. Backed by Andreessen Horowitz, and founded by engineering PhDs with Google, Yahoo, Cloudera, SAP experience, Adatao’s vision is to deliver Data Intelligence for All. Come see what Adatao can do for you!", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/adatao.png"}, "X15 Software": {"url": "http://x15soft.com/", "company_name": "X15 Software", "blurb": "X15 SoftwareX15 Software is a revolutionary large-scale machine and log data management company. Our flagship product provides a highly scalable, open and modern platform that combines search and analytic query capabilities. With best-in-class developer productivity and the lowest total cost of ownership, X15 Software is the new global standard for enterprise-wide machine data efforts. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/x15-2.gif"}, "WANdisco": {"url": "http://www.wandisco.com/", "company_name": "WANdisco", "blurb": "WANdiscoWANdisco (LSE: WAND) is a provider of enterprise-ready, non-stop software solutions that enable globally distributed organizations to meet today's data challenges of secure storage, scalability and availability. WANdisco's products are differentiated by the company's patented, active-active data replication technology, serving crucial high availability (HA) requirements, including Hadoop Big Data and Application Lifecycle Management (ALM), including Apache Subversion and Git. Fortune Global 1000 companies, including Juniper Networks, Motorola, and Halliburton, rely on WANdisco for performance, reliability, security and availability. For additional information, please visit www.wandisco.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/wandisco_2.gif"}, "Securonix Inc.": {"url": "http://www.securonix.com/", "company_name": "Securonix Inc.", "blurb": "Securonix Inc.Securonix is working to radically transform all areas of data security with actionable security intelligence. Our purpose-built advanced security analytics technology mines, enriches, analyzes, scores and visualizes customer data into actionable intelligence on the highest risk threats from inside and outside their environment. Using signature-less anomaly detection techniques that track users, account and system behavior, Securonix is able to detect the most advanced data security, insider threats and fraud attacks automatically and accurately. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/strata-securonix.png"}, "Captricity": {"url": "http://www.captricity.com", "company_name": "Captricity", "blurb": "CaptricityCaptricity is the first cloud-native data management platform to capture and convert data generated by paper forms and documents - including handwriting - into business-ready information with an industry- leading accuracy rate of 99.9 percent. Captricity's award-winning, crowd-guided machine learning technology extracts data from any source - paper documents, scans, faxes, emails, call centers and web forms - and connects automatically to backend systems without changing the way organizations work.  Captricity serves a broad range of markets, including insurance, healthcare, government, education and nonprofits.  To learn more, visit: www.captricity.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/captricity.png"}, "VoltDB": {"url": "http://voltdb.com/", "company_name": "VoltDB", "blurb": "VoltDBVoltDB's in-memory SQL database combines streaming analytics with transaction processing in a single, horizontal scale-out platform. Customers use VoltDB to build applications that process streaming data the instant it arrives to make immediate, per-event, context-aware decisions. By delivering real-time in-transaction analytics that always produce correct results, VoltDB enables businesses to capture economic value and develop new revenue opportunities in the mobile, financial services, IoT, energy, advertising, and security industries. VoltDB is privately held with offices in Bedford, Massachusetts, and Santa Clara, California.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/voltdb.png"}, "jSonar": {"url": "http:/www.jsonar.com", "company_name": "jSonar", "blurb": "jSonarjSonar makes Big Data simple. The jSonar Analytics Platform provides an innovative\r\nJSON-based capability for Big Data warehousing and a suite\r\nof rich analytic tools. SonarW, a core component of the platform\r\nis the industry’s first NoSQL Warehouse. SonarW delivers\r\nunprecedented performance, cost savings and vastly simplifies\r\ncomplex Big Data warehousing projects. jSonar also provides\r\npowerful analytic tools such as jSON Studio, SonarR, SonarSQL\r\nand Sonar Gateway. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/jsonar.png"}, "RapidMiner": {"url": "http://rapidminer.com/", "company_name": "RapidMiner", "blurb": "RapidMinerRapidMiner, the industry’s #1 open source predictive analytics platform, is disrupting the industry by empowering enterprises to include predictive analytics in any business process—closing the loop between insight and action. RapidMiner’s effortless solution makes predictive analytics lightning-fast for today’s modern analysts, radically reducing the time to unearth opportunities and risks. RapidMiner delivers game-changing expertise from the largest worldwide predictive analytics community. For more information, visit www.rapidminer.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/rapidminer.gif"}, "Typesafe, Inc.": {"url": "http://www.typesafe.com", "company_name": "Typesafe, Inc.", "blurb": "Typesafe, Inc.Typesafe provides tools for Reactive, Fast Data pipelines: Spark for analytics, Akka for distributed middleware and event streams, Play for web services, and Scala, the implementation language for today's Fast Data tools.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/typesafe.png"}, "Alation": {"url": "https://www.alation.com/", "company_name": "Alation", "blurb": "AlationAlation addresses the gap between the availability of big data and human accessibility. Alation software empowers people to find, use, and govern data for better, faster decisions. Its data accessibility platform observes how users and systems interact with data, combining those observations with machine learning and human insight to centralize the organizational knowledge on data and ensure that it is always up-to-date.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/alation.png"}, "Revolution Analytics": {"url": "http://www.revolutionanalytics.com/", "company_name": "Revolution Analytics", "blurb": "Revolution AnalyticsRevolution Analytics delivers advanced analytics software at half the cost of existing solutions. The company brings high performance, productivity, and enterprise readiness to open source R, the most powerful statistics software in the world. To equip R for the demands and requirements the modern data-driven business, Revolution Analytics builds on open source R with innovations in big data analysis, integration and enterprise deployment. Leading organizations including Merck, Bank of America and Mu Sigma rely on Revolution R Enterprise for their data analysis, development and mission-critical production needs. Revolution Analytics is committed to fostering the growth of the R community, and offers free licenses of Revolution R Enterprise to academia. Revolution Analytics is headquartered in Palo Alto, Calif. and backed by North Bridge Venture Partners and Intel Capital.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/revolutionanalytics.gif"}, "World Wide Technology": {"url": "http://www2.wwt.com", "company_name": "World Wide Technology", "blurb": "World Wide TechnologyWorld Wide Technology (WWT) is a more than $6B systems integrator that brings an innovative and proven approach to how large public and private organizations explore, evaluate, architect and implement multi-vendor solutions. Customers have hands‐on access to cutting-edge data center, networking, security and collaboration products through the WWT Advanced Technology Center; technical expertise from an expansive team of engineering resources; and accelerated global product delivery, powered by a sophisticated supply chain management infrastructure. To learn more about WWT, please visit: wwt.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/world-wide-tech.png"}, "Information Management -- Sourcemedia.com": {"url": "http://www.sourcemedia.com/", "company_name": "Information Management -- Sourcemedia.com", "blurb": "Information Management -- Sourcemedia.comInformation Management is the resource corporate business and IT leaders turn to for up-to-date news analysis, commentary, and insights concerning the application of business analytics, business intelligence and the full range of data management technologies. Key areas of focus include: analytics, big data, business intelligence, business process management, cloud computing, content management, customer relationship management, data governance, data integration, data warehousing, master data management, and performance management.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/informationmanagement.png"}, "Snowflake Computing": {"url": "http://www.snowflake.net/", "company_name": "Snowflake Computing", "blurb": "Snowflake ComputingSnowflake Computing, the cloud data warehousing company, was started by leading data experts with the vision to reinvent the data warehouse. Snowflake’s Elastic Data Warehouse is a new enterprise-class data warehouse designed from the ground up for the cloud and today’s data. Snowflake’s patent-pending architecture delivers on-demand elasticity, scalability, and flexibility that makes it possible to bring together all users, all data and all workloads in a single system. Snowflake combines the power and performance of data warehousing, the familiarity and broad ecosystem of standard SQL, and the flexibility of the cloud—at 90% lower cost than traditional solutions. www.snowflake.net. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/snowflake.png"}, "RTInsights": {"url": "RTInsights.com", "company_name": "RTInsights", "blurb": "RTInsightsRTInsights is an independent, expert-driven web resource that sheds light on the business impact of real-time analytics and the Internet of Things. We help our readers, which include business and IT professionals across almost every industry, understand the value of fast, actionable data and unravel an array of approaches, vendors, and solutions. By working with RTInsights, our partners stay connected and improve their product marketing, lead generation, and thought leadership activity.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/rtinsights.png"}, "Interana": {"url": "http://www.interana.com/", "company_name": "Interana", "blurb": "InteranaInterana is the fast and scalable event-based analytics solution that answers critical business questions on how customers behave and products are used. With Interana, key business metrics that matter most in a data-driven world - such as growth, retention, conversion and engagement - can now be analyzed and explored in seconds rather than the hours or days it often takes with existing solutions. Interana allows customers to discover and investigate these key insights easily through its visual and interactive interface, which makes data analysis a natural extension of everyone's workflow. By helping solve some of the hardest scalability and infrastructure challenges at Facebook, Interana's founding team saw the benefit of bringing these solutions to the broader market and empowering everyone to be data-informed.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/interana.gif"}, "Tableau ": {"url": "http://www.tableau.com/", "company_name": "Tableau ", "blurb": "Tableau Tableau Software helps people see and understand data. Used by more than 20,000 companies and organizations worldwide, Tableau's award-winning software delivers fast analytics and rapid-fire business intelligence. Visit us and see how you can create visualizations and dashboards in minutes, then share in seconds. The result? You get answers from data quickly, with no programming required.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/tableau.png"}, "Splunk": {"url": "http://www.splunk.com/", "company_name": "Splunk", "blurb": "SplunkSplunk Inc. (NASDAQ: SPLK) provides the leading software platform for real-time Operational Intelligence. Splunk® software and cloud services enable organizations to search, monitor, analyze and visualize machine-generated big data coming from websites, applications, servers, networks, sensors and mobile devices. More than 8,400 enterprises, government agencies, universities and service providers in over 100 countries use Splunk software to deepen business and customer understanding, mitigate cybersecurity risk, prevent fraud, improve service performance and reduce costs. Splunk products include Splunk® Enterprise, Splunk Cloud™, Splunk Storm®, Hunk®: Splunk Analytics for Hadoop and premium Splunk Apps. To learn more, please visit http://www.splunk.com/company.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/splunk-1.gif"}, "SAS": {"url": "http://www.sas.com/en_us/software/hadoop-big-data.html", "company_name": "SAS", "blurb": "SASThe leader in business analytics software and services, SAS is known for analyzing big data. But did you know that SAS provides everything you need to derive insights from data stored in Hadoop? With SAS®, you get simpler data preparation processes, deeper analyses and faster answers. Create seamless access to the Pig and Hive languages and the MapReduce framework. Explore and visualize data stored in Hadoop to discover patterns and publish reports. Model data with domain-specific, high-performance analytics. Automatically deploy and execute models to score data inside Hadoop. From data to decision, we've got you covered. Learn more at sas.com/hadoop.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/sas_2.gif"}, "Gaceta Tecnológica": {"url": "http://www.gacetatecnologica.com/", "company_name": "Gaceta Tecnológica", "blurb": "Gaceta TecnológicaGaceta Tecnológica is a Spanish reference communication portal in the environment of open source and open technologies in a professional and community context.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/gacetatecnologica.gif"}, "SAP": {"url": "http://www.sap.com", "company_name": "SAP", "blurb": "SAPSAP helps companies of all sizes and industries run better. From back office to boardroom, warehouse to storefront, desktop to mobile device, SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. We do this by extending the availability of software across on-premise installations, on-demand deployments, and mobile devices. We believe that the power of our people, products, and partners unleashes growth and creates significant new value for our customers, SAP, and, ultimately, entire industries and the economy at large. Our mission is to help companies of all sizes and industries to run better. Our vision is to help the world run better. www.sap.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/SAP.jpg"}, "Apache Software Foundation": {"url": "http://www.apache.org/", "company_name": "Apache Software Foundation", "blurb": "Apache Software FoundationApache products power half the Internet, manage exabytes of data, execute teraflops of operations, store billions of objects in virtually every industry, and enhance the lives of countless users and developers world-wide.  Established in 1999 to shepherd, develop, and incubate Open Source innovations \"The Apache Way\", the ASF oversees 350+ projects led by an all-volunteer community of over 550 individual Members and 4,700 Committers across six continents. For more information, visit http://www.apache.org/ or follow @TheASF on Twitter.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/asf-1.gif"}, "L-3 Data Tactics": {"url": "http://www.L-3DataTactics.com", "company_name": "L-3 Data Tactics", "blurb": "L-3 Data TacticsL-3 Data Tactics applies innovative big data solutions to information overload, rapidly transitioning customers from inefficient data silos to effective knowledge management. An industry-leading group within L-3, our team brings together top data scientists and engineers, semantic researchers and cyber security experts to help global clients face the unique challenges of today’s data-driven industries. For additional information, please visit www.bde.data-tactics.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/L3ball.png"}, "O'Reilly Media": {"url": "http://www.oreilly.com", "company_name": "O'Reilly Media", "blurb": "O'Reilly MediaO'Reilly Media spreads the knowledge of innovators through its books, online services, magazines, research, and conferences. Since 1978, O'Reilly has been a chronicler and catalyst of leading-edge development, homing in on the technology trends that really matter and galvanizing their adoption by amplifying 'faint signals' from the alpha geeks who are creating the future. An active participant in the technology community, the company has a long history of advocacy, meme-making, and evangelism.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/oreilly_logo_box.png"}, "Sense, Inc.": {"url": "https://www.sense.io", "company_name": "Sense, Inc.", "blurb": "Sense, Inc.Sense is an enterprise data science platform that accelerates building and deploying data science pipelines and models.  Sense supports the most powerful tools, including R, Python, Spark, and Hadoop, and is currently in production at sophisticated data-driven enterprises.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/sense.png"}, "ClearStory Data": {"url": "http://www.clearstorydata.com", "company_name": "ClearStory Data", "blurb": "ClearStory DataClearStory Data provides the first Data Intelligence solution that delivers a fast and easy way to access, discover, harmonize, interactively analyze, and collaboratively explore data, from diverse internal and external data sources. ClearStory's solution is an integrated Application and Platform that radically changes how people consume data from corporate and external sources, to accelerate the pace of informed and intelligent decision-making. Anyone and any organization can use ClearStory to speed the constant cycle of question to data-driven answers. The company is backed by investments from Andreessen Horowitz, Google Ventures, Kleiner Perkins Caufield & Byers, Khosla Ventures, DAG Ventures and Silicon Valley industry leaders. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/clearstory.gif"}, "Datafloq": {"url": "https://datafloq.com/", "company_name": "Datafloq", "blurb": "DatafloqDatafloq is the One-Stop Shop for Big Data, creating the Big Data ecosystem by connecting all stakeholders within the global Big Data market. Datafloq is the number one Big Data platform where organizations can find a Big Data technology vendor for their Big Data strategy and where they can find the right Big Data talent. The platform also provides valuable knowledge around Big Data, including trends, best practices, organizational advice, events and trainings. The objective of Datafloq is to spur the global understanding and application of Big Data in order to drive innovation and growth. Visit Datafloq.com today for more information.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datafloq.png"}, "CTOvision.com": {"url": "http://ctovision.com/", "company_name": "CTOvision.com", "blurb": "CTOvision.comCTOvision.com is the resource for enterprise technologists. We feature news, commentary, analysis and social media connections in domains of Big Data, Gov2.0, Cloud Computing, Cyber Security, Business Intelligence, Robotics and other areas of enterprise IT. We are the creators of the popular Twitter list curation tool TwitChimp.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ctovision.gif"}, "Qubole": {"url": "http://www.qubole.com/", "company_name": "Qubole", "blurb": "QuboleQubole was launched in 2013 by Ashish Thusoo and Joydeep Sen Sarma from Facebook's Data Service Team and authors of Apache Hive. Qubole simplifies provisioning, managing and scaling of big data analytics workloads leveraging data stored on AWS. Once IT sets policies, any number of data analysts can be set free to collaboratively “click to query” with the power of Hive, Spark, Presto and many other of a growing list of data processing engines. Our platform, Qubole Data Service (QDS), delivers these best-in-class Apache tools integrated into an enterprise-feature rich platform optimized to run in the cloud at petabyte+ scale.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/qubole.png"}, "Centrify": {"url": "http://www.centrify.com/", "company_name": "Centrify", "blurb": "CentrifyCentrify provides unified identity management across data center, cloud and mobile environments that deliver a single sign-on (SSO) for users and a simplified identity infrastructure for IT. Centrify’s unified identity management software and cloud-based Identity-as-a-Service (IDaaS) solutions leverage an organization’s existing identity infrastructure to enable single sign-on, multi-factor authentication, privileged identity management, auditing for compliance and mobile device management. \r\n\r\nCentrify customers can typically reduce their total cost of identity management and compliance by more than 50 percent, while improving business agility and overall security. Centrify is used by more than 5,000 customers worldwide, including nearly half of the Fortune 50 and more than 60 Federal agencies.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/centrify.png"}, "Ayasdi": {"url": "http://www.ayasdi.com/", "company_name": "Ayasdi", "blurb": "AyasdiAyasdi is on a mission to make the world’s complex data useful by automating and accelerating insight discovery. The company’s Machine Intelligence software employs Topological Data Analysis (TDA), to simplify the extraction of knowledge from the most complex data sets confronting organizations today.\r\n\r\nDeveloped by Stanford computational mathematicians, Ayasdi’s approach combines machine-learning algorithms, abundant compute power and topological summaries to revolutionize the process for converting data into business impact. \r\n\r\nAyasdi is funded by leading venture capitalists including Khosla Ventures, IVP, FLOODGATE, Kleiner Perkins, Citi Ventures, Centerview Capital and DraperNexus.  The company counts many of the Fortune 500 as clients.  ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ayasdi.png"}, "Capital One": {"url": "http://www.capitalone.com", "company_name": "Capital One", "blurb": "Capital OneCapital One started with a simple principle -- attract great talent and give them the opportunity to be great. Founded in 1988, we harnessed the power of big data to create customized products that disrupted the credit card industry. Over the years, our associates have used our information-based strategy to build a great company, bringing breakthrough banking products and services to consumers, small businesses, and commercial clients. Today, with more than 65-million customers and 40,000 associates worldwide, our Cloud-enabled infrastructure, Open Source culture, and leading edge data and analytics platforms are fueling Capital One's position as a digital leader.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/capitalone.png"}, "Attunity": {"url": "http://www.attunity.com", "company_name": "Attunity", "blurb": "AttunityAttunity is a leading provider of information availability software solutions that enable access, management, sharing and distribution of data, including Big Data, across heterogeneous enterprise platforms, organizations, and the cloud. Our software solutions include data replication, data management, test data management, change data capture (CDC), data connectivity, enterprise file replication (EFR), managed-file-transfer (MFT), and cloud data delivery. Using Attunity's software solutions, our customers enjoy significant business benefits by enabling real-time access and availability of data and files where and when needed, across the maze of heterogeneous systems making up today's IT environment. www.attunity.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/attunity.gif"}, "Protegrity": {"url": "http://www.protegrity.com/", "company_name": "Protegrity", "blurb": "ProtegrityProtegrity: Proven Experts in Data Security\r\n \r\nProtegrity is the only enterprise data security software platform that leverages scalable, data-centric encryption, tokenization and masking to help businesses secure sensitive information while maintaining data usability.  Built for complex, heterogeneous business environments, the Protegrity Data Security Platform provides unprecedented levels of data security certified across applications, data warehouses, mainframes, big data, and cloud environments.  Companies trust Protegrity to help them manage risk, achieve compliance, enable business analytics, and confidently adopt new platforms.  For additional information visit www.protegrity.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/protegrity.gif"}, "Mirror Image Internet": {"url": "http://www.mirror-image.com", "company_name": "Mirror Image Internet", "blurb": "Mirror Image InternetMirror Image’s Edge Computing service enables advertising and ad technology companies to execute custom real-time application logic on our patented, global Dynamic Delivery Network (DDN), with the highest levels of performance, scalability, and reliability in a cost-effective manner. Our Geo-Distributed Database service provides low latency, high availability database functionality for our customers’ Edge Computing applications. And our Edge Computing service is ideal for handling a wide range of custom applications and use cases, including programmatic mobile and display advertising applications, asset authentication, online data collection, and targeting and customization initiatives based on cookies, device type, geo-location, and other request attributes. \r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/mirror-image-1.png"}, "Arcadia Data": {"url": "http://www.arcadiadata.com/", "company_name": "Arcadia Data", "blurb": "Arcadia DataThe Arcadia Converged Analytics Platform™ unifies visual analysis, business intelligence and data discovery on distributed software that runs natively on your Hadoop cluster. Technical users, non-technical business users and decision makers can all work in a self-service web browser, simplifying interaction with their data. With Arcadia, enterprises running Hadoop accelerate the payoff of big data, so IT teams avoid the cost and complexity associated with the conventional BI stack. The Arcadia Data platform is deployed by some of the world’s most data intensive companies, including Appboy, HP, and MarketShare. \r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/arcadia_heavier.png"}, "Cisco": {"url": "http://www.cisco.com", "company_name": "Cisco", "blurb": "CiscoCisco is the worldwide IT leader that enables amazing things to happen when you connect the previously unconnected. Cisco brings together people, process, data and things to transform how organizations meet next-generation demands. Our customers rely on the power of Cisco intelligent servers and networks to be competitive. Our collective strengths enable us to solve our customer's important business challenges. Cisco's true value isn't just in what we make- it's what we make possible. www.cisco.com/go/bigdata", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cisco-blue.png"}, "DataFactZ": {"url": "http://www.datafactz.com/", "company_name": "DataFactZ", "blurb": "DataFactZDataFactZ is a highly specialized firm in the area of BI/DW consulting services with a competency in Big Data Analytics solutions designed to generate new value by providing the right skills and smart strategic advice companies are searching for by helping business leaders use data and technology to drive greater insights. With 600+ technical experts and solution consultants' on-staff, DataFactZ offers a specialized team with deep knowledge and tactic around discovering and driving business value in Big Data as businesses are realizing significant operational savings & productivity benefits when it comes to managing large repositories of Structured, Semi-structured and Unstructured data.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datafactz.gif"}, "Inquidia Consulting ": {"url": "http://www.inquidia.com/", "company_name": "Inquidia Consulting ", "blurb": "Inquidia Consulting Inquidia Consulting believes that the power of data will transform our world.   We use this passion to deliver professional services to you, our client, helping you become data-driven by extracting maximum value from your growing data assets.   Our full spectrum data strategy, engineering and analytics services enable you to inquire, learn and take action with your data.  We deliver transformative solutions that combine our expertise in big data architecture, advanced analytics and best-practice business intelligence system design/deployment.  Find out more at www.inquidia.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/inquidia.png"}, "Collibra Inc.": {"url": "https://www.collibra.com/", "company_name": "Collibra Inc.", "blurb": "Collibra Inc.Collibra Corporation is the industry’s only global data governance provider founded to address data management from the business stakeholder perspective. Delivered through a cloud-based or on-premise solution Collibra is the trusted data authority that provides data stewardship, data governance and data management for the enterprise business user.\r\n\r\nFounded in 2008 and combining entrepreneurial roots with software and artificial intelligence expertise, Collibra has locations in New York, London, Brussels and Wroclaw. For more information visit www.collibra.com\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/collibra.png"}, "OvalEdge": {"url": "http://ovaledge.com/", "company_name": "OvalEdge", "blurb": "OvalEdgeOvalEdge is designed to solve diverse data problem on Hadoop data lake. When data lake have thousands of diverse data set, OvalEdge connects everything and identify relationships and correlations among data set. These algorithms makes it possible to analyze all the data by a business user. OvalEdge has a self service, excel styled user interface, where a business user can ask any question without the need of IT expertise. It's analytical recommendations provides new ideas for business users to look into data from a different perspective, which leads to a better valuable discovery.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ovaledge.png"}, "PHEMI Systems": {"url": "http://www.phemi.com", "company_name": "PHEMI Systems", "blurb": "PHEMI SystemsPHEMI is a big data warehouse company that lets organizations easily access and mine any variety of data at any volume to drive insights that lower costs, improve outcomes, and allow better decisions faster.  \r\n\r\nWith an industry-pioneering approach to privacy, security, and governance, PHEMI protects privacy and ensures legitimate use of data to drive continuous improvement and help organizations meet compliance and governance requirements. An organizational ambassador for Privacy by Design, PHEMI brings both privacy and performance to big data solutions, along with the data management and control formerly only afforded by traditional enterprise data warehouses.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/phemi.png"}, "WebAction": {"url": "http://webaction.com/", "company_name": "WebAction", "blurb": "WebActionWebAction is the most comprehensive, realtime stream analytics platform. \r\n\r\nEnterprises can quickly build tailored Big Data applications that assimilate both \r\n\r\nstructured and unstructured data from a wide variety of realtime sources such \r\n\r\nas market data, IoT and mobile devices, sensors, log files, social media, and \r\n\r\ntransactions. \r\n\r\nWith this high velocity data in-memory, users can rapidly aggregate and \r\n\r\ncorrelate across multiple streams, and deliver custom-built stream analytics \r\n\r\napplications. \r\n\r\nThese applications can be easily iterated and integrated to create a robust yet \r\n\r\nflexible connected application ecosystem. By combining up-to-the-millisecond \r\n\r\nvisibility with the greatest possible context, users can identify and resolve issues \r\n\r\ninstantaneously.\"", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/webaction.gif"}, "DataRPM": {"url": "http://www.datarpm.com/", "company_name": "DataRPM", "blurb": "DataRPMDataRPM is an advanced analytics platform rapidly maximizing profits for e-commerce companies by helping them monetize actionable business insights. DataRPM’s Smart Insights platform utilizes machine learning, statistical algorithms and advanced search to automatically deliver insights potentially worth millions in revenue. Users can leverage these insights to uncover deeper and more meaningful results with Smart Data Discovery through a natural language interface. The platform’s unique ability to perform Smart Mash Up from multiple data sources produces insights that will otherwise remain uncovered. DataRPM was named “Best New Big Data Solution” by the American Business Awards and “Cool Vendor” by Gartner.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datarpm.png"}, "MetaScale": {"url": "http://www.metascale.com/", "company_name": "MetaScale", "blurb": "MetaScaleMetaScale leverages our Fortune 100 heritage to help organizations develop and implement their big data strategy. We take a holistic approach to advising organizations in the development of their analytics use cases with clearly defined success criteria. Our teams design and build relevant business cases, custom big data programs and long term strategy to meet current and future analytics requirements. Our proven methodologies, best practices, patent pending tools and experienced resources make us your best strategic partner for accelerating your big data initiatives.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/metascale.png"}, "Accenture": {"url": "http://www.accenture.com", "company_name": "Accenture", "blurb": "AccentureAccenture is a global management consulting, technology services and outsourcing company, with more than 305,000 people serving clients in more than 120 countries. Combining unparalleled experience, comprehensive capabilities across all industries and business functions, and extensive research on the world's most successful companies, Accenture collaborates with clients to help them become high-performance businesses and governments. The company generated net revenues of US$30.0 billion for the fiscal year ended Aug. 31, 2014. Its home page is www.accenture.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/accenture_new.jpg"}, "MathWorks": {"url": "http://www.mathworks.com", "company_name": "MathWorks", "blurb": "MathWorksMathWorks is the leading developer of mathematical computing software. MATLAB, the language of technical computing, is a programming environment for algorithm development, data analysis, visualization, and numeric computation.  Engineers and scientists worldwide rely on MATLAB for a range of applications, including signal processing and communications, image and video processing, control systems, test and measurement, computational finance, and computational biology.  Visit us to see how MATLAB can help you explore big data, develop analytics, and integrate MATLAB based analytics into Hadoop and other production IT environments.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/mathworks.gif"}, "Caringo": {"url": "http://www.caringo.com", "company_name": "Caringo", "blurb": "CaringoCaringo was founded in 2005 and has been developing software-defined storage for nearly a decade, giving customers control over any volume, flow or size of unstructured information; dramatically reducing complexity and costs while extracting maximum value and performance from hardware. Caringo's unique benefits are delivered through a symmetric architecture that enables massive scalability, elastic content protection, and automation of management in a comprehensive software suite. The result is the industry's most efficient object storage software ideal for Big Data applications, while providing robust indexing for continued insight and analysis.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/caringo.png"}, "Canonical": {"url": "http://www.ubuntu.com", "company_name": "Canonical", "blurb": "CanonicalAs a member of the free software community, Canonical is committed to supporting the development of open source. Our employees are passionate about technology, open source and, of course, Ubuntu. While our main goal is to ensure that Ubuntu continues to be freely available to everyone around the world, we are also focused on building new tools and software to encourage innovation. Projects like Unity, Upstart, Apport, Juju, Cloud-Init, Launchpad and Bazaar are just a few examples of our ongoing commitment to initiatives that promote software development and collaboration throughout the community.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/canonical.gif"}, "TIBCO Software": {"url": "http://www.tibco.com", "company_name": "TIBCO Software", "blurb": "TIBCO SoftwareTIBCO Software Inc. is a global leader in infrastructure and business intelligence software. Whether it’s optimizing inventory, cross-selling products, or averting crisis before it happens, TIBCO uniquely delivers the Two-Second Advantage® – the ability to capture the right information at the right time and act on it preemptively for a competitive advantage. With a broad mix of innovative products and services, TIBCO is the strategic technology partner trusted by businesses around the world.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/tibco-1.png"}, "HP": {"url": "http://www8.hp.com/us/en/software/enterprise-software.html", "company_name": "HP", "blurb": "HPHP creates new possibilities for technology to have a meaningful impact on people, businesses, governments and society. With the broadest technology portfolio spanning printing, personal systems, software, services and IT infrastructure, HP delivers solutions for customers' most complex challenges in every region of the world. More information about HP (NYSE: HPQ) is available at http://www.hp.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/hp-4.png"}, "RedPoint Global": {"url": "http://www.redpoint.net", "company_name": "RedPoint Global", "blurb": "RedPoint GlobalRedPoint Global creates data-enabled solutions that drive customer success. Our Data Management product - a comprehensive ETL, data quality and data integration application -- operates across both traditional and Hadoop 2.0/YARN environments with no need for MapReduce. Its graphical user interface makes designing, executing, and automating data management processes easy and fast. The product has received outstanding customer, analyst, and industry reviews.  RedPoint was selected as one of CIO Review's \"100 Most Promising Big Data Companies\" out of 2,000 vendors. For information, visit www.redpoint.net or email contact.us@redpoint.net.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/redpoint.gif"}, "JethroData": {"url": "http://jethrodata.com/", "company_name": "JethroData", "blurb": "JethroDataJethroData is a unique SQL and Indexing engine for Hadoop. It works by automatically indexing data as it is written into Hadoop. Queries use indexes to access only the data they need instead of performing a full-scan of the entire dataset, leading to both a dramatic improvement in speed and a substantial reduction in computing resource usage. Jethro is optimal for use cases such as interactive ad-hoc queries, live dashboards and rapid reports where queries typically access a portion of the data. With Jethro, you enjoy the scalability of Hadoop with the performance of an analytical database, in one system.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/jethrodata.gif"}, "Platfora": {"url": "http://www.platfora.com", "company_name": "Platfora", "blurb": "PlatforaPlatfora is the #1 native Big Data Analytics platform for Hadoop. Platfora puts big data directly into the hands of line-of-business people through self-service analytics that help them uncover new opportunities that were once impossible or impractical across transaction, customer interaction and machine data. An interactive and visual full-stack platform delivered as subscription software in the cloud or on-premises, Platfora Big Data Analytics is creating data-driven competitive advantages in the areas of security, marketing, finance, operations and the Internet of Things. Leading organizations such as Citi, Comcast, DirecTV, Disney, Edmunds.com, Opower, Riot Games, Vivint and The Washington Post use Platfora.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/platfora.png"}, "DataSift": {"url": "http://www.datasift.com", "company_name": "DataSift", "blurb": "DataSiftDataSift is the leader in Human Data Intelligence that empowers application developers to maximize the value of Human Data, in real-time. Processing more than 2 billion human-generated interactions a day, the privacy-first DataSift platform transforms Human Data into actionable intelligence without compromising consumer trust. Founded in 2010 and headquartered in San Francisco, DataSift has operations in New York, Reading and London, UK and Canada. DataSift's vast ecosystem of partners includes Oracle, Sysomos and WPP as well as thousands of application developers across a wide variety of industries including retail, telecommunications, high tech, consumer packaged goods and digital agencies. More information can be found at datasift.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datasift-1.gif"}, "GridGain": {"url": "http://www.gridgain.com", "company_name": "GridGain", "blurb": "GridGainGridGain is revolutionizing real-time data access and processing by offering the first enterprise-grade In-Memory Data Fabric powered by Apache Ignite™. The GridGain In-Memory Data Fabric integrates a compute grid, data grid, service grid, as well as streaming, messaging and Apache Spark shared memory into a single solution that enables massive data throughput and ultra-low latencies for traditional and emerging data stores (SQL, NoSQL, Hadoop). Operating across any number of clustered commodity servers, it is designed to conquer today’s most demanding Fast Data challenges and to unleash the competitive advantage of any real-time business, whether on-premises or in the cloud. Offering the most comprehensive, enterprise-grade in-memory computing solution for high-volume transactions, real-time analytics and hybrid transactional/analytical data processing, GridGain enables Fortune 500 companies and innovative mobile, web and SaaS companies to anticipate and innovate ahead of market changes.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/gridgain-1.png"}, "Informatica": {"url": "http://www.informatica.com", "company_name": "Informatica", "blurb": "InformaticaInformatica is the world's number one independent provider of data integration software. Organizations rely on Informatica to realize their information potential and drive their top business imperatives. Informatica Vibe, the industry's first and only embeddable virtual data machine (VDM), powers the unique \"Map Once. Deploy Anywhere\" capabilities of the Informatica Platform. Vibe harnesses data in every application, every process, for every person and in every device in the world. Organizations around the globe depend on Informatica to fully leverage their information assets from devices to mobile to social to big data residing on-premise, in the Cloud and across social networks.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/informatica-2.gif"}, "Datameer": {"url": "http://www.datameer.com", "company_name": "Datameer", "blurb": "DatameerDatameer is the only proven big data insights platform that quickly transforms businesses into agile, insights-driven organizations. Datameer provides an intuitive platform for fluid data discovery that reveals insights in hours instead of months. More than 200 companies including Citibank, Telefonica, Workday, and VISA use Datameer to integrate, prepare, analyze, and visualize all their data, driving significant competitive advantage and unprecedented ROI.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datameer.png"}, "Alteryx": {"url": "http://www.alteryx.com/", "company_name": "Alteryx", "blurb": "Alteryx\r\nAlteryx is the leader in data blending and advanced analytics software. Alteryx Analytics provides analysts with an intuitive workflow for data blending and advanced analytics that leads to deeper insights in hours, not the weeks typical of traditional approaches. Analysts love the Alteryx analytics platform because they can deliver deeper insights by seamlessly blending internal, third party, and cloud data, and then analyze it using spatial and predictive drag-and-drop tools. This is all done in a single workflow, with no programming required. Thousands of data analysts worldwide rely on Alteryx daily. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/alteryx.gif"}, "DeepSense.io": {"url": "http://deepsense.io/", "company_name": "DeepSense.io", "blurb": "DeepSense.ioIn deepsense.io, we focus on bringing Spark to any business where operating on Big Data is crucial. Our newest product, Seahorse, defines a new way to interact with Apache Spark. From now on, users can build Spark applications using an intuitive visual environment without the need to write any code. Seahorse Community Version has its premiere at Strata+Hadoop World and is available for free. The company offers also customized machine learning and Hadoop&Spark services to address business-specific needs and problems. Visit our website: deepsense.io and follow us @deepsense_io", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/deepsense-main.png"}, "Plotly Technologies Inc.": {"url": "https://plot.ly/", "company_name": "Plotly Technologies Inc.", "blurb": "Plotly Technologies Inc.Plotly (https://plot.ly/) is a data visualization and analysis platform for making and sharing beautiful, web-based graphs. Scientists, engineers and journalists can work in teams across Plotly’s web app and APIs for Python, R, MATLAB, Julia, and Excel. We support interactive 2D, 3D, and live-streaming graphs.  Our enterprise solution powers innovation and collaboration in industry, government and academia.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/plotly.png"}, "Zaloni": {"url": "http://www.zaloni.com/", "company_name": "Zaloni", "blurb": "ZaloniZaloni provides enterprise data management solutions for Hadoop. Our software solutions enable customers to gain competitive advantage through organized, actionable Hadoop data lakes. Serving the Fortune 500, Zaloni has helped its customers build production Hadoop implementations at many of the world’s leading telecommunications, financial services and healthcare companies.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/zaloni.png"}, "Actian": {"url": "http://www.actian.com", "company_name": "Actian", "blurb": "ActianActian transforms Big Data into business value for any organization - not just the privileged few.  Actian provides transformational business value by delivering actionable insights into new sources of revenue, business opportunities, and ways of mitigating risk with high-performance in-database analytics complemented with extensive connectivity and data preparation. The 21st century software architecture of the Actian Analytics Platform delivers extreme performance on off-the-shelf hardware, overcoming key technical and economic barriers to broad adoption of Big Data.  Actian also makes Hadoop enterprise-grade by providing high-performance data enrichment, visual design and SQL analytics on Hadoop without the need for MapReduce skills. Among tens of thousands of organizations using Actian are innovators using analytics for competitive advantage in industries like financial services, telecommunications, digital media, healthcare and retail.  The company is headquartered in Silicon Valley and has offices worldwide.   Stay connected with Actian Corporation at www.actian.com or on Facebook, Twitter and LinkedIn", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/actian.gif"}, "Barrage": {"url": "http://databarrage.com", "company_name": "Barrage", "blurb": "BarrageBarrage provides an easy way implement sophisticated, actionable pattern detection on sensor and streaming data. Use historical data to identify and verify pattern definitions, then start real-time searches for those patterns in live data streams. When a pattern is found, Barrage can send immediate, detailed notification messages to humans or other systems.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/barrage.png"}, "Pentaho": {"url": "http://www.pentaho.com", "company_name": "Pentaho", "blurb": "PentahoPentaho, a Hitachi Data Systems company, is a leading data integration and business analytics company with an enterprise-class, open source-based platform for diverse big data deployments. Pentaho’s unified data integration and analytics platform is comprehensive, completely embeddable and delivers governed data to power any analytics in any environment. Learn more at www.pentaho.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/pentaho-hds.png"}, "MarkLogic": {"url": "http://www.marklogic.com", "company_name": "MarkLogic", "blurb": "MarkLogicNext generation Big Data needs a next generation database. MarkLogic is the trusted platform for Big Data applications designed to drive revenue, streamline operations, manage risk, and make the world safer. Discover what makes MarkLogic a truly unique NoSQL database for the enterprise. Visit www.marklogic.com for more information.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/mark_logic2.gif"}, "NETbuilder": {"url": "http://www.netbuilder.com", "company_name": "NETbuilder", "blurb": "NETbuilderNETbuilder is a leading provider of Consulting and Managed Services to some of the UK’s largest Government departments, as well as world leading Commercial and Financial institutions. \r\n\r\nOur capability as an end-to-end solution provider enables Digital Delivery, Development and Managed Services. We transform our client’s organizations, improve their performance and provide them with the capability to be at the forefront of their industry.\r\n\r\nThe NETbuilder Academy offers expertize across many technologies, enabling scalability and stability through a constant feed of talented local resources directly into the local market. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/netbuilder-1.png"}, "MemSQL": {"url": "http://www.memsql.com", "company_name": "MemSQL", "blurb": "MemSQLMemSQL is a distributed database for real-time analytics. Data scientists, analysts, and developers can query high velocity workloads and historical data simultaneously, all through a convenient SQL interface. By combining significant speed and throughput advantages with complex analytics, an enterprise can gain instant insight to their business and stay competitive in a fast-moving environment.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/MemSQL.gif"}, "Cloudera": {"url": "http://www.cloudera.com", "company_name": "Cloudera", "blurb": "ClouderaCloudera is revolutionizing enterprise data management with the first unified Platform for Big Data: The Enterprise Data Hub. Cloudera offers enterprises one place to store, process and analyze all their data, empowering them to extend the value of existing investments while enabling fundamental new ways to derive value from their data. Founded in 2008, Cloudera was the first and still is the leading provider and supporter of Hadoop for the enterprise. Cloudera also offers software for business critical data challenges including storage, access, management, analysis, security and search. Cloudera works with over 800 hardware, software and services partners to meet customers' big data goals.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cloudera_2015.png"}, "Rackspace Hosting": {"url": "http://www.rackspace.com", "company_name": "Rackspace Hosting", "blurb": "Rackspace HostingRackspace® (NYSE: RAX) is the #1 managed cloud company. Its technical expertise and Fanatical Support® allow companies to tap the power of the cloud without the pain of hiring experts in dozens of complex technologies. Rackspace is also the leader in hybrid cloud, giving each customer the best fit for its unique needs--whether on single- or multi-tenant servers, or a combination of those platforms. Rackspace is the founder of OpenStack®, the open-source operating system for the cloud. Based in San Antonio, Rackspace serves more than 200,000 business customers from nine data centers on four continents. www.rackspace.com\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/rackspace_2014.gif"}, "CapTech": {"url": "http://www.captechconsulting.com/", "company_name": "CapTech", "blurb": "CapTechCapTech is an award-winning national IT Management consulting firm bridging the gap between business and technology. We deliver Transformation, Customer Engagement, Data & Analytics and Custom IT solutions for America’s leading Fortune 500 and government agencies.\r\n\r\nOur collaborative approach helps organizations grow their business, engage with customers and turn information into powerful data assets.\r\n\r\nIt’s one of the reasons we’ve been on the Inc. 500/5000 list for 9 years.\r\n\r\nOur clients tell us it’s because others talk, CapTech listens.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/captech-1.png"}, "Regis University": {"url": "http://www.regis.edu", "company_name": "Regis University", "blurb": "Regis UniversityRegis University is proud to stand among the 28 Jesuit colleges in the United States, which share the Jesuit vision of a values-centered education shaping intelligent decision-making. Our robust Computer and Information Science programs go beyond technical know-how, empowering students to develop techniques for the discovery of information in data in a socially responsible manner. We are one of the few universities in the U.S. to offer a MS in Data Science program that focuses on both the analytics and engineering aspects of big data, while also discussing the many social and ethical issues surrounding advances in today's technology.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/regis-u.png"}, "Capgemini": {"url": "http://www.capgemini.com/bim", "company_name": "Capgemini", "blurb": "CapgeminiCapgemini Insights & Data\r\nIn a world of connected people and connected things, organizations need a better view of what’s happening on the outside and a faster view of what’s happening on the inside. Data must be the foundation of every decision, but more data simply creates more questions. With over 10,000 professionals across 40 countries Capgemini’s Insights & Data global practice can help you find the answers, by bringing together technology excellence, data science and business expertise. Together we leverage the new data landscape to create deep insights where it matters most - at the point of action. To find out more visit us online at www.capgemini.com/insights-data and https://www.linkedin.com/company/bi-big-data-&-analytics or follow us on Twitter @capgemini.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/capgemini.gif"}, "Altiscale": {"url": "https://www.altiscale.com/", "company_name": "Altiscale", "blurb": "AltiscaleAltiscale offers the first cloud service that is purpose-built to run Apache Hadoop.   Altiscale's optimized infrastructure is faster, more reliable, easier to use, and more affordable than alternatives.  Without the distractions of Hadoop operations, and with access to practically unlimited resources, Altiscale customers can drive more business value from Hadoop than ever before.  Altiscale's founding team has been at the forefront of Apache Hadoop, from its incubation at Yahoo! to operating more than 40,000 Hadoop nodes. Altiscale is backed by General Catalyst and Sequoia Capital, with additional investment from Accel Partners, Jerry Yang, and other individual investors.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/altiscale.png"}, "Talend": {"url": "http://www.talend.com", "company_name": "Talend", "blurb": "TalendTalend provides integration solutions that truly scale for any type of integration challenge, any volume of data, and any scope of project, no matter how simple or complex.  Talend's highly scalable data, application and business processes integration platform leverages all information assets and accelerates dramatically the time-to-value of integration. Ready for big data, Talend's flexible architecture easily adapts to future IT platforms. A common set of easy-to-use tools implemented across all Talend products maximizes the skills of integration teams, too. Unlike vendors offering closed and disjointed solutions, Talend offers an open and flexible platform, supported by a predictable subscription model.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/talend-1.png"}, "BlueTalon": {"url": "http://bluetalon.com/", "company_name": "BlueTalon", "blurb": "BlueTalonBlueTalon provides best-of-breed data access control solutions for Hadoop, SQL, and big data environments. We keep enterprises in control of their data by allowing them to give users access to the data they need, not a byte more. \r\n\r\nThe BlueTalon Policy Engine serves as a bridge between users, the applications they use and Hadoop data repositories to provide authorization and protect data with fine-grained access control, data masking and stealth analytics. \r\n\r\nBlueTalon brings enterprise-grade data security and control to Hadoop!", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/bluetalon.png"}, "Wolfram Research": {"url": "http://www.wolfram.com", "company_name": "Wolfram Research", "blurb": "Wolfram ResearchWolfram is the company where computation meets knowledge. A leader in scientific and technical\r\ninnovation for over 25 years, Wolfram continues to build toward a future\r\nwhere sophisticated computation and knowledge-based programming is\r\nuniversally accessible. Combined, the new Wolfram Language, Wolfram\r\nEngine, and Wolfram Cloud will make possible a computable model of the\r\nworld—in essence, a global brain. Wolfram is the creator of Mathematica,\r\nthe world’s foremost technical computing program; Wolfram|Alpha, the\r\nwidely used computable knowledge engine; and the Computable Document\r\nFormat (CDF), for dynamic content delivery. Computation. Knowledge.\r\nContent. Interaction. Infrastructure. Learn more at www.wolfram.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/wolfram-2.png"}, "Microsoft": {"url": "http://www.microsoft.com", "company_name": "Microsoft", "blurb": "MicrosoftMicrosoft believes anyone should be able to get insights from Big Data.  So, we bring the power of the cloud to Big Data making it easier than ever to work with all data types.  With Microsoft data solutions, everyone can bring Big Data business insights to life through advanced analytics and stunning visualizations - all powered by our enterprise-grade, flexible and open cloud. Explore our solutions at www.microsoft.com/bigdata.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/microsoft_2012.gif"}, "Domino Data Lab": {"url": "http://www.dominodatalab.com", "company_name": "Domino Data Lab", "blurb": "Domino Data LabDomino is a workbench for enterprise data science, facilitating the end-to-end analytical lifecycle, from model development all the way to deployment.  Domino works alongside the tools and languages data scientists already use, including R, Python, Julia and more, making it easy to run, scale, track, share, and deploy analytical models, either on the cloud or on-premise. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/domino_data_labs.png"}, "Tachyon Nexus, Inc.": {"url": "tachyonnexus.com", "company_name": "Tachyon Nexus, Inc.", "blurb": "Tachyon Nexus, Inc.Tachyon Nexus consists of the creators and top committers of Tachyon. We are revolutionizing the way you store, access, and manage data. The company is funded by Andreessen Horowitz. \r\n\r\nTachyon is an open source, memory-centric, distributed storage system. Tachyon is open source under the Apache license, and we are committed to maintaining this model. Tachyon is one of the fastest growing open source projects in the Big Data ecosystem. With two years of open source history, Tachyon has attracted more than 100 contributors from over 30 organizations. Tachyon Nexus collaborates closely with the community in furthering this progress.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/tachyon_nexus.png"}, "SQLdep": {"url": "http://www.sqldep.com", "company_name": "SQLdep", "blurb": "SQLdepOn-demand service that helps data warehousing teams to understand how data travel across the database. By transforming SQL code into visual data-lineage charts developers are relieved from routine and time consuming tasks.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/sqldep.png"}, "Zettaset": {"url": "http://www.zettaset.com", "company_name": "Zettaset", "blurb": "ZettasetZettaset, the leader in Big Data security, helps financial services, healthcare, retail and government organizations achieve corporate and regulatory compliance.\r\n\r\nZettaset's advanced data encryption, policy-based access-control, and authentication solutions are  optimized for scale and performance in open source environments, while delivering comprehensive, enterprise-class protection...on-premises or in the cloud.\r\n\r\nZettaset's standards-based encryption software is simple to deploy, easily fits into existing enterprise security and policy frameworks, and is compatible with any Apache-based Hadoop distribution or NoSQL database.\r\n\r\nZettaset is a sponsor of the Open Data Platform (ODP) initiative.  Strategic security partners include IBM Power Systems, HP Atalla, Thales e-Security, and Utimaco.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/zettaset.png"}, "NetApp": {"url": "http://www.netapp.com/us/", "company_name": "NetApp", "blurb": "NetAppLeading organizations worldwide count on NetApp® for software, systems and services to manage and store all their data.  With solutions for Hadoop, Splunk, NoSQL and SAS among others, NetApp provides a highly available and scalable storage platform for analytics. Enterprises and service providers across a wide range of industries and use cases deploy NetApp for their big data workloads. Customers value our teamwork, expertise and passion for helping them succeed now and into the future.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/netapp-1.png"}, "GigaSpaces Technologies, Inc.": {"url": "http://www.gigaspaces.com", "company_name": "GigaSpaces Technologies, Inc.", "blurb": "GigaSpaces Technologies, Inc.GigaSpaces Technologies provides software middleware for deployment, management and scaling of mission-critical applications on cloud environments through two main product lines, XAP In-Memory Computing and Cloudify. Hundreds of Tier-1 organizations worldwide are leveraging GigaSpaces’ technology to enhance IT efficiency and performance, from top financial firms, e-commerce companies, online gaming providers, healthcare organizations and telecom carriers.\r\n\r\nGigaSpaces was founded in 2000 and has offices in the US, Europe and Asia. For more information, please visit www.gigaspaces.com or our blog at blog.gigaspaces.com.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/gigaspaces.png"}, "InfoObjects": {"url": "http://www.infoobjects.com/", "company_name": "InfoObjects", "blurb": "InfoObjectsInfoObjects is an award-winning Big Data consulting company primarily focused on Apache Spark. InfoObjects is Inc. 5000 fastest growing company in America in last 4 years in a row and has been awarded #1 best place to work in bay area by San Francisco business times and Silicon Valley business journal in 2014. We provide consultants who are big data experts to fill the talent gap in client’s Big Data implementations. We also take complete Big Data projects and implement them using our in-house team at US and India offices. Please contact us at bigdata@infoobjects.com to explore how we can help you drive new business insights using the power of open-source Big Data tools like Apache Spark and the technical expertise of our team.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/infoobjects.png"}, "SoftLayer, an IBM Company": {"url": "http://www.softlayer.com", "company_name": "SoftLayer, an IBM Company", "blurb": "SoftLayer, an IBM CompanySoftLayer, an IBM Company, operates\u2028 a global cloud infrastructure platform built for Internet scale. With more than 180,000 devices under management, and a global footprint of data centers and network points of presence, SoftLayer provides Infrastructure-as-a-Service to leading-edge customers ranging from Web startups to global enterprises. SoftLayer's modular architecture provides unparalleled performance and control, with a full-featured API and sophisticated automation controlling a flexible unified platform that seamlessly spans physical and virtual devices, and a worldwide network for secure, low-latency communications. For more information, please visit softlayer.com.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/softlayer-ibm.png"}, "SnapLogic": {"url": "http://www.snaplogic.com/", "company_name": "SnapLogic", "blurb": "SnapLogicSnapLogic is the industry’s first data integration platform as a service, powering big data ingestion, preparation and delivery in the enterprise. Companies like Adobe, Blackberry, iRobot and Target rely on SnapLogic's 300+ pre-built integrations and modern scale-out platform to rapidly connect all of their data, cloud and on-premises applications and APIs. SnapLogic is funded by leading venture investors, including Andreessen Horowitz and Ignition Partners and founded by Gaurav Dhillon, co-founder and former CEO of Informatica.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/snaplogic.png"}, "RStudio": {"url": "http://www.rstudio.com/", "company_name": "RStudio", "blurb": "RStudioRStudio offers open source and enterprise ready professional software for R. Our flagship product is an Integrated Development Environment (IDE) which makes it easy for analysts, scientists, data scientists and quants to perform their analyses. We also offer a web application framework called Shiny that allows you to take those analyses and share them with your team/organization by creating interactive web applications. The RStudio team also contributes code to many R packages and projects. R Markdown, ggvis, dplyr, knitr, and packrat are R packages from RStudio that enhance the value, reproducibility, and appearance of the work of data scientists.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/rstudio.gif"}, "Amazon Web Services": {"url": "http://aws.amazon.com", "company_name": "Amazon Web Services", "blurb": "Amazon Web ServicesAmazon Web Services offers a collection of tools for storing, querying and collaborating around datasets at any scale. The AWS Cloud features pay as you go access to production grade, high scale services for working with data, including NoSQL database services such as DynamoDB, managed Hadoop analytics platforms with Elastic MapReduce, and highly durable storage. Get started with the free tier; sign up at: http://aws.amazon.com/big-data", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/amazonwebservices.gif"}, "Red Hat": {"url": "http://www.redhat.com", "company_name": "Red Hat", "blurb": "Red HatRed Hat is the world's leading provider of open source solutions, taking a community-powered approach to provide reliable\r\nand high-performing cloud, virtualization, storage, Linux, and middleware technologies. Red Hat also offers award-winning\r\nsupport, training, and consulting services. And as the connective hub in a global network of enterprises, partners, and open\r\nsource communities, Red Hat enables the creation of relevant, innovative technologies that liberate resources for growth and\r\nprepare customers for the future of IT. Red Hat is an S&P company with more than 70 offices spanning the globe,\r\nempowering our customers' businesses.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/red_hat.gif"}, "Impetus": {"url": "http://bigdata.impetus.com/", "company_name": "Impetus", "blurb": "ImpetusImpetus is a provider of innovative Big Data solutions and services. We empower enterprises in the financial services, healthcare, digital media, travel and entertainment, and manufacturing industries to gain big business impact from Big Data. We use proven methodologies spanning the full life-cycle of architecture advisory, proof of value, data science, application development and implementation services. We are experts in the complete Big Data ecosystem, including Hadoop, Cassandra, NoSQL, MPP systems, real-time and predictive analytics, machine learning, visualization, cloud computing and enterprise mobility. For more information, visit bigdata.impetus.com.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/impetus.gif"}, "MapR Technologies": {"url": "http://www.mapr.com", "company_name": "MapR Technologies", "blurb": "MapR TechnologiesMapR delivers on the promise of Hadoop with a proven, enterprise-grade platform that supports a broad set of mission-critical and real-time production uses. MapR brings unprecedented dependability, ease-of-use, and world-record speed to Hadoop, NoSQL, database and streaming applications in one unified Big Data platform. MapR is used across financial services, retail, media, healthcare, manufacturing, telecommunications and government organizations as well as by leading Fortune 100 and Web 2.0 companies. Amazon, Cisco and Google are part of MapR's broad partner ecosystem. Investors include Lightspeed Venture Partners, Mayfield Fund, NEA and Redpoint Ventures. Connect with MapR on Facebook, LinkedIn and Twitter.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/mapr.gif"}, "Elastic": {"url": "https://www.elastic.co/", "company_name": "Elastic", "blurb": "ElasticElastic is a company that believes getting insight from data matters. Built around three open source products — Elasticsearch, Logstash, and Kibana — Elastic is extending what’s possible with data, delivering on the promise that good things come from connecting the dots. Designed to help users take data from any source and search, analyze, and visualize it in real time, Elastic products are changing the way organizations get value from data. To learn more, visit www.elastic.co.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/elastic.png"}, "DataStreams Corporation": {"url": "http://www.datastreamsglobal.com", "company_name": "DataStreams Corporation", "blurb": "DataStreams CorporationDataStreams is the No. 1 Korean data management software provider which has expertise in enterprise data management and big data processing with a lot of experiences in many projects for financial service, government, and telecommunication industries in Korea. In the age of big data, DataStreams has built deep capabilities for big data platform and analytics technologies such as data integration, data governance, and even real-time big data search and archiving. DataStreams offers a comprehensive enterprise suite for the big data management and provides opportunities to get more value from your big data.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datastreams.png"}, "H2o.ai": {"url": "http://www.0xdata.com", "company_name": "H2o.ai", "blurb": "H2o.aiH2O is fast scalable open-source machine learning and deep learning for Smarter Applications. With H2O enterprises like PayPal, Nielsen, Cisco and others can use all of their data without sampling and get accurate predictions faster. Advanced algorithms, like Deep Learning, Boosting and Bagging Ensembles are readily available for application designers to build smarter applications through elegant APIs. Some of our earliest customers have built powerful domain-specific predictive engines for Recommendations, Customer Churn, Propensity to Buy, Dynamic Pricing and Fraud Detection for the Insurance, Healthcare, Telecommunications, AdTech, Retail and Payment Systems.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/h2o-ai.png"}, "Data Science Day": {"url": "http://datascienceday.wordpress.com/", "company_name": "Data Science Day", "blurb": "Data Science DayOne day, many perspectives, millions of new ideas -- this is the mission of Data Science Day in Berlin. DSDay brings together everyone interested in data (from big to small), analytics (from statistics to artificial intelligence), data visualization (from web to city), and creates an open space for sharing ideas. #DSDay", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/data_science_day.gif"}, "Ryft": {"url": "http://www.ryft.com/", "company_name": "Ryft", "blurb": "RyftRyft streamlines and accelerates your existing big data infrastructure by 100X with the world’s fastest and most efficient Linux server purpose-built to accelerate a library of built-in algorithms to speeds of 10GB/sec and faster. The Ryft ONE is the first open platform of its kind capable of analyzing any type of data—historical and streaming, structured and unstructured—at 10 GB/sec with no data preparation required. With the ability to search and analyze 48 terabytes of data in a single 1U device, the Ryft ONE provides customers with the insights to unlock critical discoveries, create new markets, and drive business growth. ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ryft.png"}, "DataRobot": {"url": "http://www.datarobot.com/", "company_name": "DataRobot", "blurb": "DataRobotDataRobot is a predictive analytics platform for data scientists to build and deploy accurate predictive models in a fraction of the time it takes today. By harnessing the power of massively parallel computing, DataRobot builds and refines 1000s of possible models using R and Python to find the best ones in just hours. We've incorporated the knowledge and expertise of our world-class data science team into a solution that unleashes the productivity of practitioners, regardless of their level of expertise. From small companies with part-time data scientists to large enterprises with dedicated data science teams - DataRobot helps organizations make better predictions, faster.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datarobot.png"}, "Unravel Data": {"url": "http://www.unraveldata.com", "company_name": "Unravel Data", "blurb": "Unravel DataUnravel is the optimization platform for modern data applications.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/unravel.png"}, "Ataccama Corporation": {"url": "http://www.ataccama.com/", "company_name": "Ataccama Corporation", "blurb": "Ataccama CorporationAtaccama Corporation combines data quality, master data management, and data governance in a single EIM technology platform ready for operational, analytical and big data deployments. Ataccama Big Data Engine offers an easy-to-use development interface (GUI), shared metadata, and rich data integration layer — often replacing specialized ETL technologies.  Ataccama platform fully supports various processing paradigms (e.g. Single server, MapReduce, Spark) and therefore enables the users to choose the most appropriate approach for their use case. Kick off your big data initiative and request a complimentary Big Data Test Drive.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ataccama.gif"}, "Teradata": {"url": "http://www.teradata.com/", "company_name": "Teradata", "blurb": "TeradataTeradata helps companies get more value from data than any other company. Our big data analytic solutions, integrated marketing applications, and team of experts can help your company gain a sustainable competitive advantage with data.  Teradata helps organizations leverage all of their data so they can know more about their customers and business and do more of what's really important.  With more than 10,000 professionals in 43 countries, Teradata serves top companies across consumer goods, financial services, healthcare, automotive, communications, travel, hospitality, and more. A future-focused company, Teradata is recognized by media and industry analysts for technological excellence, sustainability, ethics, and business value.  Visit teradata.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/teradata.gif"}, "Entrigna, Inc.": {"url": "http://www.entrigna.com", "company_name": "Entrigna, Inc.", "blurb": "Entrigna, Inc.Entrigna's flagship product, RTES, is the most comprehensive, fully integrated set of Data Science tools, together with a highly scalable, cost-effective run-time environment for processing real-time Big Data. RTES includes Optimization, Complex Event Processing, Business Rules, Machine Learning, Artificial Intelligence, Classification & Clustering, Regressions, Data Mining.  \r\nEntrigna also provides consulting services that leverage its data science expertise and software.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/entrigna.png"}, "Concurrent, Inc.": {"url": "http://www.concurrentinc.com", "company_name": "Concurrent, Inc.", "blurb": "Concurrent, Inc.Concurrent, Inc. is the leader in Big Data application infrastructure, delivering products that help enterprises create, deploy, run and manage data applications at scale. The company's flagship product, Driven, is a Big Data application performance management solution designed to help companies build, monitor and manage their applications. Concurrent is the team behind Cascading™, the most widely deployed technology for data applications with more than 300,000 user downloads a month. Used by over 10,000 businesses including eBay, HomeAway, Spotify and Twitter, Cascading is the standard for open source application infrastructure technology. Concurrent is headquartered in San Francisco and online at www.concurrentinc.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/concurrent-1.gif"}, "VMware, Inc.": {"url": "http://www.vmware.com", "company_name": "VMware, Inc.", "blurb": "VMware, Inc.VMware, Inc. is the global leader in virtual infrastructure software for industry-standard systems. Virtual infrastructure provides a layer of abstraction between the computing, storage and networking hardware and the software that runs on it. VMware Infrastructure simplifies IT so companies leverage their storage, network, and computing resources to control costs and respond faster.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/vmware.png"}, "Novetta": {"url": "http://www.novetta.com/", "company_name": "Novetta", "blurb": "NovettaNovetta delivers agile big data analytics that empower our customers to quickly extract value from massive amounts of data and make confident, data-driven decisions. Novetta Entity Analytics is the first to offer high-speed, high quality, entity resolution natively on Hadoop. Novetta Entity Analytics provides unified views of people, locations, organizations, events, and relationships across multiple systems and sources so you can connect the dots and start solving your business problems. Whether it is business intelligence, customer and marketing analytics, or fraud and risk analysis, Novetta can help you quickly tear down silos to uncover the insights that drive better decisions.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/novetta-1.png"}, "CrowdFlower": {"url": "http://www.crowdflower.com", "company_name": "CrowdFlower", "blurb": "CrowdFlowerFounded in 2009, CrowdFlower is the leading data enrichment platform for data scientists. Our quality-control technology is the most accurate and fastest way to collect, label, and clean data from an on-demand workforce. Our platform automates the management of the online workforce to tackle tasks that require human intelligence -- like search relevance tuning, data categorization, image annotation, metadata creation, sentiment analysis, transcription, and de-duplication. Backed by Trinity Ventures, Bessemer Venture Partners and Canvas Venture Fund, CrowdFlower's customers include LinkedIn, Intuit, Flickr, General Electric, The Home Depot, Edelman, and ebay. People-powered data enrichment - www.crowdflower.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/crowdflower.gif"}, "Dato": {"url": "https://dato.com/", "company_name": "Dato", "blurb": "DatoDato is the company behind GraphLab Create, a pioneering platform for scalable machine learning. The company's software and services help organizations of all sizes create the intelligence that drives business like optimizing internal processes, personalizing customer experience, even creating new revenue streams. Dato dramatically boosts the productivity of data scientists and app developers who want to be creative with their data, letting them prototype and deploy with the same code. Well-known firms spanning every vertical use Dato software to build the apps that make item recommendations, predict customer churn, detect fraud, analyze social networks and provide customer insights among others.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/dato.png"}, "Digital Reasoning": {"url": "http://www.digitalreasoning.com/", "company_name": "Digital Reasoning", "blurb": "Digital ReasoningDigital Reasoning delivers trusted cognitive computing for a better world. Our machine learning-based analytics platform, Synthesys®, understands how humans communicate by analyzing the context, content and relationships within Big Data while semantically revealing what’s most critical to our clients.\r\n \r\nSynthesys can rapidly read data from any source, resolve what’s valuable and what’s not, and reason using a dynamic knowledge graph, which helps government agencies, financial institutions and healthcare organizations reveal concealed relationships, risks and opportunities.\r\n\r\nDigital Reasoning is headquartered outside of Nashville, Tennessee, with offices in Washington, D.C., New York, and London.  For more information, visit us at www.digitalreasoning.com\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/dIgital-reasoning.png"}, "Pepperdata": {"url": "http://www.pepperdata.com", "company_name": "Pepperdata", "blurb": "PepperdataPepperdata is a real-time cluster optimizer for Hadoop that gives operators unprecedented control over and visibility into their MapReduce, YARN, HBase, and Spark deployments. Pepperdata's software dynamically adjusts cluster utilization based on business policies and priorities so that jobs run faster and more reliably. Pepperdata-enabled clusters are significantly more efficient, typically seeing 30-50% capacity gains. For more information, visit www.pepperdata.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/pepperdata.gif"}, "Syncsort": {"url": "http://www.syncsort.com/", "company_name": "Syncsort", "blurb": "SyncsortSyncsort provides enterprise software that allows organizations to collect, integrate, sort, and distribute more data in less time, with fewer resources and lower costs. Thousands of customers in more than 85 countries, including 87 of the Fortune 100 companies, use our fast and secure software to optimize and offload data processing workloads. Syncsort software provides specialized solutions spanning “Big Iron to Big Data,” including next gen analytical platforms such as Hadoop, cloud, and Splunk. Experience Syncsort at http://www.syncsort.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/syncsort_2.gif"}, "DataStax": {"url": "http://www.datastax.com", "company_name": "DataStax", "blurb": "DataStaxDataStax powers the online applications that transform businesses for more than 400 customers, including startups and more than 20 of the Fortune 100. DataStax delivers a massively scalable, flexible and continuously available big data platform built on Apache Cassandra™. DataStax integrates enterprise-ready Cassandra, Apache Hadoop™ for analytics and Apache Solr™ for search across multi-datacenters and in the cloud. Companies such as Adobe, Healthcare Anytime, eBay and Netflix rely on DataStax to transform their businesses. Based in Santa Clara CA, DataStax is backed by industry-leading investors: Lightspeed Venture Partners, Crosslink Capital, Meritech Capital Partners, Scale Venture Partners, DFJ Growth and Next World Capital. For more information, visit DataStax or follow us @DataStax and @DataStaxEU", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datastax.gif"}, "Paxata": {"url": "http://www.paxata.com/", "company_name": "Paxata", "blurb": "PaxataEvery data analyst will admit they spend more time cleaning, merging and shaping data than on discovery or analytics. While traditional ETL processes is fine for data that is constant and controlled, 50% or more of the information being used by the business comes from ever-changing data, derived from a set of highly dynamic sources. Paxata is the first Adaptive Data Preparation™ platform built from the ground-up to address IT and business requirements for data integration, quality, enrichment, collaboration and governance. Paxata makes it possible for every analyst to rapidly get ALL the data they need ready for analytics in minutes...not hours or days. Paxata is a cloud-based, self-service solution powered by Intellifusion™, the proprietary semantic fusion and machine learning engine which proactively and automatically detects data types, relationships, patterns, anomalies and errors, via a highly interactive visual experience. Built on the Hadoop stack, and in partnership with Cloudera, Paxata delivers data prep @scale with a seamless connection to any BI tool like Tableau, Qlik and Excel, so analysts have total flexibility to use the visualization and discovery solutions they prefer to use. Stop by Booth No 301 to see Paxata in action. www.paxata.com, @paxata", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/paxata-2.gif"}, "Intel": {"url": "http://www.intel.com/opensource", "company_name": "Intel", "blurb": "IntelIntel, the world leader in silicon innovation, delivers hardware and software technologies to continually advance how people work and live. For over two decades, Intel's contributions to open-source projects-from one end of the solution stack to the other-have helped ensure that a breadth of solutions run exceptionally well on Intel® architecture. As a result, open-source-based solutions, running on Intel® architecture, help unlock business opportunities, power businesses, connect people, and enhance lives. Open source is bringing amazing experiences to life-and Intel is helping power these experiences as a Sponsor of Tomorrow.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/intel.gif"}, "Aerospike": {"url": "http://www.aerospike.com/", "company_name": "Aerospike", "blurb": "AerospikeAerospike is the world’s fastest database – the system of engagement – powering a new class of real-time, context-driven applications that personalize the consumer experience across the Internet. Developers use Aerospike, an open-source, flash-optimized, in-memory NoSQL key-value store for caching, as a user profile or context store, and to simplify scaling with smaller clusters and the price/performance of flash. Recognized by industry analysts as a visionary and leader, Aerospike powers 13 of the top 26 real-time bidding platforms including AppNexus and developers are rapidly taking advantage of the Startup Special to scale their business. Download the open source Aerospike Community Edition at www.aerospike.com and follow @aerospikedb.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/aerospike.png"}, "Rocana": {"url": "http://www.rocana.com", "company_name": "Rocana", "blurb": "RocanaRocana provides enterprises with the ability to maintain control of their modern, global-scale infrastructure. By using ​Big ​Data and advanced analytics, Rocana augments staff skills to increase efficiency and awareness, thereby improving service assurance. Unlike brute-force, legacy log management tools that lack scalability, are slow, and have poor cost-to-value ratios, Rocana Ops is optimized to manage huge amounts of data and encourage analysis to show a complete picture of IT operations.​", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/rocana-1.png"}, "Basho Technologies": {"url": "http://www.basho.com/", "company_name": "Basho Technologies", "blurb": "Basho TechnologiesBasho Technologies, Inc. is a distributed systems company dedicated to developing disruptive technology that simplify enterprises’ most critical data management challenges. Basho’s distributed database, Riak KV, the industry leading distributed NoSQL database, and Basho’s cloud storage software, Riak S2, are used by fast-growing Web businesses and by one-third of the Fortune 50 to power their critical Web, mobile and social applications, and their public and private cloud platforms. The recently launched Basho Data Platform helps enterprises reduce the complexity of supporting Big Data applications. Basho is the organizer of RICON – a distributed systems conference.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/basho.gif"}, "BPI Network": {"url": "http://www.bpinetwork.org", "company_name": "BPI Network", "blurb": "BPI NetworkThe Business Performance Innovation (BPI) Network is a peer-driven thought leadership and professional networking organization dedicated to advancing the emerging roles of the Chief Innovation Officer and Innovation Strategist within today's enterprise. The BPI Network brings together global executives who are champions of change within their organizations through ongoing research, authoritative content and peer-to-peer conversations. We are advocates for Innovation as a fundamental discipline and function within 21st Century organizations and seek to demonstrate where and how new inventive solutions and approaches can advance business value, gratify customers, ensure sustainability and create competitive advantage for companies worldwide.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/bpinetwork.png"}, "Skytree Inc.": {"url": "http://www.skytree.net", "company_name": "Skytree Inc.", "blurb": "Skytree Inc.Skytree®-The Machine Learning Company® is disrupting the Advanced Analytics market with a Machine Learning platform that gives organizations the power to discover deep analytic insights, predict future trends, make recommendations and reveal untapped markets and customers. Advanced Analytics is quickly becoming a strategic technology in the age of Big Data. Backed by investments from US Venture Partners, Javelin Venture Partners, Samsung, UPS and In-Q-Tel, Skytree is at the forefront with enterprise-grade Machine Learning. Skytree's flagship product-Skytree Infinity™-is the only general purpose platform on the market, built for the highest accuracy, speed and scalability.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/skytree.gif"}, "KDnuggets": {"url": "http://www.kdnuggets.com", "company_name": "KDnuggets", "blurb": "KDnuggetsKDnuggets is an authority on Analytics, Data Mining, and Data Science, with latest News, Jobs, Software, Data, Education, Meetings, and more.  Subscribe to our newsletter or follow @kdnuggets.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/kdnuggets.png"}, "ThoughtSpot": {"url": "http://www.thoughtspot.com/", "company_name": "ThoughtSpot", "blurb": "ThoughtSpotThoughtSpot is a new breed of search engine for data. We help any employee get answers in seconds from their company data.  No one should have to wait for days to get a report built by IT or a data analyst.  ThoughtSpot delivers answers instantly with zero training.  We have developed an analytical search engine for relational databases - designed to scale across any data source and process terabytes of data while still returning answers in milliseconds.  ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/thought-spot.png"}, "Oracle": {"url": "http://www.oracle.com", "company_name": "Oracle", "blurb": "OracleOracle provides the world's most complete, open, and integrated business software and hardware systems representing a variety of sizes and industries in more than 145 countries around the globe. Big data is revolutionizing the way businesses and government operate virtually overnight. As you explore how to leverage the power of big data in your business, let the experts at Oracle show you how to maximize value from big data and transform your world. Oracle and big data -- transform your business with big data today. Learn about our Big Data Solutions at http://www.oracle.com/us/technologies/big-data/index.html", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/oracle.gif"}, "StreamSets Inc.": {"url": "http://www.streamsets.com", "company_name": "StreamSets Inc.", "blurb": "StreamSets Inc.StreamSets Continuous Ingest is an innovative, enterprise-grade infrastructure that accelerates time to analysis by bringing processing and unprecedented visibility to data in motion. We provide data scientists self-service data pipelines, with data introspection and traceability, while simultaneously providing well-governed operations for data infrastructure teams. Today, this work is either done manually using open source technologies, or by repurposing legacy technologies. These data pipelines are opaque, brittle and ad-hoc, leading to poor data SLAs. StreamSets works with any feed, device, service or data store to uniquely provide adaptable flows, in-stream sanitization, intelligent monitoring, and continuous operations. To learn more visit www.streamsets.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/streamsets.png"}, "Veristorm": {"url": "http://www.veristorm.com", "company_name": "Veristorm", "blurb": "VeristormMainframe transaction, log and enterprise data served in near-real time to your Hadoop projects. Reduce costs by performing batch projects and archival of mainframe data in Hadoop.  Integrated with IBM BigInsights, Cloudera, Hortonworks and MapR, vStorm Enterprise is the industry’s most secure software for a lightweight alternative to traditional ETL without staging, costly software development or MIPS charges. Only vStorm Enterprise has SSL encryption of data-in-motion. You can even keep your data on platform with zDoop, Hadoop for Linux on z and Power Systems. Supports: DB2, VSAM, SMF/RMF, IMS and more.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/veristorm.gif"}, "DataTorrent": {"url": "http://www.datatorrent.com", "company_name": "DataTorrent", "blurb": "DataTorrentDataTorrent is the first data & action platform in the world that can instantaneously process streaming data on a massive-scale. Built exclusively on Hadoop 2.0, it lets enterprises process, monitor, analyze, and act on massive amounts of unstructured or structured data in real-time. DataTorrent runs directly in your Hadoop cluster in memory and handles the processing and transformation of your data instantaneously, with built-in fault tolerance and elasticity. Unlike traditional batch processing that can literally take hours, DataTorrent enables immediate \"NowTime\" decision making. Download our platform today at www.datatorrent.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datatorrent-1.gif"}, "Super Micro Computers, Inc.": {"url": "http://www.supermicro.com", "company_name": "Super Micro Computers, Inc.", "blurb": "Super Micro Computers, Inc.Supermicro is the leading innovator in high-performance, high-efficiency server technology is a premier provider of advanced server Building Block Solutions® for Data Center, Cloud Computing, Enterprise IT, Hadoop/Big Data, HPC and Embedded Systems worldwide. Supermicro is committed to protecting the environment through its “We Keep IT Green®” initiative and provides customers with the most energy-efficient, environmentally-friendly solutions available on the market.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/supermicro.png"}, "Databricks": {"url": "http://databricks.com/", "company_name": "Databricks", "blurb": "DatabricksDatabricks was founded out of the UC Berkeley AMPLab by the creators of Apache Spark. We’ve been working for the past six years on cutting-edge systems to extract value from Big Data. We believe that Big Data is a huge opportunity that is still largely untapped, and we’re working to revolutionize what you can do with it.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/databricks.png"}, "MongoDB": {"url": "http://www.mongodb.com", "company_name": "MongoDB", "blurb": "MongoDBMongoDB makes development simple and beautiful. For tens of thousands of organizations, MongoDB provides agility and the freedom to scale. Fortune 500 enterprises, startups, hospitals, governments and organizations of all kinds use MongoDB because it is the best database for modern applications. Through simplicity, MongoDB changes what it means to build. Through openness, MongoDB elevates what it means to work with a software company. Please visit www.MongoDB.com for more.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/mongodb.png"}, "BlueData": {"url": "http://www.bluedata.com/", "company_name": "BlueData", "blurb": "BlueDataBlueData is transforming Big Data infrastructure. The BlueData EPIC software platform leverages virtualization and patent-pending innovations to make it easier, faster, and more cost-effective to deploy Hadoop or Spark infrastructure. With BlueData, our customers can provide Hadoop-as-a-Service in an on-premises deployment model.  They can spin up virtual Hadoop or Spark clusters within minutes – providing their data scientists with on-demand access to the applications, data and infrastructure they need. Learn more at www.bluedata.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/bluedata-1.png"}, "Silicon Valley Data Science": {"url": "http://svds.com/", "company_name": "Silicon Valley Data Science", "blurb": "Silicon Valley Data ScienceSilicon Valley Data Science is a boutique consulting firm specializing in business transformation through data science and engineering. We are a company of experienced software engineers, architects, data scientists, strategists, and designers who specialize in data driven product development and experimentation. We work in holistic teams trained in strategic and agile approaches: whether you’re using your data to understand your customers or build new go-to-market offerings, we help you align each project with your business objectives so that together we can create meaningful capabilities and capture value early and often.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/silicon_valley_data_science.png"}, "ScaleOut Software": {"url": "http://www.scaleoutsoftware.com", "company_name": "ScaleOut Software", "blurb": "ScaleOut SoftwareScaleOut Software puts the power of in-memory computing into an elegant platform. Our in-memory computing server delivers continuous, data-parallel computation on your live data to capture perishable business opportunities. Now, the power of ScaleOut's platform can be accessed using standard Hadoop MapReduce. With ScaleOut hServer®, use the same Hadoop MapReduce code you're familiar with to continuously analyze, live, fast-changing data. Deploy your batch models on live data, generate real-time alerts, ETL data into HDFS and much more. There are many possibilities when you combine your batch and live data analysis under the same familiar framework.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/scaleout-1.gif"}, "AtScale": {"url": "http://www.atscale.com/", "company_name": "AtScale", "blurb": "AtScaleAtScale delivers the power of Hadoop into the hands of business analysts.  AtScale turns your Hive warehouse into an OLAP server, allowing you to use tools like Tableau or Excel to interactively query billions or trillions of rows of data.  AtScale Dynamic Cubes access the data directly in your Hadoop cluster without requiring ETL or data movement, and support modern data formats like arrays, structs, and non-scalars.  With AtScale, customers can now benefit from the affordable scale that Hadoop delivers coupled with the interactive response times and business friendly interfaces that have historically been limited to scale-constrained OLAP solutions.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/atscale.gif"}, "Datawatch Corporation": {"url": "http://www.datawatch.com", "company_name": "Datawatch Corporation", "blurb": "Datawatch CorporationDatawatch Corporation provides the only Managed Analytics Platform that brings together self-service data preparation with visual data discovery.  Its software bridges the gap between the ease that business user’s demand and the automation and governance needed by IT. Users can quickly discover key factors that improve their business by transforming data from multi-structured sources, as well as real-time streaming data, into visually rich analytic applications. Organizations of every size, worldwide use Datawatch products, including 93 of the Fortune 100. Learn more at www.datawatch.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/datawatch.png"}, "IBM": {"url": "http://www.ibm.com/us/en/", "company_name": "IBM", "blurb": "IBMIBM is the global leader in Big Data and Analytics, and offers the most comprehensive solutions for Hadoop and for the Hadoop ecosystem. These solutions include the ODP-compliant IBM Open Platform (IOP), a free Hadoop distribution, in-Hadoop analytic technologies to accelerate the conversion of data into valuable insight for businesses, and leading edge Spark-enabled solutions geared at the growing profession of Data Science and Data Engineering. IBM's offerings are available in the cloud, enabling customers to quickly scale their capabilities to meet their growing workloads.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/ibm.gif"}, "Sigmoid ": {"url": "http://www.sigmoid.com/", "company_name": "Sigmoid ", "blurb": "Sigmoid Sigmoid provides a completely managed, enterprise grade platform for Real Time Streaming Data Analytics on top of Apache Spark ,addressing varied use cases across industry verticals like Ad analytics, Fraud Detection, Sensor Data Analytics, Log Analytics, among others. The platform provides one-click automated cluster deployment, cluster health monitoring, job performance statistics, 24/7 high availability, security and zero data loss features and can process over a million events/sec. Sigmoid is enabling companies to take action real time actions on their data.\r\nVisit us on www.sigmoid.com for a demo.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/sigmoid.png"}, "Hortonworks": {"url": "http://www.hortonworks.com", "company_name": "Hortonworks", "blurb": "HortonworksHortonworks is the leader in emerging Open Enterprise Hadoop and develops, distributes and supports the only 100% open source Apache Hadoop data platform. Our team comprises the largest contingent of builders and architects within the Hadoop ecosystem who represent and lead the broader enterprise requirements within these communities.\r\n\r\nThe Hortonworks Data Platform provides an open platform that deeply integrates with existing IT investments and upon which enterprises can build and deploy Hadoop-based applications.\r\n\r\nHortonworks has deep relationships with the key strategic data center partners that enable our customers to unlock the broadest opportunities from Hadoop.\r\n\r\nFor more information, visit www.hortonworks.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/hortonworks.gif"}, "Cray": {"url": "http://www.cray.com", "company_name": "Cray", "blurb": "CrayGlobal supercomputing leader Cray Inc. (Nasdaq: CRAY) provides innovative systems and solutions enabling scientists and engineers in industry, academia and government to meet existing and future simulation and analytics challenges. Leveraging more than 40 years of experience in developing and servicing the world's most advanced supercomputers, Cray offers a comprehensive portfolio of supercomputers and big data storage and analytics solutions delivering unrivaled performance, efficiency and scalability. Cray's Adaptive Supercomputing vision is focused on delivering innovative next-generation products that integrate diverse processing technologies into a unified architecture, allowing customers to meet the market's continued demand for realized performance.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cray.png"}, "Simba Technologies Inc.": {"url": "http://www.simba.com/", "company_name": "Simba Technologies Inc.", "blurb": "Simba Technologies Inc.Simba Technologies is the recognized world leader in standards-based data access and analytics products and solutions for both relational and multi-dimensional data sources. Simba delivers data connectivity solutions on multiple platforms, including Windows, Mac, UNIX, Linux and many mobile device platforms. Simba’s data connectivity products support multiple interfaces, including ODBC, JDBC, OLE DB, OLE DB for OLAP (ODBO), XML for Analysis (XMLA), ADO, ADO.NET, ADOMD and ADOMD.NET.\r\n\r\nSimba’s software is used worldwide. Its customers include leading independent software vendors and global enterprises like Alteryx®, Altiscale®, Cloudera®, Couchbase®, Databricks®, DataStax®, Google®, Hortonworks®, MapR®, Microsoft®, Oracle®, Qubole®, SAP®, Splunk®, Tableau®, and Teradata®.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/simba.png"}, "Apervi": {"url": "http://apervi.com/", "company_name": "Apervi", "blurb": "AperviWe are a data engineering company offering an easy to use big data integration platform, and we augment it with our expertise, knowledge and value-added services. Apervi's flagship product, \"Conflux\", is designed as a unified orchestration engine that allows the creation of hybrid applications leveraging the processing power of big data computing systems like Hadoop, Storm and Spark. You can build big data pipelines with ready-to-use connectors and operators without having to write any custom code. You can seamlessly design big data applications involving batch and streaming data from a unified visual HTML5 interface. The platform simplifies scheduling, monitoring and troubleshooting of big data jobs and workflows with an integrated maintenance module. We also offer accelerators, which are pre-built workflow templates that can be leveraged to quickly start and deploy industry and function-specific big data applications. To get started, please email your questions to info@apervi.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/apervi-1.png"}, "Pivotal": {"url": "http://pivotal.io/", "company_name": "Pivotal", "blurb": "PivotalPivotal offers a modern approach to technology that organizations need to thrive in a new era of business innovation. Our solutions intersect cloud, big data and agile development, creating a framework that increases data leverage, accelerates application delivery, and decreases costs, while providing enterprises the speed and scale they need to compete.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/pivotal.png"}, "Data Science Central": {"url": "http://www.datasciencecentral.com", "company_name": "Data Science Central", "blurb": "Data Science CentralData Science Central (DSC) is the online resource for Big Data Practitioners / Data Scientists. Featuring news, commentary, and social networking, DSC covers analytics, visualization, integration, BI, tools and trends, and also provides an outlet for career opportunities including talent sourcing.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/data_science_central.gif"}, "Objectivity": {"url": "http://www.objectivity.com/", "company_name": "Objectivity", "blurb": "ObjectivityObjectivity, Inc. is a pioneer in high-performance distributed database platforms that power mission-critical applications for the most demanding and complex data sources in the enterprise. Objectivity delivers organizational agility at scale by enabling our customers to enrich Big Data with Fast Data.\r\n\r\nWith a rich history serving Global 1000 customers and partners, Objectivity holds deep domain expertise in fusing vital information from massive data volumes to capture new revenue opportunities, drive competitive advantages, and deliver better business value. Objectivity is privately held with headquarters in San Jose, California.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/objectivity.png"}, "Trace3": {"url": "http://trace3.com/", "company_name": "Trace3", "blurb": "Trace3Trace3 empowers organizations to keep pace with the rapidly changing IT landscape by leveraging innovative technologies.  As an established SI, Trace3 has a successful history of discovering innovative solutions early on and vetting them out to find the best of breed technologies available in the market.  Our Big Data Intelligence Practice carries on that tradition. Our architects constantly evaluate up and coming technologies in our Innovation Labs and create end-to-end solutions to address industry needs.  By taking a flexible and holistic approach, our team of industry experts advise, assess, and architect large-scale data solutions.  In essence…Trace3 makes Big Data work.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/trace3.png"}, "Anodot": {"url": "http://www.anodot.com", "company_name": "Anodot", "blurb": "AnodotAnodot provides real time analytics and automated anomaly detection, discovering outliers in vast amounts of data and turning them into valuable business insights. \r\n\r\nData-centric companies in industries such as Ad-tech, ecommerce and IoT generate massive quantities of metrics, and analyzing them manually or with traditional business intelligence tools takes time and expertise. \r\n\r\nUsing patented machine learning algorithms, Anodot isolates issues and correlates them across multiple parameters in real time, eliminating business insight latency and supporting rapid business decisions through its uncovered insights.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/anodot_vertical.png"}, "EMC Corporation": {"url": "http://www.EMC.com", "company_name": "EMC Corporation", "blurb": "EMC CorporationEMC Corporation is a global leader in enabling businesses and service providers to transform their operations and deliver IT as a service. Fundamental to this transformation is cloud computing. Through innovative products and services, EMC accelerates the journey to cloud computing, helping IT departments to store, manage, protect and analyze their most valuable asset — information — in a more agile, trusted and cost-efficient way. Additional information about EMC can be found at www.EMC.com", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/emc-1.gif"}, "Cool Infographics": {"url": "http://www.coolinfographics.com/", "company_name": "Cool Infographics", "blurb": "Cool InfographicsCool Infographics is one of the most influential infographics and data visualization sites, handling up to 45,000 unique visitors a day. Here you will find cool designs, best practices, links to design tools, conference discounts, jobs board and more!", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/coolinfographic.png"}, "Confluent": {"url": "http://confluent.io/", "company_name": "Confluent", "blurb": "ConfluentConfluent, founded by the creators of Apache™ Kafka™, enables organizations to harness business value of live data. The Confluent Platform manages the barrage of stream data and makes it available throughout an organization. It provides various industries, from retail, logistics and manufacturing, to financial services and online social networking, a scalable, unified, real-time data pipeline that enables applications ranging from large volume data integration to big data analysis with Hadoop to real-time stream processing. Backed by Benchmark, Data Collective, Index Ventures and LinkedIn, Confluent is based in Mountain View. To learn more, please visit www.confluent.io.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/confluent.png"}, "Dell": {"url": "http://www.dell.com/PowerEdgeC", "company_name": "Dell", "blurb": "DellDell Inc. listens to customers and delivers innovative technology and services that give them the power to do more. Where others try to force-fit what they have to what you need, Dell Data Center Solutions (DCS) starts with collaborative problem-solving innovation to create exactly what you want/need - right-sized for your environment and your budget. Dell Data Center Solutions custom designs and delivers hyperscale servers including the PowerEdge C series, optimized Cloud and Big Data solutions and some of the most efficient Modular Data Centers. Leverage DCS experience and expertise in your scale-out data center to decrease your TCO. For more information visit: www.Dell.com?PowerEdgeC, www.Dell.com/OpenStack, www.Dell.com/Crowbar, www.Dell.com/Hadoop", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/dell-1.gif"}, "Waterline Data ": {"url": "http://www.waterlinedata.com/", "company_name": "Waterline Data ", "blurb": "Waterline Data Waterline Data was founded in 2013, backed by Menlo Ventures and Sigma West. The name “Waterline” came from the metaphor of a data lake where data is hidden below the waterline. The mission of Waterline Data is to deliver a governed data lake, and help data engineers and data scientists find the best suited without coding and manual exploration; in other words, they should be able to “Hadoop above the waterline.” Waterline Data was developed to leverage the power of Hadoop to automate the cataloging and governance of the data lake, and enable secure self-service to discover the right data.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/waterline_data.png"}, "Bloomberg": {"url": "http://www.bloomberglabs.com/", "company_name": "Bloomberg", "blurb": "BloombergBloomberg technology helps drive the world's financial markets. We provide communications platforms, data, analytics, trading platforms, news and information for the world's leading financial market participants. We deliver through our unrivaled software, digital platforms, mobile applications and state of the art hardware developed by Bloomberg technologists for Bloomberg customers. \r\n\r\n\r\nOur 3,000+ technologists work to define, architect, build and deploy complete systems and solutions that anticipate and fulfill our clients' needs and market demands. We offer critical enterprise computing solutions for the financial services industry to help organizations deliver, decipher and manage data to meet their needs and growing regulatory requirements", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/bloomberg.gif"}, "Cambridge Semantics": {"url": "http://www.cambridgesemantics.com/", "company_name": "Cambridge Semantics", "blurb": "Cambridge SemanticsCambridge Semantics (CSI), the Smart Data Company, is an enterprise analytics and data management company. It enables customers and partners to rapidly build interactive, real-time smart data solutions based on its graph Anzo Smart Data Platform (Anzo SDP). IT departments and business users gain better understanding and data value through the semantic linking, analysis and management of diverse data whether internal or external, structured or unstructured. The Anzo SDP smart data solutions are delivered with increased speed, at big data scale and at the fraction of the implementation costs of using traditional approaches. The company is based in Boston, Massachusetts.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cambridge_semantics.png"}, "Alpine Data Labs": {"url": "http://alpinenow.com/", "company_name": "Alpine Data Labs", "blurb": "Alpine Data LabsAlpine is the world's first collaborative, code-free solution for advanced analytics on Big Data. Alpine's end-to-end approach make predictive analytics approachable across the organization--regardless of technical skill.\r\nAlpine's unique \"in-cluster analytics\" technology leverages existing enterprise data platforms, including MPP databases and Hadoop.\r\nAlpine Chorus enables Big Data agility for your data science team. The first solution of its kind, Chorus provides an analytic productivity platform that enables the team to search, explore, visualize, and import data from anywhere in the organization. It provides rich social network features that revolve around datasets, insights, methods, and workflows, allowing data analysts, data scientists, IT staff, DBAs, executives, and other stakeholders to participate and collaborate on Big Data. Customers deploy Chorus to create an agile, analytic infrastructure; teams can create workspaces on the fly with self-service provisioning and then instantly start creating and sharing insights. Alpine Chorus cuts weeks and months from the analytics process by eliminating unnecessary data movement. Models run faster and are deployed directly within the database or Hadoop. Its workflow structure provides a transparent history of all transformations for auditing and data governance.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/apline-1.gif"}, "Software AG": {"url": "http://www.softwareag.com", "company_name": "Software AG", "blurb": "Software AGSoftware AG helps organizations achieve their business objectives faster. The company's big data, integration and business process technologies enable customers to drive operational efficiency, modernize their systems and optimize processes for smarter decisions and better service. Building on over 40 years of customer-centric innovation, the company is among the top 10 fastest-growing technology companies in the world and is ranked as a leader in 15 market categories, fueled by core products Adabas and Natural, Alfabet, ARIS, Apama, Terracotta and webMethods. For more information please visit www.softwareag.com/na", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/software_ag.gif"}, "Zoomdata": {"url": "http://www.zoomdata.com", "company_name": "Zoomdata", "blurb": "ZoomdataDesigned to support Big Data, Zoomdata's Stream Processing technology delivers real time data feeds to tablet and browser based devices. Through the use of touch screen devices, users are able to interact with data in real time, rewind the data, compare the data and share views with their colleagues.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/zoomdata-2.gif"}, "Dataiku": {"url": "http://www.dataiku.com/", "company_name": "Dataiku", "blurb": "DataikuDataiku develops Data Science Studio (DSS), the most productive development platform for data professionals. DSS is a collaborative, all-in-one platform that integrates all the functionalities required to build end-to-end highly specific services that turn raw data into business impacting predictions quickly. With its visual interface, DSS encourages collaborative work between both business & tech profiles. Because DSS integrates standard data and machine learning tools and technologies that users can transparently appropriate, the platform enables them to efficiently achieve their business goals all the while keeping complete control of their work. Try DSS out for free: http://www.dataiku.com/try", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/dataiku-1.png"}, "Cask": {"url": "http://cask.co", "company_name": "Cask", "blurb": "CaskCask is an open source big data software company focused on developers. Cask’s flagship offering, the Cask Data Application Platform, makes it possible to quickly and easily develop and deploy more powerful applications for Hadoop. Based in Palo Alto, CA, the company is backed by leading investors including Battery Ventures, Ignition Partners and Andreessen Horowitz. Learn more at cask.co.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cask.png"}, "Tamr, Inc.": {"url": "http://www.tamr.com/", "company_name": "Tamr, Inc.", "blurb": "Tamr, Inc.Tamr, Inc., connects and enriches the vast reserves of underutilized internal and external data, so enterprises can use all their data for analytics and downstream applications. Tamr's data-unification platform combines machine learning algorithms with collective human insight to identify sources, understand relationships and curate the massive variety of silo-ed data. The Tamr platform is deployed in production at information services providers, pharmaceutical firms, retailers and other customers. Based in Cambridge, Mass., Tamr was founded in 2013 by database industry veterans Andy Palmer, Mike Stonebraker and Ihab Ilyas with George Beskales, Daniel Bruckner and Alex Pagan.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/tamr.gif"}, "AnswerRocket": {"url": "http://answerrocket.com", "company_name": "AnswerRocket", "blurb": "AnswerRocketAnswerRocket enables self service big data exploration and visualization.   \r\n\r\nDespite the proliferation of self service analytics tools, enterprises still struggle with democratizing their data.  To answer unanticipated questions, users must enlist the help of technical resources.  And wait.  We think there is a better way.  \r\n\r\nAnswerRocket empowers people to access their enterprise data without technical help.   AnswerRocket provides this Google™-like, search-driven analytics experience by converting natural language questions into queries against Apache Drill, Spark SQL, SAP HANA, Amazon RedShift and many other sources. AnswerRocket answers these questions with visualizations any business user can understand, explore, and share.  Without waiting.  ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/answerrocket.png"}, "BMC Software": {"url": "http://www.bmc.com/", "company_name": "BMC Software", "blurb": "BMC SoftwareBMC Software helps leading companies around the world put technology at the forefront of business transformation, improving the delivery and consumption of digital services. From mainframe to cloud to mobile, BMC delivers innovative IT management solutions that have enabled more than 15,000 customers to leverage complex technology into extraordinary business performance-increasing their agility and exceeding anything they previously thought possible.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/bmc.png"}, "Continuum Analytics Inc.": {"url": "http://continuum.io", "company_name": "Continuum Analytics Inc.", "blurb": "Continuum Analytics Inc.Continuum Analytics develops Anaconda, the leading modern open source analytics platform powered by Python. Continuum’s Python-based platform empowers organizations to analyze, manage and visualize big data - turning massive datasets into actionable insights and business value. \r\n\r\nContinuum's founders and developers have created or contribute to some of the most popular data science technologies, including NumPy, SciPy, Pandas, IPython, and many others. We are currently working on cutting edge open source projects including Blaze (scalable Python), Numba (Python LLVM compiler), and Bokeh (Python interactive web plotting).\r\n\r\nTo learn more about the Anaconda platform, training and consulting services, visit http://www.continuum.io ", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/continnuum-analytics.png"}, "HP Security Voltage": {"url": "http://www.voltage.com/", "company_name": "HP Security Voltage", "blurb": "HP Security VoltageHP Atalla and HP Security Voltage drive leadership in data-centric security and encryption solutions. With over 80 patents and 51 years of expertise we protect the world’s largest brands and neutralize breach impact by securing sensitive data at rest, in use and in motion. Our solutions provide advanced encryption, tokenization and key management that protect sensitive data across enterprise applications, data processing IT, cloud, payments ecosystems, mission critical transactions, storage, and big data platforms. HP Atalla + HP Security Voltage solve one of the industry’s biggest challenges: simplifying the protection of sensitive data in even the most complex use cases.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/hp_security_voltage.png"}, "ODBMS.org": {"url": "http://www.odbms.org", "company_name": "ODBMS.org", "blurb": "ODBMS.orgThe Resource Portal for Big Data and New Data Management Technology: ODBMS.org is a vendor independent, web resource portal with free materials on: Big Data, Cloud platforms, Data Analytics, NewSQL, NoSQL, Graphs and RDF/XML data stores, and Object Databases. It serves software developers at commercial companies and in the open source community, as well as faculty and students at educational and research institutions. It includes the ODBMS Industry Watch Blog.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/odbms2.gif"}, "Google": {"url": "https://cloud.google.com/", "company_name": "Google", "blurb": "GoogleGoogle Cloud Platform enables developers to build, test and deploy applications on Google’s highly-scalable and reliable infrastructure. Choose from computing, storage and application services for your web, mobile and backend solutions.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/google_cloud_platform_vertical.png"}, "IT Central Station": {"url": "http://www.itcentralstation.com/", "company_name": "IT Central Station", "blurb": "IT Central StationIT Central Station, aka “Yelp for Enterprise Tech,” is the leading product review site of hadoop and big data solutions as well as other enterprise tech products. IT Central Station reaches over 22 million professionals who tap into a community of other real users in order to make the best buying decision.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/itcentral.png"}, "Splice Machine": {"url": "http://www.splicemachine.com", "company_name": "Splice Machine", "blurb": "Splice MachineSplice Machine's Hadoop RDBMS is designed to scale real-time applications using commodity hardware without application rewrites. The Splice Machine database is a modern, scale-out alternative to traditional RDBMSs, such as Oracle®, MySQL™, IBM DB2® and Microsoft SQL Server®, that can deliver over a 10x improvement in price/performance. As a full-featured Hadoop RDBMS with ACID transactions, the Splice Machine database helps customers power real-time applications and operational analytics, especially as they approach Big Data scale.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/splicemachine.png"}, "Trifacta": {"url": "http://www.trifacta.com/", "company_name": "Trifacta", "blurb": "TrifactaTrifacta, the pioneer in data transformation, significantly enhances the value of an enterprise's Big Data by enabling users to easily transform raw, complex data into clean and structured inputs for analysis. Leveraging decades of innovative work in human-computer interaction, scalable data management and machine learning, Trifacta's unique technology creates a bi-directional partnership between user and machine, with each component learning from the other and becoming smarter through use. Trifacta is backed by venture capital firms Greylock and Accel and is headquartered in San Francisco. Its founders and technical advisors include global leaders in data science, interaction design and big data.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/trifacta2.gif"}, "Kyvos Insights": {"url": "http://www.kyvosinsights.com/", "company_name": "Kyvos Insights", "blurb": "Kyvos InsightsKyvos is committed to unlock the power of Big Data Analytics with its unique \"OLAP on Hadoop\" technology. This allows you to build cubes in-place on Hadoop with linear scalability, eliminating the limitations of traditional OLAP solutions, and enabling interactive multi-dimensional analytics on your Big Data. Users can visualize, explore and analyze their data interactively on Hadoop with no programming required. Come and explore Kyvos to experience OLAP on Hadoop at unprecedented scale. See you at Booth #316.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/kyvos.png"}, "Quantopian": {"url": "https://www.quantopian.com", "company_name": "Quantopian", "blurb": "QuantopianQuantopian is a crowd-sourced hedge fund. We provide an algorithmic trading platform for our global community of independent quantitative investors to research, backtest, and live trade their investment strategies.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/quantopian.png"}, "Dataguise, Inc.": {"url": "http://www.dataguise.com/", "company_name": "Dataguise, Inc.", "blurb": "Dataguise, Inc.Dataguise is the leader in data-centric discovery and security solutions for Big Data. Organizations concerned about data breaches, privacy and compliance (PII, PCI-DSS, HIPAA, HITECH, etc.) rely on Dataguise for no-coding/no-scripting discovery, protection, audit and governance for sensitive data in Hadoop, DBMS and other Big Data environments. Dataguise complements volume-level encryption tools and perimeter-based security strategies by providing the most granular cell-level discovery and protection. Dataguise's customers include the largest credit-card processing firms, healthcare organizations, communications/mobile providers, retail and government.  Dataguise works with 100% of the major Hadoop distributions and is a certified partner of Cloudera, Hortonworks, MapR and Amazon.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/dataguise.png"}, "Quantum Corporation": {"url": "http://www.quantum.com/", "company_name": "Quantum Corporation", "blurb": "Quantum CorporationQuantum is a leading expert in scale-out storage, archive and data protection, providing solutions for capturing, sharing and preserving digital assets over the entire data lifecycle. From small businesses to major enterprises, more than 100,000 customers have trusted Quantum to address their most demanding data workflow challenges. With Quantum, customers can Be Certain™ they have the end-to-end storage foundation to maximize the value of their data by making it accessible whenever and wherever needed, retaining it indefinitely and reducing total cost and complexity. See how at www.quantum.com/customerstories.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/quantum.png"}, "ThreatBrief": {"url": "http://ThreatBrief.com.", "company_name": "ThreatBrief", "blurb": "ThreatBriefModeled after the example of the President's Daily Brief (PDB), ThreatBrief.com is focused on providing actionable information to executive decision-makers. Our timely updates of news and context covers topics of cybersecurity, analytics, and technologies. Engage with us online at http://ThreatBrief.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/threatbrief-1.png"}, "Trillium Software": {"url": "http://www.trilliumsoftware.com/", "company_name": "Trillium Software", "blurb": "Trillium SoftwareTrillium Software, a Harte Hanks company, is a leading, global enterprise data quality solutions provider. Our data quality specialists help organizations achieve increased business from data management initiatives and business-critical processes by providing enterprise data profiling and cleansing software and services. Trillium offers industry-specific business solutions that help solve data problems experienced by professionals in all industries, including retail, consumer products, financial services, and telecommunications. Trillium’s full complement of technologies and services includes global data profiling, data cleansing, enrichment, and data linking for e-business, customer relationship management, Big Data, data governance, supply chain management, data warehouse, and other enterprise applications.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/trillium-software.png"}, "Cloudwick": {"url": "http://www.cloudwick.com", "company_name": "Cloudwick", "blurb": "CloudwickCloudwick (www.cloudwick.com) is the leading open source systems integrator to the Global 1000, specializing in big data professional, contracting, and managed services. As a certified systems integration partner to Databricks, Cloudera, Hortonworks, DataStax and AWS, our Hadoop, Spark and NoSQL administrators, developers and data scientists build, operate, monitor and manage on-premise and cloud big data systems for leading enterprises including 3M, Bank of America, Comcast, Home Depot, Intuit, JP Morgan, NetApp, Target, Visa, Walmart and more.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/cloudwick-1.gif"}, "UNIFI Software": {"url": "http://www.unifisoftware.com/", "company_name": "UNIFI Software", "blurb": "UNIFI SoftwareUNIFi Software is the only enterprise-class data integration platform that runs natively on Hadoop. Designed by business people for business people, UNIFi delivers self-service data integration to the business users who analyze the data, unlocking its full potential. With direct access to more data, business users can pursue “what if” scenarios without relying on IT—dramatically increasing time to insight while freeing up IT resources. UNIFi runs on existing infrastructure, making processing super-fast, and all at a fraction of the cost of traditional solutions. Learn more at unifisoftware.com.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/unif.png"}, "Deloitte Consulting ": {"url": "http://www.deloitteanalytics.com", "company_name": "Deloitte Consulting ", "blurb": "Deloitte Consulting Today’s analytics tools give business leaders the ability to keep pace with the explosion of data underway today, harness that data to identify hidden insights, and push them out to a wider cross section of their organizations. It can be used anywhere an organization has data – but that doesn’t mean it should be. You have to know which questions you should be answering, not just the ones you could answer.\r\nThat’s where Deloitte excels. Deloitte Analytics helps organizations identify their business analytics needs and spans all of Deloitte’s functional businesses to address the continuum of opportunities. www.deloitteanalytics.com / @deloitteBA.\r\n", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/deloitte.png"}, "Solix Technologies Inc.": {"url": "http://www.solix.com/", "company_name": "Solix Technologies Inc.", "blurb": "Solix Technologies Inc.Solix Technologies, Inc., the leading provider of Enterprise Data Management (EDM) solutions, helps businesses improve application performance, reduce storage costs, and meet compliance and data privacy requirements by achieving Information Lifecycle Management (ILM) goals. Solix Big Data Suite offers an ILM framework for Enterprise Archiving and Solix Data Lake applications with Apache Hadoop as an enterprise data repository. The Solix Enterprise Data Management Suite (Solix EDMS) enables organizations to implement Database Archiving, Test Data Management (Data Subsetting), Data Masking and Application Retirement across all enterprise data.\r\n\r\nSolix Technologies, headquartered in Santa Clara, California operates worldwide through VAR's and System Integrators.", "imgsrc": "http://cdn.oreillystatic.com/conferences/images/logos/solix.png"}}